cicada-nymph.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-07-28 Thu 02:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>小蟬 / cicada-nymph</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="謝宇恆 / XIE Yuheng" />
<link rel="stylesheet" href="https://xieyuheng.github.io/asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
近死之心 莫使復陽也
</div>
<div id="content">
<h1 class="title">小蟬 / cicada-nymph</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga27444d"><span class="done todo">todo</span> </a>
<ul>
<li><a href="#org45c1bbd">add length field into jo in assembly code&#xa0;&#xa0;&#xa0;<span class="tag"><span class="maybe">maybe</span></span></a></li>
<li><a href="#org5bd126b">memory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="limit">limit</span></span></a></li>
<li><a href="#orgfc2a140">reading-stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="limit">limit</span></span></a></li>
<li><a href="#org73bcf7b">div&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bug">bug</span></span></a></li>
<li><a href="#orgd8b135">stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="limit">limit</span></span></a></li>
<li><a href="#org1a6e822">string-reverse!&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bug">bug</span></span></a></li>
</ul>
</li>
<li><a href="#org2a89c7f">prolog</a>
<ul>
<li><a href="#org64586e9"><span class="todo note">note</span> conditional preprocessing</a></li>
<li><a href="#orgf661c18">platform configuration</a></li>
<li><a href="#org2277e96">misc</a></li>
<li><a href="#orgcd521d6">cell_size&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#orga1ff92b">cell_size&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#org8403cae">header&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#orgff479c1">format&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#org55a5623">entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#org17a955b">header&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#orge8cac7c">format&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#org875ea93">entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#org897c344">memory allocation in un_initialized_memory</a></li>
</ul>
</li>
<li><a href="#org96d9b81">argument-stack</a>
<ul>
<li><a href="#orgd7c52ca"><span class="todo note">note</span> stack</a></li>
<li><a href="#org84d762">memory allocation</a></li>
<li><a href="#orgf0b6cf1">pointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#orga155ead">push &amp; pop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#org1a87a91">pointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#org98133d5">push &amp; pop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
</ul>
</li>
<li><a href="#org64020d4">return-stack</a>
<ul>
<li><a href="#org7ee867e"><span class="todo _">記</span> </a></li>
<li><a href="#orgbfad70">memory allocation</a></li>
<li><a href="#org2898d45">pointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#orga9edac5">push &amp; pop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#orge5102f3">pointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#org4477a8d">push &amp; pop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
</ul>
</li>
<li><a href="#org4b4d0f0">next</a>
<ul>
<li><a href="#orgd6112ae">macro next</a></li>
<li><a href="#org60e653a"><span class="todo note">note</span> play with jo &amp; jojo</a></li>
</ul>
</li>
<li><a href="#org7daaf22">function-jo</a>
<ul>
<li><a href="#orgdbbb7d2"><span class="todo note">note</span> jo</a></li>
<li><a href="#orgd5f5ecb">offset of jo</a></li>
<li><a href="#org8851c88"><span class="todo note">note</span> link</a></li>
<li><a href="#org994cbb9">offset of link</a></li>
<li><a href="#org245ef4">null link</a></li>
<li><a href="#org32f474e"><b>string-area</b></a>
<ul>
<li><a href="#orgacfb46">memory allocation</a></li>
<li><a href="#org2837e17">ASSEMBLY__length_string</a></li>
<li><a href="#orgaaef7d9">ASSEMBLY__make_string</a></li>
</ul>
</li>
<li><a href="#org16111ff"><span class="todo note">note</span> </a></li>
<li><a href="#orgf3dcfe5">define_function</a></li>
<li><a href="#org2f493c5">explain$function</a></li>
</ul>
</li>
<li><a href="#org65852ef">primitive-function-jo</a>
<ul>
<li><a href="#org24601b6"><span class="todo note">note</span> </a></li>
<li><a href="#orga8b41e8">define_primitive_function</a></li>
</ul>
</li>
<li><a href="#org5684749">variable-jo</a>
<ul>
<li><a href="#org7f78325"><span class="todo note">note</span> </a></li>
<li><a href="#orgd57b258">define_variable</a></li>
<li><a href="#org966f410">explain$variable&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#org8117cc9">explain$variable&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
</ul>
</li>
<li><a href="#org6616390">jo</a>
<ul>
<li><a href="#org4dd034e">apply</a></li>
<li><a href="#org9bfd5e4"><b>cell-size</b></a></li>
<li><a href="#orgd6afee8">jo-&gt;explainer</a></li>
<li><a href="#org61e9782">jo-&gt;length</a></li>
<li><a href="#org8274059">jo,set-length</a></li>
<li><a href="#org93e077f">jo-&gt;body</a></li>
<li><a href="#orge10e831">primitive-function-jo?</a></li>
<li><a href="#orgaf3016">function-jo?</a></li>
<li><a href="#org6376de0">variable-jo?</a></li>
<li><a href="#orge238ac4">variable-jo-&gt;address</a></li>
</ul>
</li>
<li><a href="#org931bab6">string-area</a>
<ul>
<li><a href="#org7c60b12"><span class="todo note">note</span> interface</a></li>
<li><a href="#org89f8802"><b>string-area</b></a></li>
<li><a href="#orgeecc98">string-area,stay</a></li>
<li><a href="#org9a2819d">make-string</a></li>
</ul>
</li>
<li><a href="#orga454a1d">return-stack</a>
<ul>
<li><a href="#org8b8184c"><span class="todo note">note</span> return-point</a></li>
<li><a href="#org95e3652">offset of return-point</a></li>
<li><a href="#org314ce79">return-stack:*unit*</a></li>
<li><a href="#orgb4cd77"><span class="todo _">記</span> 插 珠珠 人返回棧 到某珠珠的前面 [等效替換法 以理解]</a></li>
<li><a href="#org21a7811">nothing</a></li>
<li><a href="#orgc64671b">return-stack:insert-jo</a></li>
<li><a href="#org51ae31a">get-return-stack-pointer</a></li>
<li><a href="#orgb7a880">apply-with-return-point</a></li>
</ul>
</li>
<li><a href="#org53b6a21">end &amp; tail-call</a>
<ul>
<li><a href="#orge8bd83c">end</a></li>
<li><a href="#orgf01085d">tail-call</a></li>
<li><a href="#orgbdf3567"><span class="todo note">note</span> explicit tail call in action</a></li>
</ul>
</li>
<li><a href="#org7fac706">helper function in assembly code</a>
<ul>
<li><a href="#orga2edc1a">__exit_with_tos&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a></li>
<li><a href="#org494bb2d">__exit_with_zero&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a></li>
<li><a href="#org2b92416">__exit_with_six&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a></li>
<li><a href="#org3fd2b0a">__write_string&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a></li>
<li><a href="#org830074">__reset_argument_stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a></li>
<li><a href="#orge1bcb73">__reset_return_stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a></li>
<li><a href="#org51ec906">__reset_syntax_stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a></li>
<li><a href="#orgbb189e4">__reset_local_variable</a></li>
<li><a href="#org42b0707">__reset_local_memory</a></li>
</ul>
</li>
<li><a href="#org65e5db0"><b>the-story-begin</b></a>
<ul>
<li><a href="#org91ce231"><span class="todo _">記</span> 匯編代碼中的初始化</a></li>
<li><a href="#org1b06f40">begin_to_interpret_threaded_code&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a></li>
<li><a href="#orga5136c3">initialization</a></li>
<li><a href="#org3cfdb28"><span class="todo note">note</span> top-level-REPL</a></li>
<li><a href="#org43952a9">report-return-stack-is-empty-and-exit</a></li>
<li><a href="#org78b3e3d">reset-top-level-REPL</a></li>
<li><a href="#org7118f6a">exit_with_tos a.k.a. bye</a></li>
<li><a href="#org9e400e5">little_test</a></li>
</ul>
</li>
<li><a href="#org9979052">instruction</a>
<ul>
<li><a href="#orgf896f91"><span class="todo note">note</span> side-effect</a></li>
<li><a href="#org8c93430"><span class="todo note">note</span> naming</a></li>
<li><a href="#orga9c1146">instruction,literal</a></li>
<li><a href="#org761f66">instruction,address</a></li>
<li><a href="#orgfce615c">instruction,branch</a></li>
<li><a href="#org75ea086">instruction,false?branch</a></li>
</ul>
</li>
<li><a href="#orgb634106">the stack</a>
<ul>
<li><a href="#orga60f966"><span class="todo note">note</span> </a></li>
<li><a href="#org25675f4">drop</a></li>
<li><a href="#org95f768e">dup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#orgf4db053">dup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#orgcec814b">over&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#org70c0abf">over&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#org9caf9fa">tuck</a></li>
<li><a href="#org5656ea0">swap</a></li>
<li><a href="#org81127fe">address</a></li>
<li><a href="#org350be05">pointer</a></li>
<li><a href="#org8ac64f2">set-argument-stack-pointer</a></li>
</ul>
</li>
<li><a href="#orgf29e76f">bool</a>
<ul>
<li><a href="#org8b60876">false &amp; true</a></li>
<li><a href="#org4eb5b23">false? &amp; true?</a></li>
<li><a href="#orgac6c0b9">and &amp; or &amp; not &amp; xor</a></li>
</ul>
</li>
<li><a href="#org6c162c9">fixnum</a>
<ul>
<li><a href="#orgcc1e604">zero &amp; one</a></li>
<li><a href="#orgc5fca29">zero? &amp; one?</a></li>
<li><a href="#orgb88f754">add &amp; sub&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#org7956798">add &amp; sub&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#org32f9827">mul</a></li>
<li><a href="#org7211326">negate</a></li>
<li><a href="#org291a842">power</a></li>
<li><a href="#orga5a01e4">div &amp; mod</a></li>
<li><a href="#org1b521f6">equal? &amp; greater-than? &amp; less-than?</a></li>
<li><a href="#orgfbda9e3">equal2?</a></li>
<li><a href="#org6c71623">negative? &amp; positive?</a></li>
<li><a href="#org64fa053">within?</a></li>
<li><a href="#org8b0c953"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#org7325ce4">memory</a>
<ul>
<li><a href="#org3193e62"><span class="todo note">note</span> get &amp; set</a></li>
<li><a href="#org2ea6378"><span class="todo note">note</span> endianness of n-get &amp; n-set</a></li>
<li><a href="#org3c101e2">get&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#orgcd01e4">set&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#org6dde778">get&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#org9a6bad1">set&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#org5984fca">clear</a></li>
</ul>
</li>
<li><a href="#org69bb1f1">bit</a>
<ul>
<li><a href="#org5c163de"><span class="todo note">note</span> </a></li>
<li><a href="#org6cbd36c">or &amp; and &amp; xor &amp; invert&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#org216c4a9">or &amp; and &amp; xor &amp; invert&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#org97d44dd">left &amp; right[,sign]</a></li>
<li><a href="#orgcd2a178">get &amp; set &amp; clear &amp; invert</a></li>
<li><a href="#org77ef079">find-[lowest|highest]-set-bit</a></li>
<li><a href="#orgac93810"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#orgc0355d9">write-byte</a>
<ul>
<li><a href="#org5d7a8f9">write-byte&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#orgb063a31">write-byte&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
</ul>
</li>
<li><a href="#orgcbd72a1">reading-stack</a>
<ul>
<li><a href="#org4d3f530"><span class="todo note">note</span> </a></li>
<li><a href="#orgd655150">memory allocation</a></li>
<li><a href="#org79c80a9">push &amp; pop &amp; drop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#org27a939c">push &amp; pop &amp; drop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#orgc6273aa">tos</a></li>
<li><a href="#org3df3f05">reading-stack-empty?</a></li>
</ul>
</li>
<li><a href="#orgc07c3f9">read-byte</a>
<ul>
<li><a href="#orgee0832"><span class="todo note">note</span> end of file</a></li>
<li><a href="#orge656079"><span class="todo note">note</span> factoring</a></li>
<li><a href="#orgc77e82f">read-line-from-stdin&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#org7b8311">read-line-from-stdin&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#org732a663"><span class="done test">test</span> read-line-from-stdin</a></li>
<li><a href="#orgea3ae1b">read-byte</a></li>
</ul>
</li>
<li><a href="#orgf9c337e">load-core-file</a></li>
<li><a href="#orgc1cf5a1">byte</a>
<ul>
<li><a href="#org762ce7c">space-byte?</a></li>
<li><a href="#orga43063f">bar-ket-byte?</a></li>
<li><a href="#orgb485ae1">digit-byte?</a></li>
<li><a href="#org281a9cf">digit-byte-&gt;number &amp; number-&gt;digit-byte</a></li>
</ul>
</li>
<li><a href="#org7e84198">buffer</a>
<ul>
<li><a href="#orgf962804"><span class="todo note">note</span> </a></li>
<li><a href="#orga9b45d8">compare-buffer</a></li>
<li><a href="#org988a4fe">cursor-&gt;next-matching-byte</a></li>
</ul>
</li>
<li><a href="#org5a87b1e">string</a>
<ul>
<li><a href="#orgf212cde"><span class="todo note">note</span> io about string</a></li>
<li><a href="#org77c5d74">write-string</a></li>
<li><a href="#orgfab5f36">pretty_write_string</a></li>
<li><a href="#org801cbe4">string:empty?</a></li>
<li><a href="#org2a47304">string:equal?</a></li>
<li><a href="#org5f47d33">string:byte</a></li>
<li><a href="#org4049599">string:byte-tail</a></li>
<li><a href="#org7d68499">string:byte-back</a></li>
<li><a href="#org47630ca">string-&gt;buffer!</a></li>
<li><a href="#orgc1d10ef">string-reverse!&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#org4044070">string-reverse!&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#orgd3f1316">one-byte-string?</a></li>
<li><a href="#orgf3bc476">zero-string?</a></li>
<li><a href="#orgc94e208">digit-string?</a></li>
<li><a href="#org8e895f3">integer-string?</a></li>
<li><a href="#org24fe7cc">digit-string-&gt;number</a></li>
<li><a href="#orge161bc3">string-&gt;integer</a></li>
<li><a href="#org7a74f3b">string:find-byte</a></li>
<li><a href="#org1dc900c"><span class="done test">test</span> </a></li>
<li><a href="#orgfc92b03">string-end,byte</a></li>
<li><a href="#org6fc80bb"><span class="todo note">note</span> </a></li>
<li><a href="#orgfb1ed7a">string:space?</a></li>
<li><a href="#org37f1f47">string:word-begin</a></li>
<li><a href="#org936a7b7">string:word-end</a></li>
<li><a href="#orgb45825b">string:word</a></li>
<li><a href="#org53a871f">string:word-tail</a></li>
</ul>
</li>
<li><a href="#org530af3b">write number</a>
<ul>
<li><a href="#orgb5226b5">write-number</a></li>
<li><a href="#org9dea4d7">write-integer</a></li>
<li><a href="#org7fc156b">pretty_write_integer</a></li>
</ul>
</li>
<li><a href="#org2305b22">word</a>
<ul>
<li><a href="#org3d4965e"><span class="todo note">note</span> io about word</a></li>
<li><a href="#org3a23795"><span class="todo note">note</span> bar-ket</a></li>
<li><a href="#org6b276da">memory allocation</a></li>
<li><a href="#org31bc39d">read-word-&gt;buffer</a></li>
<li><a href="#org4a6ee9b">read-word</a></li>
</ul>
</li>
<li><a href="#org235633e">link</a>
<ul>
<li><a href="#org466f0a1">last-link?</a></li>
<li><a href="#org2cdf0f1">link-&gt;next-link</a></li>
<li><a href="#org485f6c">link-&gt;name-string</a></li>
<li><a href="#orgad42f93">link-&gt;jo</a></li>
<li><a href="#org4354d3">link,set-jo</a></li>
<li><a href="#orgdf8e244"><b>link</b></a></li>
<li><a href="#orge365ca8"><span class="todo note">note</span> about find</a></li>
<li><a href="#org99a163c"><span class="todo _">記</span> 遍歷鏈表的方式</a></li>
<li><a href="#orga76c9d">find-link</a></li>
</ul>
</li>
<li><a href="#org9ed96e4">basic-REPL</a>
<ul>
<li><a href="#org78d5cd7">word-interpreter</a></li>
<li><a href="#orgfe4f120">basic-REPL</a></li>
</ul>
</li>
<li><a href="#org2e7af8b">colon semicolon</a>
<ul>
<li><a href="#org9a75f2c"><span class="todo note">note</span> </a></li>
<li><a href="#orge3f9a9d">[colon|semicolon]-string?</a></li>
<li><a href="#orgb866435">comment-[begin|end]-string?</a></li>
<li><a href="#orgbbdb82e">colon &amp; semicolon</a></li>
<li><a href="#orgd66f701">ignore-comment</a></li>
<li><a href="#org4c0c4f4"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#org6f7d4a2">jojo-area</a>
<ul>
<li><a href="#orgd662b74"><span class="todo note">note</span> </a></li>
<li><a href="#org90ce64">memory allocation</a></li>
<li><a href="#orgc32cd41">jojo-area,stay</a></li>
</ul>
</li>
<li><a href="#org947123">make-link</a></li>
<li><a href="#org3e68ae6">make-jo-head</a></li>
<li><a href="#orgbe79f82">syntax-stack</a>
<ul>
<li><a href="#orgdcf84cb"><span class="todo _">記</span> </a></li>
<li><a href="#org80bd8fb">memory allocate</a></li>
<li><a href="#orgf0262f5">push-syntax-stack</a></li>
<li><a href="#org6b33a79">pop-syntax-stack</a></li>
<li><a href="#orgfbe7dd0">tos-syntax-stack</a></li>
<li><a href="#orgbfd3d16">drop-syntax-stack</a></li>
<li><a href="#orgad8f2e7">syntax-stack-empty?</a></li>
<li><a href="#org20d6ed2">find-syntax</a></li>
</ul>
</li>
<li><a href="#org5c361a6">syntax-rule-set</a>
<ul>
<li><a href="#org3396e3d"><span class="todo _">記</span> 使用</a></li>
<li><a href="#orga360c3c"><span class="todo note">note</span> border</a></li>
<li><a href="#orgfd196c5"><span class="todo _">記</span> interface</a></li>
<li><a href="#org8b4e4c8">syntax-rule:*unit*</a></li>
<li><a href="#org3e88744">syntax-rule:get-predicate</a></li>
<li><a href="#orgec7cb95">syntax-rule:get-function</a></li>
<li><a href="#org83a85ec">syntax-rule:get</a></li>
<li><a href="#orgb090c98">syntax-rule-set:get-border</a></li>
<li><a href="#orgab651c0">syntax-rule-set:set-border</a></li>
<li><a href="#org749d337">syntax-rule:add</a></li>
<li><a href="#org701bbef">syntax-rule-set:find</a></li>
</ul>
</li>
<li><a href="#orgd17150a">jojo-compiler:*syntax-rule-set*</a>
<ul>
<li><a href="#orgb22a029"><span class="todo note">note</span> </a></li>
<li><a href="#orgd892642">jojo-compiler-syntax:integer-string</a></li>
<li><a href="#org31f40ce">literal-word:address?</a></li>
<li><a href="#orgbf4c94c">jojo-compiler-syntax:address</a></li>
<li><a href="#org410343e">literal-word:jo?</a></li>
<li><a href="#org6ccc610">jojo-compiler-syntax:jo</a></li>
<li><a href="#org92bb4d1">literal-word:double-quote?</a></li>
<li><a href="#org4c7b403">syntax,double-quote,jojo-compiler</a></li>
<li><a href="#orgad1b185"><span class="todo note">note</span> </a></li>
<li><a href="#orgdc6e51e">syntax,comment,jojo-compiler</a></li>
<li><a href="#orgc37e0a3">memory allocation</a></li>
<li><a href="#org757600b">jojo-compiler:*syntax-rule-set*</a></li>
<li><a href="#org656395c">init,syntax-rule-set:jojo-compiler</a></li>
</ul>
</li>
<li><a href="#org5a64627">jojo-compiler</a>
<ul>
<li><a href="#org1fba1e1"><span class="todo note">note</span> </a></li>
<li><a href="#org9aff250">jojo-compiler,dispatch-word</a></li>
<li><a href="#org4438378">jojo-compiler</a></li>
</ul>
</li>
<li><a href="#orga1e7859">define-function</a>
<ul>
<li><a href="#orgca0225a"><span class="todo note">note</span> </a></li>
<li><a href="#orgf332061">define-function</a></li>
<li><a href="#org7faa1b7"><span class="done test">test</span> </a></li>
<li><a href="#org752d8f2"><span class="done test">test</span> double-quote</a></li>
</ul>
</li>
<li><a href="#orgc85753a">define-variable,with-tos</a>
<ul>
<li><a href="#org733fbf4">define-variable,with-tos</a></li>
<li><a href="#org20558be"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#orgaa8a50d"><b>local-variable</b></a>
<ul>
<li><a href="#org7bc80d1"><span class="todo _">記</span> 有名字的局部變量 與 變長的局部數據</a></li>
<li><a href="#orgc122860"><span class="todo _">記</span> 再增加局部變元支持之後 需要重寫的部分</a>
<ul>
<li><a href="#org44ecbef">詮釋者 與 收尾詞</a></li>
<li><a href="#org8fc1e16">語法擴展方面的支持</a></li>
</ul>
</li>
<li><a href="#org291d9b4"><span class="todo _">記</span> 總結</a>
<ul>
<li><a href="#orga393bd2">interface</a></li>
<li><a href="#org2246b7d">語義特點總結</a></li>
<li><a href="#orgb7e1b4e">語用特點總結</a></li>
</ul>
</li>
<li><a href="#org29d6a3f"><span class="todo _">記</span> 關於分支結構</a></li>
<li><a href="#org8ea7fa">memory allocation</a></li>
<li><a href="#org56b55a2"><span class="todo _">記</span> 注意結尾詞會初始化局部變量指針</a></li>
<li><a href="#org700f0fc">allocate-local-variable</a></li>
<li><a href="#org75b80aa"><span class="todo note">note</span> many get &amp; set</a></li>
<li><a href="#orgb01ebd">instruction,local-variable,[n-get|n-set]&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></a></li>
<li><a href="#org4a121ee">instruction,local-variable,[n-get|n-set]&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></a></li>
<li><a href="#orgb567284"><span class="todo note">note</span> example result</a></li>
<li><a href="#orgbbd6bfe"><span class="done test">test</span> </a></li>
<li><a href="#org8b46ad8"><span class="done test">test</span> nested call</a></li>
<li><a href="#orgb1f9bd9"><span class="todo _">記</span> 問題</a>
<ul>
<li><a href="#org243fff0">nested block</a></li>
<li><a href="#org7a406c5">branch</a></li>
</ul>
</li>
<li><a href="#orgf0091a0">local-variable-table</a>
<ul>
<li><a href="#org990a0bc"><span class="todo _">記</span> </a></li>
<li><a href="#org4ceb115"><span class="todo _">記</span> 接口</a></li>
<li><a href="#orgb56c063">memory allocation</a></li>
<li><a href="#orgf8211ec">local-variable-table,clear</a></li>
<li><a href="#orga312bad">local-variable-table,insert</a></li>
<li><a href="#orgd07431d">local-variable-table,find</a></li>
<li><a href="#org47a30d8">count-front-colon</a></li>
</ul>
</li>
<li><a href="#orga240090">two syntaxes</a>
<ul>
<li><a href="#org9751635">local-variable-get-word?</a></li>
<li><a href="#org93f4856">jojo-compiler-syntax:local-variable-get</a></li>
<li><a href="#org27232be">local-variable-set-word?</a></li>
<li><a href="#orge896885">jojo-compiler-syntax:local-variable-set</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf9d9978"><b>local-memory</b></a>
<ul>
<li><a href="#org3020c92"><span class="todo _">記</span> </a></li>
<li><a href="#orgb0073e5"><span class="todo _">記</span> 使用</a></li>
<li><a href="#org569a159"><b>local-memory-even</b></a></li>
<li><a href="#orgcac0793"><b>local-memory-odd</b></a></li>
<li><a href="#org20074ce"><span class="todo _">記</span> 奇偶性</a></li>
<li><a href="#org8c29d59">allocate-local-memory</a></li>
<li><a href="#org7bf71e9">allocate-conjugate-local-memory</a></li>
<li><a href="#orgf632b10"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#orgc78f3ba">syscall</a>
<ul>
<li><a href="#orga79c513"><span class="todo note">note</span> </a></li>
<li><a href="#org5c326ed">string-&gt;syscall-string</a></li>
<li><a href="#org8cbd323">string-&gt;syscall-string-2</a></li>
<li><a href="#org3895db0">syscall&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
<li><a href="#org799e6a1">syscall&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></a></li>
</ul>
</li>
<li><a href="#org288a128">epilog</a>
<ul>
<li><a href="#orgeed509d">constant</a></li>
<li><a href="#org4d234b6">platform</a></li>
<li><a href="#org5849a23"><b>un-initialized-memory</b></a></li>
<li><a href="#orgdf8e3c1"><b>string-area,current-free-address</b></a></li>
<li><a href="#org6fe77cc">the_last_link_in_assembly_code</a></li>
<li><a href="#org3f62ef">un_initialized_memory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga27444d" class="outline-2">
<h2 id="orga27444d"><span class="done todo">todo</span> </h2>
<div class="outline-text-2" id="text-orga27444d">
</div><div id="outline-container-org45c1bbd" class="outline-3">
<h3 id="org45c1bbd">add length field into jo in assembly code&#xa0;&#xa0;&#xa0;<span class="tag"><span class="maybe">maybe</span></span></h3>
</div>
