cicada-nymph.org
** memory                             :limit:
   * need to protect the overloading of a variety of memories
** reading-stack                      :limit:
   * need to find a better way to protect reading-stack
   * now
     "1 2 3 add add . jo" eval-string
     will crush the interpreter
** div                                :bug:
   * div can not handle the following
     -8 2 div .
** stack                              :limit:
   * there are 64 positions below the all those stacks
     when you are belowing-stack so much
     bad things happen
** string-reverse!                    :bug:
   * string-reverse! can not apply on empty-string
* ===================================
* prolog
** ----------------------------------
** note conditional preprocessing
   * flower bar-ket can not be nested in fasm's "match"
     so
     1. when defining macro conditionally
        one should use "if eq" & "finish if"
     2. when doing "define" or "equ"
        one should use "match { }"
** platform configuration
   #+begin_src fasm :tangle cicada-nymph.fasm
   ;;;; before you compile the code
   ;;;; do not forget to choose your platform
   ;;;; in the following file

   include "platform-configuration.inc"
   #+end_src
** misc
   #+begin_src fasm :tangle cicada-nymph.fasm
   ;; in fasm, "dup" is a reserved word
   dup equ duplicate

   ;; in fasm, "end" is a reserved word
   finish equ end
   end equ exit
   #+end_src
** ----------------------------------
** cell_size                          :64bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   cell_size = 8 ;; (byte)
   xx equ dq

   }
   #+end_src
** cell_size                          :32bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =32bit, machine {

   cell_size = 4 ;; (byte)
   xx equ dd

   rax equ eax
   rbx equ ebx
   rcx equ ecx
   rdx equ edx

   rsp equ esp
   rbp equ ebp
   rsi equ esi
   rdi equ edi

   syscall equ int 80h

   }
   #+end_src
** ----------------------------------
** header                             :64bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   define linux64_sys_6_r8  r8
   define linux64_sys_5_r9  r9
   define linux64_sys_4_r10 r10
   define linux64_sys_3_rdx rdx
   define linux64_sys_2_rsi rsi
   define linux64_sys_1_rdi rdi
   define linux64_sys_n_rax rax

   define linux64_syscall_read   0
   define linux64_syscall_write  1
   define linux64_syscall_open   2
   define linux64_syscall_close  3
   define linux64_syscall_exit   60
   ;; about open & read & write

   }
   #+end_src
** format                             :64bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   format ELF64 executable 3

   }
   #+end_src
** entry                              :64bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   entry begin_to_interpret_threaded_code
   segment readable executable writeable

   }
   #+end_src
** ----------------------------------
** header                             :32bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =32bit, platform machine {

   define linux32_sys_6_ebp ebp
   define linux32_sys_5_edi edi
   define linux32_sys_4_esi esi
   define linux32_sys_3_edx edx
   define linux32_sys_2_ecx ecx
   define linux32_sys_1_ebx ebx
   define linux32_sys_n_eax eax

   define linux32_syscall_exit    1
   define linux32_syscall_read    3
   define linux32_syscall_write   4
   define linux32_syscall_open    5
   define linux32_syscall_close   6

   }
   #+end_src
** format                             :32bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =32bit, platform machine {

   format ELF executable 3

   }
   #+end_src
