cicada-nymph.html

<div id="outline-container-org5bd126b" class="outline-3">
<h3 id="org5bd126b">memory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="limit">limit</span></span></h3>
<div class="outline-text-3" id="text-org5bd126b">
<ul class="org-ul">
<li><p>need to protect the overloading of a variety of memories</p></li></ul>
</div>
</div>

<div id="outline-container-orgfc2a140" class="outline-3">
<h3 id="orgfc2a140">reading-stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="limit">limit</span></span></h3>
<div class="outline-text-3" id="text-orgfc2a140">
<ul class="org-ul">
<li><p>need to find a better way to protect reading-stack</p></li>
<li><p>now</p><p>"1 2 3 add add . jo" eval-string</p><p>will crush the interpreter</p></li></ul>
</div>
</div>

<div id="outline-container-org73bcf7b" class="outline-3">
<h3 id="org73bcf7b">div&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bug">bug</span></span></h3>
<div class="outline-text-3" id="text-org73bcf7b">
<ul class="org-ul">
<li><p>div can not handle the following</p><p>-8 2 div .</p></li></ul>
</div>
</div>

<div id="outline-container-orgd8b135" class="outline-3">
<h3 id="orgd8b135">stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="limit">limit</span></span></h3>
<div class="outline-text-3" id="text-orgd8b135">
<ul class="org-ul">
<li><p>there are 64 positions below the all those stacks</p><p>when you are belowing-stack so much</p><p>bad things happen</p></li></ul>
</div>
</div>

<div id="outline-container-org1a6e822" class="outline-3">
<h3 id="org1a6e822">string-reverse!&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bug">bug</span></span></h3>
<div class="outline-text-3" id="text-org1a6e822">
<ul class="org-ul">
<li><p>string-reverse! can not apply on empty-string</p></li></ul>
</div>
</div>
</div>


<div id="outline-container-org2a89c7f" class="outline-2">
<h2 id="org2a89c7f">prolog</h2>
<div class="outline-text-2" id="text-org2a89c7f">
</div><div id="outline-container-org64586e9" class="outline-3">
<h3 id="org64586e9"><span class="todo note">note</span> conditional preprocessing</h3>
<div class="outline-text-3" id="text-org64586e9">
<ul class="org-ul">
<li><p>flower bar-ket can not be nested in fasm's "match"</p><p>so</p><p><ol class="org-ol"></p><p><li>when defining macro conditionally</p><p>one should use "if eq" &amp; "finish if"</li></p><p><li>when doing "define" or "equ"</p><p>one should use "match { }"</li></ol></p></li></ul>
</div>
</div>

<div id="outline-container-orgf661c18" class="outline-3">
<h3 id="orgf661c18">platform configuration</h3>
<div class="outline-text-3" id="text-orgf661c18">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #FF8888;">;;;; before you compile the code</span>
<span style="color: #FF8888;">;;;; do not forget to choose your platform</span>
<span style="color: #FF8888;">;;;; in the following file</span>

<span style="color: #a6e22e;">include</span> <span style="color: #e6db74;">"platform-configuration.inc"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2277e96" class="outline-3">
<h3 id="org2277e96">misc</h3>
<div class="outline-text-3" id="text-org2277e96">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #FF8888;">;; in fasm, "dup" is a reserved word</span>
<span style="color: #f92672; font-weight: bold;">dup</span> <span style="color: #a6e22e;">equ</span> duplicate

<span style="color: #FF8888;">;; in fasm, "end" is a reserved word</span>
<span style="color: #f92672; font-weight: bold;">finish</span> <span style="color: #a6e22e;">equ</span> <span style="color: #f92672; font-weight: bold;">end</span>
<span style="color: #f92672; font-weight: bold;">end</span> <span style="color: #a6e22e;">equ</span> exit
</pre>
</div>
</div>
</div>


<div id="outline-container-orgcd521d6" class="outline-3">
<h3 id="orgcd521d6">cell_size&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-orgcd521d6">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

cell_size = <span style="color: #ae81ff;">8</span> <span style="color: #FF8888;">;; (byte)</span>
<span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #a6e22e;">equ</span> <span style="color: #66d9ef; font-weight: bold;">dq</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga1ff92b" class="outline-3">
<h3 id="orga1ff92b">cell_size&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-orga1ff92b">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

cell_size = <span style="color: #ae81ff;">4</span> <span style="color: #FF8888;">;; (byte)</span>
<span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #a6e22e;">equ</span> <span style="color: #66d9ef; font-weight: bold;">dd</span>

<span style="color: #fd971f;">rax</span> <span style="color: #a6e22e;">equ</span> <span style="color: #fd971f;">eax</span>
<span style="color: #fd971f;">rbx</span> <span style="color: #a6e22e;">equ</span> <span style="color: #fd971f;">ebx</span>
<span style="color: #fd971f;">rcx</span> <span style="color: #a6e22e;">equ</span> <span style="color: #fd971f;">ecx</span>
<span style="color: #fd971f;">rdx</span> <span style="color: #a6e22e;">equ</span> <span style="color: #fd971f;">edx</span>

<span style="color: #fd971f;">rsp</span> <span style="color: #a6e22e;">equ</span> <span style="color: #fd971f;">esp</span>
<span style="color: #fd971f;">rbp</span> <span style="color: #a6e22e;">equ</span> <span style="color: #fd971f;">ebp</span>
<span style="color: #fd971f;">rsi</span> <span style="color: #a6e22e;">equ</span> <span style="color: #fd971f;">esi</span>
<span style="color: #fd971f;">rdi</span> <span style="color: #a6e22e;">equ</span> <span style="color: #fd971f;">edi</span>

<span style="color: #a6e22e;">syscall</span> <span style="color: #a6e22e;">equ</span> <span style="color: #a6e22e;">int</span> <span style="color: #ae81ff;">80h</span>

}
</pre>
</div>
</div>
</div>


<div id="outline-container-org8403cae" class="outline-3">
<h3 id="org8403cae">header&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org8403cae">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

<span style="color: #a6e22e;">define</span> linux64_sys_6_r8  <span style="color: #fd971f;">r8</span>
<span style="color: #a6e22e;">define</span> linux64_sys_5_r9  <span style="color: #fd971f;">r9</span>
<span style="color: #a6e22e;">define</span> linux64_sys_4_r10 <span style="color: #fd971f;">r10</span>
<span style="color: #a6e22e;">define</span> linux64_sys_3_rdx <span style="color: #fd971f;">rdx</span>
<span style="color: #a6e22e;">define</span> linux64_sys_2_rsi <span style="color: #fd971f;">rsi</span>
<span style="color: #a6e22e;">define</span> linux64_sys_1_rdi <span style="color: #fd971f;">rdi</span>
<span style="color: #a6e22e;">define</span> linux64_sys_n_rax <span style="color: #fd971f;">rax</span>

<span style="color: #a6e22e;">define</span> linux64_syscall_read   <span style="color: #ae81ff;">0</span>
<span style="color: #a6e22e;">define</span> linux64_syscall_write  <span style="color: #ae81ff;">1</span>
<span style="color: #a6e22e;">define</span> linux64_syscall_open   <span style="color: #ae81ff;">2</span>
<span style="color: #a6e22e;">define</span> linux64_syscall_close  <span style="color: #ae81ff;">3</span>
<span style="color: #a6e22e;">define</span> linux64_syscall_exit   <span style="color: #ae81ff;">60</span>
<span style="color: #FF8888;">;; about open &amp; read &amp; write</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff479c1" class="outline-3">
<h3 id="orgff479c1">format&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-orgff479c1">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

<span style="color: #f92672; font-weight: bold;">format</span> ELF64 <span style="color: #f92672; font-weight: bold;">executable</span> <span style="color: #ae81ff;">3</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org55a5623" class="outline-3">
<h3 id="org55a5623">entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org55a5623">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

<span style="color: #f92672; font-weight: bold;">entry</span> begin_to_interpret_threaded_code
<span style="color: #f92672; font-weight: bold;">segment</span> <span style="color: #f92672; font-weight: bold;">readable</span> <span style="color: #f92672; font-weight: bold;">executable</span> <span style="color: #f92672; font-weight: bold;">writeable</span>

}
</pre>
</div>
</div>
</div>


<div id="outline-container-org17a955b" class="outline-3">
<h3 id="org17a955b">header&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org17a955b">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

<span style="color: #a6e22e;">define</span> linux32_sys_6_ebp <span style="color: #fd971f;">ebp</span>
<span style="color: #a6e22e;">define</span> linux32_sys_5_edi <span style="color: #fd971f;">edi</span>
<span style="color: #a6e22e;">define</span> linux32_sys_4_esi <span style="color: #fd971f;">esi</span>
<span style="color: #a6e22e;">define</span> linux32_sys_3_edx <span style="color: #fd971f;">edx</span>
<span style="color: #a6e22e;">define</span> linux32_sys_2_ecx <span style="color: #fd971f;">ecx</span>
<span style="color: #a6e22e;">define</span> linux32_sys_1_ebx <span style="color: #fd971f;">ebx</span>
<span style="color: #a6e22e;">define</span> linux32_sys_n_eax <span style="color: #fd971f;">eax</span>

<span style="color: #a6e22e;">define</span> linux32_syscall_exit    <span style="color: #ae81ff;">1</span>
<span style="color: #a6e22e;">define</span> linux32_syscall_read    <span style="color: #ae81ff;">3</span>
<span style="color: #a6e22e;">define</span> linux32_syscall_write   <span style="color: #ae81ff;">4</span>
<span style="color: #a6e22e;">define</span> linux32_syscall_open    <span style="color: #ae81ff;">5</span>
<span style="color: #a6e22e;">define</span> linux32_syscall_close   <span style="color: #ae81ff;">6</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8cac7c" class="outline-3">
<h3 id="orge8cac7c">format&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-orge8cac7c">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

<span style="color: #f92672; font-weight: bold;">format</span> ELF <span style="color: #f92672; font-weight: bold;">executable</span> <span style="color: #ae81ff;">3</span>

}
</pre>
</div>
</div>
</div>
