cicada-nymph.html

<div id="outline-container-org875ea93" class="outline-3">
<h3 id="org875ea93">entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org875ea93">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

<span style="color: #f92672; font-weight: bold;">entry</span> begin_to_interpret_threaded_code
<span style="color: #f92672; font-weight: bold;">segment</span> <span style="color: #f92672; font-weight: bold;">readable</span> <span style="color: #f92672; font-weight: bold;">executable</span> <span style="color: #f92672; font-weight: bold;">writeable</span>

}
</pre>
</div>
</div>
</div>


<div id="outline-container-org897c344" class="outline-3">
<h3 id="org897c344">memory allocation in un_initialized_memory</h3>
<div class="outline-text-3" id="text-org897c344">
<ul class="org-ul">
<li><p>implemented as a memory map</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">current_free_address$un_initialized_memory = address$un_initialized_memory

<span style="color: #f92672; font-weight: bold;">labeling</span>  <span style="color: #a6e22e;">equ</span> = current_free_address$un_initialized_memory
<span style="color: #66d9ef; font-weight: bold;">preserve</span>  <span style="color: #a6e22e;">equ</span> current_free_address$un_initialized_memory = current_free_address$un_initialized_memory +
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org96d9b81" class="outline-2">
<h2 id="org96d9b81">argument-stack</h2>
<div class="outline-text-2" id="text-org96d9b81">
</div><div id="outline-container-orgd7c52ca" class="outline-3">
<h3 id="orgd7c52ca"><span class="todo note">note</span> stack</h3>
<div class="outline-text-3" id="text-orgd7c52ca">
<ul class="org-ul">
<li><p>when doing "push"</p><p>a stack-pointer moves to lower address</p></li>
<li><p>note that another style is that</p><p>when doing "push"</p><p>a stack-pointer moves to higher address</p></li>
<li><p>the stack-pointer</p><p>always stores the address of current-free-address of the stack</p></li>
<li><p>note that another style is that</p><p>under the stack-pointer</p><p>there always stores the value of the-top-of-the-stack</p></li></ul>
</div>
</div>

<div id="outline-container-org84d762" class="outline-3">
<h3 id="org84d762">memory allocation</h3>
<div class="outline-text-3" id="text-org84d762">
<ul class="org-ul">
<li><p>for we do not build border-check</p><p>into the interface of pop and push</p><p>we allocation some memory below the stacks</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">size$argument_stack = <span style="color: #ae81ff;">1024</span> * <span style="color: #ae81ff;">1024</span> * cell_size

   <span style="color: #66d9ef; font-weight: bold;">preserve</span> <span style="color: #ae81ff;">64</span> * cell_size
address$argument_stack <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> size$argument_stack
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0b6cf1" class="outline-3">
<h3 id="orgf0b6cf1">pointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-orgf0b6cf1">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

<span style="color: #FF8888;">;; if you want to extend cicada in assembly</span>
<span style="color: #FF8888;">;; the following registers must NOT be used</span>

<span style="color: #a6e22e;">define</span> pointer$argument_stack <span style="color: #fd971f;">r15</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga155ead" class="outline-3">
<h3 id="orga155ead">push &amp; pop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-orga155ead">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

<span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">push_argument_stack</span> register \{
   <span style="color: #a6e22e;">mov</span> [pointer$argument_stack], register
   <span style="color: #a6e22e;">add</span> pointer$argument_stack, cell_size
\}

<span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">pop_argument_stack</span> register \{
   <span style="color: #a6e22e;">sub</span> pointer$argument_stack, cell_size
   <span style="color: #a6e22e;">mov</span> register, [pointer$argument_stack]
\}

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a87a91" class="outline-3">
<h3 id="org1a87a91">pointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org1a87a91">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

<span style="color: #a6e22e;">pointer$argument_stack</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$argument_stack

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org98133d5" class="outline-3">
<h3 id="org98133d5">push &amp; pop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org98133d5">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

<span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">push_argument_stack</span> register \{
   <span style="color: #f92672; font-weight: bold;">if</span> register <span style="color: #a6e22e;">in</span> &lt;eax&gt;
   <span style="color: #a6e22e;">push</span> <span style="color: #fd971f;">ebx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">ebx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">ebx</span>], register
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">ebx</span>, cell_size
   <span style="color: #a6e22e;">mov</span> [pointer$argument_stack], <span style="color: #fd971f;">ebx</span>
   <span style="color: #a6e22e;">pop</span> <span style="color: #fd971f;">ebx</span>
   <span style="color: #f92672; font-weight: bold;">else</span>
   <span style="color: #a6e22e;">push</span> <span style="color: #fd971f;">eax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">eax</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">eax</span>], register
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">eax</span>, cell_size
   <span style="color: #a6e22e;">mov</span> [pointer$argument_stack], <span style="color: #fd971f;">eax</span>
   <span style="color: #a6e22e;">pop</span> <span style="color: #fd971f;">eax</span>
   <span style="color: #f92672; font-weight: bold;">finish</span> <span style="color: #f92672; font-weight: bold;">if</span>
\}

<span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">pop_argument_stack</span> register \{
   <span style="color: #f92672; font-weight: bold;">if</span> register <span style="color: #a6e22e;">in</span> &lt;eax&gt;
   <span style="color: #a6e22e;">push</span> <span style="color: #fd971f;">ebx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">ebx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">ebx</span>, cell_size
   <span style="color: #a6e22e;">mov</span> register, [<span style="color: #fd971f;">ebx</span>]
   <span style="color: #a6e22e;">mov</span> [pointer$argument_stack], <span style="color: #fd971f;">ebx</span>
   <span style="color: #a6e22e;">pop</span> <span style="color: #fd971f;">ebx</span>
   <span style="color: #f92672; font-weight: bold;">else</span>
   <span style="color: #a6e22e;">push</span> <span style="color: #fd971f;">eax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">eax</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">eax</span>, cell_size
   <span style="color: #a6e22e;">mov</span> register, [<span style="color: #fd971f;">eax</span>]
   <span style="color: #a6e22e;">mov</span> [pointer$argument_stack], <span style="color: #fd971f;">eax</span>
   <span style="color: #a6e22e;">pop</span> <span style="color: #fd971f;">eax</span>
   <span style="color: #f92672; font-weight: bold;">finish</span> <span style="color: #f92672; font-weight: bold;">if</span>
\}

}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org64020d4" class="outline-2">
<h2 id="org64020d4">return-stack</h2>
<div class="outline-text-2" id="text-org64020d4">
</div><div id="outline-container-org7ee867e" class="outline-3">
<h3 id="org7ee867e"><span class="todo _">記</span> </h3>
<div class="outline-text-3" id="text-org7ee867e">
<ul class="org-ul">
<li><p>jo 的詮釋者</p><p>決定了 如何入這個棧</p></li>
<li><p>結尾詞</p><p>決定了 如何出這個棧</p></li></ul>
</div>
</div>

<div id="outline-container-orgbfad70" class="outline-3">
<h3 id="orgbfad70">memory allocation</h3>
<div class="outline-text-3" id="text-orgbfad70">
<div class="org-src-container">

<pre class="src src-fasm">size$return_stack = <span style="color: #ae81ff;">1024</span> * <span style="color: #ae81ff;">1024</span> * cell_size

   <span style="color: #66d9ef; font-weight: bold;">preserve</span> <span style="color: #ae81ff;">64</span> * cell_size
address$return_stack <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> size$return_stack
</pre>
</div>
</div>
</div>

<div id="outline-container-org2898d45" class="outline-3">
<h3 id="org2898d45">pointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-org2898d45">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

<span style="color: #FF8888;">;; if you want to extend cicada in assembly</span>
<span style="color: #FF8888;">;; the following registers must NOT be used</span>

<span style="color: #a6e22e;">define</span> pointer$return_stack <span style="color: #fd971f;">r14</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9edac5" class="outline-3">
<h3 id="orga9edac5">push &amp; pop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-orga9edac5">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

<span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">push_return_stack</span> register \{
   <span style="color: #a6e22e;">mov</span> [pointer$return_stack], register
   <span style="color: #a6e22e;">add</span> pointer$return_stack, cell_size
\}

<span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">pop_return_stack</span> register \{
   <span style="color: #a6e22e;">sub</span> pointer$return_stack, cell_size
   <span style="color: #a6e22e;">mov</span> register, [pointer$return_stack]
\}

}
</pre>
</div>
</div>
</div>
