cicada-nymph.org
** pointer                            :32bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =32bit, machine {

   pointer$return_stack:
      xx address$return_stack

   }
   #+end_src
** push & pop                         :32bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =32bit, machine {

   macro push_return_stack register \{
      if register in <eax>
      push ebx
      mov ebx, [pointer$return_stack]
      mov [ebx], register
      add ebx, cell_size
      mov [pointer$return_stack], ebx
      pop ebx
      else
      push eax
      mov eax, [pointer$return_stack]
      mov [eax], register
      add eax, cell_size
      mov [pointer$return_stack], eax
      pop eax
      finish if
   \}

   macro pop_return_stack register \{
      if register in <eax>
      push ebx
      mov ebx, [pointer$return_stack]
      sub ebx, cell_size
      mov register, [ebx]
      mov [pointer$return_stack], ebx
      pop ebx
      else
      push eax
      mov eax, [pointer$return_stack]
      sub eax, cell_size
      mov register, [eax]
      mov [pointer$return_stack], eax
      pop eax
      finish if
   \}

   }
   #+end_src
* next
** macro next
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   macro next \{
      pop_return_stack rbx
        mov rax, [rbx]
      add rbx, cell_size
      push_return_stack rbx
        jmp qword [rax]
   \}

   }


   match =32bit, machine {

   macro next \{
      pop_return_stack rbx
        mov rax, [rbx]
      add rbx, cell_size
      push_return_stack rbx
        jmp dword [rax]
   \}

   }
   #+end_src
