cicada-nymph.html

<div id="outline-container-orge5102f3" class="outline-3">
<h3 id="orge5102f3">pointer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-orge5102f3">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

<span style="color: #a6e22e;">pointer$return_stack</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$return_stack

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4477a8d" class="outline-3">
<h3 id="org4477a8d">push &amp; pop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org4477a8d">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

<span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">push_return_stack</span> register \{
   <span style="color: #f92672; font-weight: bold;">if</span> register <span style="color: #a6e22e;">in</span> &lt;eax&gt;
   <span style="color: #a6e22e;">push</span> <span style="color: #fd971f;">ebx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">ebx</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">ebx</span>], register
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">ebx</span>, cell_size
   <span style="color: #a6e22e;">mov</span> [pointer$return_stack], <span style="color: #fd971f;">ebx</span>
   <span style="color: #a6e22e;">pop</span> <span style="color: #fd971f;">ebx</span>
   <span style="color: #f92672; font-weight: bold;">else</span>
   <span style="color: #a6e22e;">push</span> <span style="color: #fd971f;">eax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">eax</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">eax</span>], register
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">eax</span>, cell_size
   <span style="color: #a6e22e;">mov</span> [pointer$return_stack], <span style="color: #fd971f;">eax</span>
   <span style="color: #a6e22e;">pop</span> <span style="color: #fd971f;">eax</span>
   <span style="color: #f92672; font-weight: bold;">finish</span> <span style="color: #f92672; font-weight: bold;">if</span>
\}

<span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">pop_return_stack</span> register \{
   <span style="color: #f92672; font-weight: bold;">if</span> register <span style="color: #a6e22e;">in</span> &lt;eax&gt;
   <span style="color: #a6e22e;">push</span> <span style="color: #fd971f;">ebx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">ebx</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">ebx</span>, cell_size
   <span style="color: #a6e22e;">mov</span> register, [<span style="color: #fd971f;">ebx</span>]
   <span style="color: #a6e22e;">mov</span> [pointer$return_stack], <span style="color: #fd971f;">ebx</span>
   <span style="color: #a6e22e;">pop</span> <span style="color: #fd971f;">ebx</span>
   <span style="color: #f92672; font-weight: bold;">else</span>
   <span style="color: #a6e22e;">push</span> <span style="color: #fd971f;">eax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">eax</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">eax</span>, cell_size
   <span style="color: #a6e22e;">mov</span> register, [<span style="color: #fd971f;">eax</span>]
   <span style="color: #a6e22e;">mov</span> [pointer$return_stack], <span style="color: #fd971f;">eax</span>
   <span style="color: #a6e22e;">pop</span> <span style="color: #fd971f;">eax</span>
   <span style="color: #f92672; font-weight: bold;">finish</span> <span style="color: #f92672; font-weight: bold;">if</span>
\}

}
</pre>
</div>
</div>
</div>
</div>
