cicada-nymph.org
** note jo
   * jo as data-structure
     |----+----------------|
     |    | length         |
     | jo | explainer      |
     |    | body           |
     |----+----------------|
   * the body for
     * primitive-function-jo
       assembly code
     * function-jo
       jojo
     * variable-jo
       value-list
** offset of jo
   #+begin_src fasm :tangle cicada-nymph.fasm
   offset__jo$other          = - (cell_size * 2)
   offset__jo$length         = - (cell_size * 1)
   offset__jo$body           = (cell_size * 1)
   #+end_src
** note link
   * link as data-structure
     |------+----------------|
     | link | link           |
     |------+----------------|
     |      | jo             |
     |      | string-address |
     |      | string-length  |
     |------+----------------|
   * if the link field of a link is 0
     the link is the last-link
** offset of link
   #+begin_src fasm :tangle cicada-nymph.fasm
   offset__link$jo             = (cell_size * 1)
   offset__link$string_address = (cell_size * 2)
   offset__link$string_length  = (cell_size * 3)
   #+end_src
** null link
   #+begin_src fasm :tangle cicada-nymph.fasm
   ;; initial link to point to 0 (as null)
   link = 0
   #+end_src
** *string-area*
*** memory allocation
    #+begin_src fasm :tangle cicada-nymph.fasm
    address$string_area:
       times 64 * 1024 db 0

    address$core_file:
       file "core/core.cn"
    end$core_file:

    end$string_area:

    current_free_address$string_area = address$string_area
    #+end_src
*** ASSEMBLY__length_string
    #+begin_src fasm :tangle cicada-nymph.fasm
    macro ASSEMBLY__length_string string {

    virtual at 0
    .start$string:
       db string
    .end$string:
       dw (.end$string - .start$string)
       load .length word from (.end$string)
    finish virtual

    }
    #+end_src
*** ASSEMBLY__make_string
    * note that
      the following is using local label
    #+begin_src fasm :tangle cicada-nymph.fasm
    macro ASSEMBLY__make_string string {

    repeat .length
       virtual at 0
          db string
          load .char byte from (% - 1)
       finish virtual
       store byte .char at (current_free_address$string_area)
       current_free_address$string_area = current_free_address$string_area + 1
    finish repeat
       store byte 0 at (current_free_address$string_area)
       current_free_address$string_area = current_free_address$string_area + 1
    }
    #+end_src
** note
   * note that
     after a "next" "jmp" to a explainer
     the "rax" stores the value of the jo to be explained
     so
     "rax" is used as an inexplicit argument
     of the following functions
   * explain$function is used as jojo-head
     and explains the meaning of the jojo as function
   * a jojo-head identifies one type of jo
** define_function
   #+begin_src fasm :tangle cicada-nymph.fasm
   macro define_function string, jo {

   link__#jo:
      xx link
      link = link__#jo

      xx jo

      ASSEMBLY__length_string string
      .address = current_free_address$string_area
      xx .address
      xx .length
      ASSEMBLY__make_string string


      ;; xx (end__#jo - jo)/cell_size
      xx 0

   jo:
      xx explain$function

      ;; here follows a jojo as function-body

   }
   #+end_src
