cicada-nymph.html

<div id="outline-container-org7daaf22" class="outline-2">
<h2 id="org7daaf22">function-jo</h2>
<div class="outline-text-2" id="text-org7daaf22">
</div><div id="outline-container-orgdbbb7d2" class="outline-3">
<h3 id="orgdbbb7d2"><span class="todo note">note</span> jo</h3>
<div class="outline-text-3" id="text-orgdbbb7d2">
<ul class="org-ul">
<li><p><p></p><p>jo as data-structure</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><tbody></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">length</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">jo</td></p><p><td class="org-left">explainer</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">body</td></p><p></tr></p><p></tbody></p><p></table></p></li>
<li><p>the body for</p><p><ul class="org-ul"></p><p><li><p>primitive-function-jo</p><p>assembly code</p></li></p><p><li><p>function-jo</p><p>jojo</p></li></p><p><li><p>variable-jo</p><p>value-list</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-orgd5f5ecb" class="outline-3">
<h3 id="orgd5f5ecb">offset of jo</h3>
<div class="outline-text-3" id="text-orgd5f5ecb">
<div class="org-src-container">

<pre class="src src-fasm">offset__jo$other          = - (cell_size * <span style="color: #ae81ff;">2</span>)
offset__jo$length         = - (cell_size * <span style="color: #ae81ff;">1</span>)
offset__jo$body           = (cell_size * <span style="color: #ae81ff;">1</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8851c88" class="outline-3">
<h3 id="org8851c88"><span class="todo note">note</span> link</h3>
<div class="outline-text-3" id="text-org8851c88">
<ul class="org-ul">
<li><p><p></p><p>link as data-structure</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">link</th></p><p><th scope="col" class="org-left">link</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">jo</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">string-address</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">string-length</td></p><p></tr></p><p></tbody></p><p></table></p></li>
<li><p>if the link field of a link is 0</p><p>the link is the last-link</p></li></ul>
</div>
</div>

<div id="outline-container-org994cbb9" class="outline-3">
<h3 id="org994cbb9">offset of link</h3>
<div class="outline-text-3" id="text-org994cbb9">
<div class="org-src-container">

<pre class="src src-fasm">offset__link$jo             = (cell_size * <span style="color: #ae81ff;">1</span>)
offset__link$string_address = (cell_size * <span style="color: #ae81ff;">2</span>)
offset__link$string_length  = (cell_size * <span style="color: #ae81ff;">3</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org245ef4" class="outline-3">
<h3 id="org245ef4">null link</h3>
<div class="outline-text-3" id="text-org245ef4">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #FF8888;">;; initial link to point to 0 (as null)</span>
link = <span style="color: #ae81ff;">0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org32f474e" class="outline-3">
<h3 id="org32f474e"><b>string-area</b></h3>
<div class="outline-text-3" id="text-org32f474e">
</div><div id="outline-container-orgacfb46" class="outline-4">
<h4 id="orgacfb46">memory allocation</h4>
<div class="outline-text-4" id="text-orgacfb46">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">address$string_area</span>:
   <span style="color: #f92672; font-weight: bold;">times</span> <span style="color: #ae81ff;">64</span> * <span style="color: #ae81ff;">1024</span> <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #ae81ff;">0</span>

<span style="color: #a6e22e;">address$core_file</span>:
   <span style="color: #f92672; font-weight: bold;">file</span> <span style="color: #e6db74;">"core/core.cn"</span>
<span style="color: #a6e22e;">end$core_file</span>:

<span style="color: #a6e22e;">end$string_area</span>:

current_free_address$string_area = address$string_area
</pre>
</div>
</div>
</div>

<div id="outline-container-org2837e17" class="outline-4">
<h4 id="org2837e17">ASSEMBLY__length_string</h4>
<div class="outline-text-4" id="text-org2837e17">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">ASSEMBLY__length_string</span> string {

<span style="color: #f92672; font-weight: bold;">virtual</span> <span style="color: #f92672; font-weight: bold;">at</span> <span style="color: #ae81ff;">0</span>
<span style="color: #a6e22e;">.start$string</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> string
<span style="color: #a6e22e;">.end$string</span>:
   <span style="color: #66d9ef; font-weight: bold;">dw</span> (.end$string - .start$string)
   <span style="color: #f92672; font-weight: bold;">load</span> .length <span style="color: #66d9ef; font-weight: bold;">word</span> <span style="color: #f92672; font-weight: bold;">from</span> (.end$string)
<span style="color: #f92672; font-weight: bold;">finish</span> <span style="color: #f92672; font-weight: bold;">virtual</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaaef7d9" class="outline-4">
<h4 id="orgaaef7d9">ASSEMBLY__make_string</h4>
<div class="outline-text-4" id="text-orgaaef7d9">
<ul class="org-ul">
<li><p>note that</p><p>the following is using local label</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">ASSEMBLY__make_string</span> string {

<span style="color: #f92672; font-weight: bold;">repeat</span> .length
   <span style="color: #f92672; font-weight: bold;">virtual</span> <span style="color: #f92672; font-weight: bold;">at</span> <span style="color: #ae81ff;">0</span>
      <span style="color: #66d9ef; font-weight: bold;">db</span> string
      <span style="color: #f92672; font-weight: bold;">load</span> .char <span style="color: #66d9ef; font-weight: bold;">byte</span> <span style="color: #f92672; font-weight: bold;">from</span> (% - <span style="color: #ae81ff;">1</span>)
   <span style="color: #f92672; font-weight: bold;">finish</span> <span style="color: #f92672; font-weight: bold;">virtual</span>
   <span style="color: #f92672; font-weight: bold;">store</span> <span style="color: #66d9ef; font-weight: bold;">byte</span> .char <span style="color: #f92672; font-weight: bold;">at</span> (current_free_address$string_area)
   current_free_address$string_area = current_free_address$string_area + <span style="color: #ae81ff;">1</span>
<span style="color: #f92672; font-weight: bold;">finish</span> <span style="color: #f92672; font-weight: bold;">repeat</span>
   <span style="color: #f92672; font-weight: bold;">store</span> <span style="color: #66d9ef; font-weight: bold;">byte</span> <span style="color: #ae81ff;">0</span> <span style="color: #f92672; font-weight: bold;">at</span> (current_free_address$string_area)
   current_free_address$string_area = current_free_address$string_area + <span style="color: #ae81ff;">1</span>
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org16111ff" class="outline-3">
<h3 id="org16111ff"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-org16111ff">
<ul class="org-ul">
<li><p>note that</p><p>after a "next" "jmp" to a explainer</p><p>the "rax" stores the value of the jo to be explained</p><p>so</p><p>"rax" is used as an inexplicit argument</p><p>of the following functions</p></li>
<li><p>explain$function is used as jojo-head</p><p>and explains the meaning of the jojo as function</p></li>
<li><p>a jojo-head identifies one type of jo</p></li></ul>
</div>
</div>

<div id="outline-container-orgf3dcfe5" class="outline-3">
<h3 id="orgf3dcfe5">define_function</h3>
<div class="outline-text-3" id="text-orgf3dcfe5">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">define_function</span> string, <span style="color: #a6e22e;">jo</span> {

link__#<span style="color: #a6e22e;">jo</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> link
   link = link__#<span style="color: #a6e22e;">jo</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #a6e22e;">jo</span>

   ASSEMBLY__length_string string
   .address = current_free_address$string_area
   <span style="color: #66d9ef; font-weight: bold;">xx</span> .address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> .length
   ASSEMBLY__make_string string


   <span style="color: #FF8888;">;; xx (end__#jo - jo)/cell_size</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">0</span>

<span style="color: #a6e22e;">jo</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> explain$function

   <span style="color: #FF8888;">;; here follows a jojo as function-body</span>

}
</pre>
</div>
</div>
</div>
