cicada-nymph.org
** explain$function
   * push the jojo of a jo to return-stack
   * a jojo can not be of size 0
   * use rax as an argument
     which stores a jo
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   explain$function:
      mov rbx, pointer$return_stack
      sub rbx, address$return_stack
      test rbx, unit__return_point
      jz .return_stack_even

      mov rbx, [V__local_memory_odd__current_free_address + cell_size]
      push_return_stack rbx
      mov rbx, [V__local_memory_even__current_free_address + cell_size]
      push_return_stack rbx
      mov rbx, [local_variable$current_free_address]
      push_return_stack rbx
      add rax, cell_size
      push_return_stack rax
      next

   .return_stack_even:
      mov rbx, [V__local_memory_even__current_free_address + cell_size]
      push_return_stack rbx
      mov rbx, [V__local_memory_odd__current_free_address + cell_size]
      push_return_stack rbx
      mov rbx, [local_variable$current_free_address]
      push_return_stack rbx
      add rax, cell_size
      push_return_stack rax
      next

   }

   match =32bit, machine {

   explain$function:
      mov rbx, [pointer$return_stack]
      sub rbx, address$return_stack
      test rbx, unit__return_point
      jz .return_stack_even

      mov rbx, [V__local_memory_odd__current_free_address + cell_size]
      push_return_stack rbx
      mov rbx, [V__local_memory_even__current_free_address + cell_size]
      push_return_stack rbx
      mov rbx, [local_variable$current_free_address]
      push_return_stack rbx
      add rax, cell_size
      push_return_stack rax
      next

   .return_stack_even:
      mov rbx, [V__local_memory_even__current_free_address + cell_size]
      push_return_stack rbx
      mov rbx, [V__local_memory_odd__current_free_address + cell_size]
      push_return_stack rbx
      mov rbx, [local_variable$current_free_address]
      push_return_stack rbx
      add rax, cell_size
      push_return_stack rax
      next

   }
   #+end_src
* primitive-function-jo
** note
   * primitive functions are special
     they explain themself
     and their type is not identified by jojo-head
** define_primitive_function
   #+begin_src fasm :tangle cicada-nymph.fasm
   macro define_primitive_function string, jo {

   link__#jo:
      xx link
      link = link__#jo

      xx jo

      ASSEMBLY__length_string string
      .address = current_free_address$string_area
      xx .address
      xx .length
      ASSEMBLY__make_string string


      ;; xx (end__#jo - jo)
      xx 0

   jo:
      xx assembly_code__#jo

   assembly_code__#jo:

      ;; here follows assembly code
      ;; as primitive function body

   }
   #+end_src
* variable-jo
** note
   * no constant
     only variable
   * when a variable jo in the jojo
     it push the value of the variable to argument_stack
   * when wish to change a variable's value
     use key_word "address" to get the address of the variable
** define_variable
   #+begin_src fasm :tangle cicada-nymph.fasm
   macro define_variable string, jo {

   link__#jo:
      xx link
      link = link__#jo

      xx jo

      ASSEMBLY__length_string string
      .address = current_free_address$string_area
      xx .address
      xx .length
      ASSEMBLY__make_string string


      ;; length
      xx 1

   jo:
      xx explain$variable

      ;; here follows a value of cell_size
      ;; only one value is allowed

   }
   #+end_src
** explain$variable                   :64bit:
   * in memory
      | value-1 |
      | ...     |
      | value-n |
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   explain$variable:
      mov rcx, [rax + offset__jo$length]
      add rax, cell_size
   .loop:
      mov rdx, qword [rax]
      push_argument_stack rdx
      add rax, cell_size
      loop .loop
      next

   }
   #+end_src
