cicada-nymph.html

<div id="outline-container-org2f493c5" class="outline-3">
<h3 id="org2f493c5">explain$function</h3>
<div class="outline-text-3" id="text-org2f493c5">
<ul class="org-ul">
<li><p>push the jojo of a jo to return-stack</p></li>
<li><p>a jojo can not be of size 0</p></li>
<li><p>use rax as an argument</p><p>which stores a jo</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

<span style="color: #a6e22e;">explain$function</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, pointer$return_stack
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rbx</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rbx</span>, unit__return_point
   <span style="color: #a6e22e;">jz</span> .return_stack_even

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__local_memory_odd__current_free_address + cell_size]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__local_memory_even__current_free_address + cell_size]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [local_variable$current_free_address]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
   push_return_stack <span style="color: #fd971f;">rax</span>
   next

<span style="color: #a6e22e;">.return_stack_even</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__local_memory_even__current_free_address + cell_size]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__local_memory_odd__current_free_address + cell_size]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [local_variable$current_free_address]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
   push_return_stack <span style="color: #fd971f;">rax</span>
   next

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

<span style="color: #a6e22e;">explain$function</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rbx</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rbx</span>, unit__return_point
   <span style="color: #a6e22e;">jz</span> .return_stack_even

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__local_memory_odd__current_free_address + cell_size]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__local_memory_even__current_free_address + cell_size]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [local_variable$current_free_address]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
   push_return_stack <span style="color: #fd971f;">rax</span>
   next

<span style="color: #a6e22e;">.return_stack_even</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__local_memory_even__current_free_address + cell_size]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__local_memory_odd__current_free_address + cell_size]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [local_variable$current_free_address]
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
   push_return_stack <span style="color: #fd971f;">rax</span>
   next

}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org65852ef" class="outline-2">
<h2 id="org65852ef">primitive-function-jo</h2>
<div class="outline-text-2" id="text-org65852ef">
</div><div id="outline-container-org24601b6" class="outline-3">
<h3 id="org24601b6"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-org24601b6">
<ul class="org-ul">
<li><p>primitive functions are special</p><p>they explain themself</p><p>and their type is not identified by jojo-head</p></li></ul>
</div>
</div>

<div id="outline-container-orga8b41e8" class="outline-3">
<h3 id="orga8b41e8">define_primitive_function</h3>
<div class="outline-text-3" id="text-orga8b41e8">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">define_primitive_function</span> string, <span style="color: #a6e22e;">jo</span> {

link__#<span style="color: #a6e22e;">jo</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> link
   link = link__#<span style="color: #a6e22e;">jo</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #a6e22e;">jo</span>

   ASSEMBLY__length_string string
   .address = current_free_address$string_area
   <span style="color: #66d9ef; font-weight: bold;">xx</span> .address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> .length
   ASSEMBLY__make_string string


   <span style="color: #FF8888;">;; xx (end__#jo - jo)</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">0</span>

<span style="color: #a6e22e;">jo</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> assembly_code__#<span style="color: #a6e22e;">jo</span>

assembly_code__#<span style="color: #a6e22e;">jo</span>:

   <span style="color: #FF8888;">;; here follows assembly code</span>
   <span style="color: #FF8888;">;; as primitive function body</span>

}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5684749" class="outline-2">
<h2 id="org5684749">variable-jo</h2>
<div class="outline-text-2" id="text-org5684749">
</div><div id="outline-container-org7f78325" class="outline-3">
<h3 id="org7f78325"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-org7f78325">
<ul class="org-ul">
<li><p>no constant</p><p>only variable</p></li>
<li><p>when a variable jo in the jojo</p><p>it push the value of the variable to argument_stack</p></li>
<li><p>when wish to change a variable's value</p><p>use key_word "address" to get the address of the variable</p></li></ul>
</div>
</div>

<div id="outline-container-orgd57b258" class="outline-3">
<h3 id="orgd57b258">define_variable</h3>
<div class="outline-text-3" id="text-orgd57b258">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">macro</span> <span style="color: #a6e22e;">define_variable</span> string, <span style="color: #a6e22e;">jo</span> {

link__#<span style="color: #a6e22e;">jo</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> link
   link = link__#<span style="color: #a6e22e;">jo</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #a6e22e;">jo</span>

   ASSEMBLY__length_string string
   .address = current_free_address$string_area
   <span style="color: #66d9ef; font-weight: bold;">xx</span> .address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> .length
   ASSEMBLY__make_string string


   <span style="color: #FF8888;">;; length</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">1</span>

<span style="color: #a6e22e;">jo</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> explain$variable

   <span style="color: #FF8888;">;; here follows a value of cell_size</span>
   <span style="color: #FF8888;">;; only one value is allowed</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org966f410" class="outline-3">
<h3 id="org966f410">explain$variable&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-org966f410">
<ul class="org-ul">
<li><p><p></p><p>in memory</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></colgroup></p><p><tbody></p><p><tr></p><p><td class="org-left">value-1</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#x2026;</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">value-n</td></p><p></tr></p><p></tbody></p><p></table></p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

<span style="color: #a6e22e;">explain$variable</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [<span style="color: #fd971f;">rax</span> + offset__jo$length]
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdx</span>, <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rax</span>]
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

}
</pre>
</div>
</div>
</div>
