cicada-nymph.org
** explain$variable                   :32bit:
   * in memory
      | value-1 |
      | ...     |
      | value-n |
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =32bit, machine {

   explain$variable:
      mov rcx, [rax + offset__jo$length]
      add rax, cell_size
   .loop:
      mov rdx, dword [rax]
      push_argument_stack rdx
      add rax, cell_size
      loop .loop
      next

   }
   #+end_src
* jo
** apply
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "apply", apply
      ;; << jo -- unknown >>
      pop_argument_stack rax
      jmp qword [rax]

   }


   match =32bit, machine {

   define_primitive_function "apply", apply
      ;; << jo -- unknown >>
      pop_argument_stack eax
      jmp dword [eax]

   }
   #+end_src
** *cell-size*
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "*cell-size*", V__cell_size
      xx cell_size
   #+end_src
** jo->explainer
   * the type of primitive function jo
     is encoded by 0
   * other types of jo
     are encoded by their explainers
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jo->explainer", jo_to_explainer
      ;; << jo -- type >>
      xx dup

      xx dup, get
      xx swap, subtraction, literal, cell_size, equal?, false?branch, 4
      xx   drop, zero
      xx   end

      xx get
      xx end
   #+end_src
** jo->length
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jo->length", jo_to_length
      ;; << jo -- length >>
      xx literal, offset__jo$length, addition
      xx get
      xx end
   #+end_src
** jo,set-length
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jo,set-length", jo__set_length
      ;; << length, jo -- >>
      xx literal, offset__jo$length, addition
      xx set
      xx end
   #+end_src
** jo->body
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jo->body", jo_to_body
      ;; << jo -- body >>
      xx literal, offset__jo$body
      xx addition
      xx end
   #+end_src
** primitive-function-jo?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "primitive-function-jo?", primitive_function_jo?
      ;; << jo -- bool >>
      xx jo_to_explainer
      xx zero?
      xx end
   #+end_src
** function-jo?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "function-jo?", function_jo?
      ;; << jo -- bool >>
      xx jo_to_explainer
      xx literal, explain$function
      xx equal?
      xx end
   #+end_src
** variable-jo?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "variable-jo?", variable_jo?
      ;; << jo -- bool >>
      xx jo_to_explainer
      xx literal, explain$variable
      xx equal?
      xx end
   #+end_src
** variable-jo->address
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "variable-jo->address", variable_jo_to_address
      ;; << jo -- body >>
      xx literal, offset__jo$body
      xx addition
      xx end
   #+end_src
* string-area
** note interface
   * the interface of string-area is not good
     one can NOT use n-get and n-set
     to get and set value from the address
** *string-area*
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "*string-area*", V__string_area
      xx address$string_area

   define_variable "*string-area,size*", V__string_area__size
      xx (end$string_area - address$string_area)

   ;; *string-area,current-free-address*
   ;; is at epilog
   #+end_src
