cicada-nymph.html

<div id="outline-container-org8117cc9" class="outline-3">
<h3 id="org8117cc9">explain$variable&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org8117cc9">
<ul class="org-ul">
<li><p><p></p><p>in memory</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></colgroup></p><p><tbody></p><p><tr></p><p><td class="org-left">value-1</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#x2026;</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">value-n</td></p><p></tr></p><p></tbody></p><p></table></p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

<span style="color: #a6e22e;">explain$variable</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [<span style="color: #fd971f;">rax</span> + offset__jo$length]
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdx</span>, <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rax</span>]
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6616390" class="outline-2">
<h2 id="org6616390">jo</h2>
<div class="outline-text-2" id="text-org6616390">
</div><div id="outline-container-org4dd034e" class="outline-3">
<h3 id="org4dd034e">apply</h3>
<div class="outline-text-3" id="text-org4dd034e">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"apply"</span>, apply
   <span style="color: #FF8888;">;; &lt;&lt; jo -- unknown &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rax</span>]

}


<span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"apply"</span>, apply
   <span style="color: #FF8888;">;; &lt;&lt; jo -- unknown &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">eax</span>
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">eax</span>]

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9bfd5e4" class="outline-3">
<h3 id="org9bfd5e4"><b>cell-size</b></h3>
<div class="outline-text-3" id="text-org9bfd5e4">
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"*cell-size*"</span>, V__cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span> cell_size
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6afee8" class="outline-3">
<h3 id="orgd6afee8">jo-&gt;explainer</h3>
<div class="outline-text-3" id="text-orgd6afee8">
<ul class="org-ul">
<li><p>the type of primitive function jo</p><p>is encoded by 0</p></li>
<li><p>other types of jo</p><p>are encoded by their explainers</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jo-&gt;explainer"</span>, jo_to_explainer
   <span style="color: #FF8888;">;; &lt;&lt; jo -- type &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap, subtraction, <span style="color: #f92672; font-weight: bold;">literal</span>, cell_size, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, zero
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org61e9782" class="outline-3">
<h3 id="org61e9782">jo-&gt;length</h3>
<div class="outline-text-3" id="text-org61e9782">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jo-&gt;length"</span>, jo_to_length
   <span style="color: #FF8888;">;; &lt;&lt; jo -- length &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, offset__jo$length, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8274059" class="outline-3">
<h3 id="org8274059">jo,set-length</h3>
<div class="outline-text-3" id="text-org8274059">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jo,set-length"</span>, jo__set_length
   <span style="color: #FF8888;">;; &lt;&lt; length, jo -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, offset__jo$length, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org93e077f" class="outline-3">
<h3 id="org93e077f">jo-&gt;body</h3>
<div class="outline-text-3" id="text-org93e077f">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jo-&gt;body"</span>, jo_to_body
   <span style="color: #FF8888;">;; &lt;&lt; jo -- body &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, offset__jo$body
   <span style="color: #66d9ef; font-weight: bold;">xx</span> addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge10e831" class="outline-3">
<h3 id="orge10e831">primitive-function-jo?</h3>
<div class="outline-text-3" id="text-orge10e831">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"primitive-function-jo?"</span>, primitive_function_jo?
   <span style="color: #FF8888;">;; &lt;&lt; jo -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> jo_to_explainer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> zero?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf3016" class="outline-3">
<h3 id="orgaf3016">function-jo?</h3>
<div class="outline-text-3" id="text-orgaf3016">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"function-jo?"</span>, function_jo?
   <span style="color: #FF8888;">;; &lt;&lt; jo -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> jo_to_explainer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, explain$function
   <span style="color: #66d9ef; font-weight: bold;">xx</span> equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6376de0" class="outline-3">
<h3 id="org6376de0">variable-jo?</h3>
<div class="outline-text-3" id="text-org6376de0">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"variable-jo?"</span>, variable_jo?
   <span style="color: #FF8888;">;; &lt;&lt; jo -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> jo_to_explainer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, explain$variable
   <span style="color: #66d9ef; font-weight: bold;">xx</span> equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge238ac4" class="outline-3">
<h3 id="orge238ac4">variable-jo-&gt;address</h3>
<div class="outline-text-3" id="text-orge238ac4">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"variable-jo-&gt;address"</span>, variable_jo_to_address
   <span style="color: #FF8888;">;; &lt;&lt; jo -- body &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, offset__jo$body
   <span style="color: #66d9ef; font-weight: bold;">xx</span> addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org931bab6" class="outline-2">
<h2 id="org931bab6">string-area</h2>
<div class="outline-text-2" id="text-org931bab6">
</div><div id="outline-container-org7c60b12" class="outline-3">
<h3 id="org7c60b12"><span class="todo note">note</span> interface</h3>
<div class="outline-text-3" id="text-org7c60b12">
<ul class="org-ul">
<li><p>the interface of string-area is not good</p><p>one can NOT use n-get and n-set</p><p>to get and set value from the address</p></li></ul>
</div>
</div>

<div id="outline-container-org89f8802" class="outline-3">
<h3 id="org89f8802"><b>string-area</b></h3>
<div class="outline-text-3" id="text-org89f8802">
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"*string-area*"</span>, V__string_area
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$string_area

define_variable <span style="color: #e6db74;">"*string-area,size*"</span>, V__string_area__size
   <span style="color: #66d9ef; font-weight: bold;">xx</span> (end$string_area - address$string_area)

<span style="color: #FF8888;">;; *string-area,current-free-address*</span>
<span style="color: #FF8888;">;; is at epilog</span>
</pre>
</div>
</div>
</div>
