cicada-nymph.org
** string-area,stay
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string-area,stay", string_area__stay
      ;; << string[address, length] -- >>
      xx tuck
      xx V__string_area__current_free_address
      xx string_to_buffer!
      xx address, V__string_area__current_free_address
      xx add_set
      xx end
   #+end_src
** make-string
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "make-string", make_string
      ;; << string[address, length] -- string-copy[address, length] >>
      xx V__string_area__current_free_address
      xx xxswapx
      xx tuck
      xx string_area__stay
      xx end
   #+end_src
* return-stack
** note return-point
   * structure
     | return-point | conjugate-local-memory |
     |              | local-memory           |
     |              | local-variable         |
     |              | jojo                   |
   * the interface is implemented by needs
** offset of return-point
   #+begin_src fasm :tangle cicada-nymph.fasm
   offset__return_point$conjugate_local_memory   = (cell_size * 0)
   offset__return_point$local_memory             = (cell_size * 1)
   offset__return_point$local_variable           = (cell_size * 2)
   offset__return_point$jojo                     = (cell_size * 3)

   unit__return_point = (cell_size * 4)
   #+end_src
** return-stack:*unit*
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "return-stack:*unit*", V__return_stack__unit
      xx unit__return_point
   #+end_src
** 記 插 珠珠 人返回棧 到某珠珠的前面 [等效替換法 以理解]
   * 有了下面的 (return-stack:insert-jo) 這個素函數之後
     即便是在非素函數中也能夠對返回棧進行有限的操作了
   * before insert-jo
     |----------------+--------------------------|
     | return-point-1 | conjugate-local-memory-1 |
     |                | local-memory-1           |
     |                | local-variable-1         |
     |                | jojo-1                   |
     |----------------+--------------------------|
     | return-point-2 | conjugate-local-memory-2 |
     |                | local-memory-2           |
     |                | local-variable-2         |
     |                | jojo-2                   |
     |----------------+--------------------------|
   * after
     jo return-point-2 (return-stack:insert-jo)
     |-----------------+--------------------------|
     | return-point-1  | conjugate-local-memory-1 |
     |                 | local-memory-1           |
     |                 | local-variable-1         |
     |                 | jojo-1                   |
     |-----------------+--------------------------|
     | return-point-in | conjugate-local-memory-2 |
     |                 | local-memory-2           |
     |                 | local-variable-2         |
     |                 | jojo of jo               |
     |-----------------+--------------------------|
     | return-point-no | local-memory-2           |
     |                 | conjugate-local-memory-2 |
     |                 | local-variable-2         |
     |                 | jojo of nothing          |
     |-----------------+--------------------------|
     | return-point-2  | conjugate-local-memory-2 |
     |                 | local-memory-2           |
     |                 | local-variable-2         |
     |                 | jojo-2                   |
     |-----------------+--------------------------|
   * 之所以有這樣的效果
     是因爲
     這個 素函數 是爲了 實現 expect 而作
     它可能不具有一般性
     這要看能不能在被插入的珠珠中使用局部變元
     答案看來是肯定的
     但是 這想來並不合理
     爲什麼我能夠隨意在返回棧中插入珠珠
     並且還能在這個珠珠中使用局部變元呢
     下面的考慮方式能夠讓人放心
     即 返回棧中的各個返回點
     是在展開函數體的過程中
     用以記錄調用子函數之後應該返回的地址的
     其中返回點的序關係 記錄了 函數之間的調用關係
     (1) 調用 (2)
     因而 (1) 在 (2) 之前
     然而插入而得的效果
     (1) (in) (2)
     並不是 (1) 調用 (in) 調用 (2)
     (in) 與周圍的兩個函數之間並沒有調用關係
     但是我可以假想出等效的調用關係
     [等效替換法 或 等量代換法]
     即 插入而得的效果
     (1) (in) (2)
     可以被想爲是
     (1) 調用 (in)
     (in) 調用 (2)
     並且 (in) 在調用 (2) 之前
     沒有使用局部數據區域來爲任何局部變元分配空間
   * 上面的討論就證明了這種實現方式性質良好
** nothing
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "nothing", nothing
      xx end
   #+end_src
