cicada-nymph.html

<div id="outline-container-orgeecc98" class="outline-3">
<h3 id="orgeecc98">string-area,stay</h3>
<div class="outline-text-3" id="text-orgeecc98">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string-area,stay"</span>, string_area__stay
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> tuck
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__string_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_to_buffer!
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">address</span>, V__string_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a2819d" class="outline-3">
<h3 id="org9a2819d">make-string</h3>
<div class="outline-text-3" id="text-org9a2819d">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"make-string"</span>, make_string
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- string-copy[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__string_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxswapx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> tuck
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga454a1d" class="outline-2">
<h2 id="orga454a1d">return-stack</h2>
<div class="outline-text-2" id="text-orga454a1d">
</div><div id="outline-container-org8b8184c" class="outline-3">
<h3 id="org8b8184c"><span class="todo note">note</span> return-point</h3>
<div class="outline-text-3" id="text-org8b8184c">
<ul class="org-ul">
<li><p><p></p><p>structure</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><tbody></p><p><tr></p><p><td class="org-left">return-point</td></p><p><td class="org-left">conjugate-local-memory</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">local-memory</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">local-variable</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">jojo</td></p><p></tr></p><p></tbody></p><p></table></p></li>
<li><p>the interface is implemented by needs</p></li></ul>
</div>
</div>

<div id="outline-container-org95e3652" class="outline-3">
<h3 id="org95e3652">offset of return-point</h3>
<div class="outline-text-3" id="text-org95e3652">
<div class="org-src-container">

<pre class="src src-fasm">offset__return_point$conjugate_local_memory   = (cell_size * <span style="color: #ae81ff;">0</span>)
offset__return_point$local_memory             = (cell_size * <span style="color: #ae81ff;">1</span>)
offset__return_point$local_variable           = (cell_size * <span style="color: #ae81ff;">2</span>)
offset__return_point$jojo                     = (cell_size * <span style="color: #ae81ff;">3</span>)

unit__return_point = (cell_size * <span style="color: #ae81ff;">4</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org314ce79" class="outline-3">
<h3 id="org314ce79">return-stack:*unit*</h3>
<div class="outline-text-3" id="text-org314ce79">
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"return-stack:*unit*"</span>, V__return_stack__unit
   <span style="color: #66d9ef; font-weight: bold;">xx</span> unit__return_point
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4cd77" class="outline-3">
<h3 id="orgb4cd77"><span class="todo _">記</span> 插 珠珠 人返回棧 到某珠珠的前面 [等效替換法 以理解]</h3>
<div class="outline-text-3" id="text-orgb4cd77">
<ul class="org-ul">
<li><p>有了下面的 (return-stack:insert-jo) 這個素函數之後</p><p>即便是在非素函數中也能夠對返回棧進行有限的操作了</p></li>
<li><p><p></p><p>before insert-jo</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">return-point-1</th></p><p><th scope="col" class="org-left">conjugate-local-memory-1</th></p><p></tr></p><p></p><p><tr></p><p><th scope="col" class="org-left">&#xa0;</th></p><p><th scope="col" class="org-left">local-memory-1</th></p><p></tr></p><p></p><p><tr></p><p><th scope="col" class="org-left">&#xa0;</th></p><p><th scope="col" class="org-left">local-variable-1</th></p><p></tr></p><p></p><p><tr></p><p><th scope="col" class="org-left">&#xa0;</th></p><p><th scope="col" class="org-left">jojo-1</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">return-point-2</td></p><p><td class="org-left">conjugate-local-memory-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">local-memory-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">local-variable-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">jojo-2</td></p><p></tr></p><p></tbody></p><p></table></p></li>
<li><p><p></p><p>after</p><p>jo return-point-2 (return-stack:insert-jo)</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">return-point-1</th></p><p><th scope="col" class="org-left">conjugate-local-memory-1</th></p><p></tr></p><p></p><p><tr></p><p><th scope="col" class="org-left">&#xa0;</th></p><p><th scope="col" class="org-left">local-memory-1</th></p><p></tr></p><p></p><p><tr></p><p><th scope="col" class="org-left">&#xa0;</th></p><p><th scope="col" class="org-left">local-variable-1</th></p><p></tr></p><p></p><p><tr></p><p><th scope="col" class="org-left">&#xa0;</th></p><p><th scope="col" class="org-left">jojo-1</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">return-point-in</td></p><p><td class="org-left">conjugate-local-memory-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">local-memory-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">local-variable-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">jojo of jo</td></p><p></tr></p><p></tbody></p><p><tbody></p><p><tr></p><p><td class="org-left">return-point-no</td></p><p><td class="org-left">local-memory-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">conjugate-local-memory-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">local-variable-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">jojo of nothing</td></p><p></tr></p><p></tbody></p><p><tbody></p><p><tr></p><p><td class="org-left">return-point-2</td></p><p><td class="org-left">conjugate-local-memory-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">local-memory-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">local-variable-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">jojo-2</td></p><p></tr></p><p></tbody></p><p></table></p></li>
<li><p>之所以有這樣的效果</p><p>是因爲</p><p>這個 素函數 是爲了 實現 expect 而作</p><p>它可能不具有一般性</p><p>這要看能不能在被插入的珠珠中使用局部變元</p><p>答案看來是肯定的</p><p>但是 這想來並不合理</p><p>爲什麼我能夠隨意在返回棧中插入珠珠</p><p>並且還能在這個珠珠中使用局部變元呢</p><p>下面的考慮方式能夠讓人放心</p><p>即 返回棧中的各個返回點</p><p>是在展開函數體的過程中</p><p>用以記錄調用子函數之後應該返回的地址的</p><p>其中返回點的序關係 記錄了 函數之間的調用關係</p><p>(1) 調用 (2)</p><p>因而 (1) 在 (2) 之前</p><p>然而插入而得的效果</p><p>(1) (in) (2)</p><p>並不是 (1) 調用 (in) 調用 (2)</p><p>(in) 與周圍的兩個函數之間並沒有調用關係</p><p>但是我可以假想出等效的調用關係</p><p>[等效替換法 或 等量代換法]</p><p>即 插入而得的效果</p><p>(1) (in) (2)</p><p>可以被想爲是</p><p>(1) 調用 (in)</p><p>(in) 調用 (2)</p><p>並且 (in) 在調用 (2) 之前</p><p>沒有使用局部數據區域來爲任何局部變元分配空間</p></li>
<li><p>上面的討論就證明了這種實現方式性質良好</p></li></ul>
</div>
</div>

<div id="outline-container-org21a7811" class="outline-3">
<h3 id="org21a7811">nothing</h3>
<div class="outline-text-3" id="text-org21a7811">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"nothing"</span>, nothing
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
