cicada-nymph.org
** return-stack:insert-jo
   * 先在個循環中複製 return-stack 之後的部分
     以空出一個位置
     然後把 jo 插入到空位
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "return-stack:insert-jo", return_stack__insert_jo
      ;; << jo, return-stack-pointer -- >>
      pop_argument_stack rbx

      mov rsi, pointer$return_stack
      add pointer$return_stack, (cell_size * 4 * 2)
      mov rdi, pointer$return_stack

   .loop:
      cmp rbx, rsi
      je .end
      sub rsi, cell_size
      sub rdi, cell_size
      mov rax, qword [rsi]
      mov qword [rdi], rax
      jmp .loop
   .end:

      pop_argument_stack rax
      add rax, cell_size
      mov qword [rsi + (cell_size * 3)], rax

      mov rax, qword [rsi + (cell_size * 1)]
      mov qword [rsi + (cell_size * 4)], rax
      mov rax, qword [rsi + (cell_size * 0)]
      mov qword [rsi + (cell_size * 5)], rax
      mov rax, qword [rsi + (cell_size * 2)]
      mov qword [rsi + (cell_size * 6)], rax
      mov rax, nothing + cell_size
      mov qword [rsi + (cell_size * 7)], rax

      next

   }

   match =32bit, machine {

   define_primitive_function "return-stack:insert-jo", return_stack__insert_jo
      ;; << jo, return-stack-pointer -- >>
      pop_argument_stack rbx

      mov rcx, [pointer$return_stack]
      mov rsi, rcx
      add rcx, (cell_size * 4 * 2)
      mov rdi, rcx
      mov [pointer$return_stack], rcx

   .loop:
      cmp rbx, rsi
      je .end
      sub rsi, cell_size
      sub rdi, cell_size
      mov rax, dword [rsi]
      mov dword [rdi], rax
      jmp .loop
   .end:

      pop_argument_stack rax
      add rax, cell_size
      mov dword [rsi + (cell_size * 3)], rax

      mov rax, dword [rsi + (cell_size * 1)]
      mov dword [rsi + (cell_size * 4)], rax
      mov rax, dword [rsi + (cell_size * 0)]
      mov dword [rsi + (cell_size * 5)], rax
      mov rax, dword [rsi + (cell_size * 2)]
      mov dword [rsi + (cell_size * 6)], rax
      mov rax, nothing + cell_size
      mov dword [rsi + (cell_size * 7)], rax

      next

   }
   #+end_src
** get-return-stack-pointer
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "get-return-stack-pointer", get_return_stack_pointer
      push_argument_stack pointer$return_stack
      next

   }

   match =32bit, machine {

   define_primitive_function "get-return-stack-pointer", get_return_stack_pointer
      mov rax, [pointer$return_stack]
      push_argument_stack rax
      next

   }
   #+end_src
** apply-with-return-point
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "apply-with-return-point", apply_with_return_point
      ;; << return-point, function -- >>
      pop_argument_stack rax
      pop_argument_stack rbx
      mov pointer$return_stack, rbx
      jmp qword [rax]

   }

   match =32bit, machine {

   define_primitive_function "apply-with-return-point", apply_with_return_point
      ;; << return-point, function -- >>
      pop_argument_stack rax
      pop_argument_stack rbx
      mov [pointer$return_stack], rbx
      jmp dword [rax]

   }
   #+end_src
* end & tail-call
