cicada-nymph.html

<div id="outline-container-orgc64671b" class="outline-3">
<h3 id="orgc64671b">return-stack:insert-jo</h3>
<div class="outline-text-3" id="text-orgc64671b">
<ul class="org-ul">
<li><p>先在個循環中複製 return-stack 之後的部分</p><p>以空出一個位置</p><p>然後把 jo 插入到空位</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"return-stack:insert-jo"</span>, return_stack__insert_jo
   <span style="color: #FF8888;">;; &lt;&lt; jo, return-stack-pointer -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, pointer$return_stack
   <span style="color: #a6e22e;">add</span> pointer$return_stack, (cell_size * <span style="color: #ae81ff;">4</span> * <span style="color: #ae81ff;">2</span>)
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdi</span>, pointer$return_stack

<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rsi</span>
   <span style="color: #a6e22e;">je</span> .end
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rsi</span>, cell_size
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rdi</span>, cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rsi</span>]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rdi</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">jmp</span> .loop
<span style="color: #a6e22e;">.end</span>:

   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">3</span>)], <span style="color: #fd971f;">rax</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">1</span>)]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">4</span>)], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">0</span>)]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">5</span>)], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">2</span>)]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">6</span>)], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, nothing + cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">7</span>)], <span style="color: #fd971f;">rax</span>

   next

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"return-stack:insert-jo"</span>, return_stack__insert_jo
   <span style="color: #FF8888;">;; &lt;&lt; jo, return-stack-pointer -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, <span style="color: #fd971f;">rcx</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rcx</span>, (cell_size * <span style="color: #ae81ff;">4</span> * <span style="color: #ae81ff;">2</span>)
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdi</span>, <span style="color: #fd971f;">rcx</span>
   <span style="color: #a6e22e;">mov</span> [pointer$return_stack], <span style="color: #fd971f;">rcx</span>

<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rsi</span>
   <span style="color: #a6e22e;">je</span> .end
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rsi</span>, cell_size
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rdi</span>, cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rsi</span>]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rdi</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">jmp</span> .loop
<span style="color: #a6e22e;">.end</span>:

   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">3</span>)], <span style="color: #fd971f;">rax</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">1</span>)]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">4</span>)], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">0</span>)]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">5</span>)], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">2</span>)]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">6</span>)], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, nothing + cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rsi</span> + (cell_size * <span style="color: #ae81ff;">7</span>)], <span style="color: #fd971f;">rax</span>

   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org51ae31a" class="outline-3">
<h3 id="org51ae31a">get-return-stack-pointer</h3>
<div class="outline-text-3" id="text-org51ae31a">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"get-return-stack-pointer"</span>, get_return_stack_pointer
   push_argument_stack pointer$return_stack
   next

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"get-return-stack-pointer"</span>, get_return_stack_pointer
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$return_stack]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7a880" class="outline-3">
<h3 id="orgb7a880">apply-with-return-point</h3>
<div class="outline-text-3" id="text-orgb7a880">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"apply-with-return-point"</span>, apply_with_return_point
   <span style="color: #FF8888;">;; &lt;&lt; return-point, function -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> pointer$return_stack, <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rax</span>]

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"apply-with-return-point"</span>, apply_with_return_point
   <span style="color: #FF8888;">;; &lt;&lt; return-point, function -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> [pointer$return_stack], <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rax</span>]

}
</pre>
</div>
</div>
</div>
</div>
