cicada-nymph.org
** end
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "end", end
      mov rax, pointer$return_stack
      sub rax, address$return_stack
      test rax, unit__return_point
      jnz .return_stack_even

      pop_return_stack rbx
      pop_return_stack rax
      mov [local_variable$current_free_address], rax
      pop_return_stack rax
      pop_return_stack rax
      mov [V__local_memory_odd__current_free_address + cell_size], rax
      next

   .return_stack_even:
      pop_return_stack rbx
      pop_return_stack rax
      mov [local_variable$current_free_address], rax
      pop_return_stack rax
      pop_return_stack rax
      mov [V__local_memory_even__current_free_address + cell_size], rax
      next

   }

   match =32bit, machine {

   define_primitive_function "end", end
      mov rax, [pointer$return_stack]
      sub rax, address$return_stack
      test rax, unit__return_point
      jnz .return_stack_even

      pop_return_stack rbx
      pop_return_stack rax
      mov [local_variable$current_free_address], rax
      pop_return_stack rax
      pop_return_stack rax
      mov [V__local_memory_odd__current_free_address + cell_size], rax
      next

   .return_stack_even:
      pop_return_stack rbx
      pop_return_stack rax
      mov [local_variable$current_free_address], rax
      pop_return_stack rax
      pop_return_stack rax
      mov [V__local_memory_even__current_free_address + cell_size], rax
      next

   }
   #+end_src
** tail-call
   * tail-call
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "tail-call", tail_call
      mov rax, pointer$return_stack
      sub rax, address$return_stack
      test rax, unit__return_point
      jnz .return_stack_even

      pop_return_stack rbx
      pop_return_stack rax
      mov [local_variable$current_free_address], rax
      pop_return_stack rax
      pop_return_stack rax
      mov [V__local_memory_odd__current_free_address + cell_size], rax
      mov rax, [rbx]
      jmp qword [rax]

   .return_stack_even:
      pop_return_stack rbx
      pop_return_stack rax
      mov [local_variable$current_free_address], rax
      pop_return_stack rax
      pop_return_stack rax
      mov [V__local_memory_even__current_free_address + cell_size], rax
      mov rax, [rbx]
      jmp qword [rax]

   }

   match =32bit, machine {

   define_primitive_function "tail-call", tail_call
      mov rax, [pointer$return_stack]
      sub rax, address$return_stack
      test rax, unit__return_point
      jnz .return_stack_even

      pop_return_stack rbx
      pop_return_stack rax
      mov [local_variable$current_free_address], rax
      pop_return_stack rax
      pop_return_stack rax
      mov [V__local_memory_odd__current_free_address + cell_size], rax
      mov rax, [rbx]
      jmp dword [rax]

   .return_stack_even:
      pop_return_stack rbx
      pop_return_stack rax
      mov [local_variable$current_free_address], rax
      pop_return_stack rax
      pop_return_stack rax
      mov [V__local_memory_even__current_free_address + cell_size], rax
      mov rax, [rbx]
      jmp dword [rax]

   }
   #+end_src
