cicada-nymph.html

<div id="outline-container-org53b6a21" class="outline-2">
<h2 id="org53b6a21">end &amp; tail-call</h2>
<div class="outline-text-2" id="text-org53b6a21">
</div><div id="outline-container-orge8bd83c" class="outline-3">
<h3 id="orge8bd83c">end</h3>
<div class="outline-text-3" id="text-orge8bd83c">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"end"</span>, <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, pointer$return_stack
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rax</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rax</span>, unit__return_point
   <span style="color: #a6e22e;">jnz</span> .return_stack_even

   pop_return_stack <span style="color: #fd971f;">rbx</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [V__local_memory_odd__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   next

<span style="color: #a6e22e;">.return_stack_even</span>:
   pop_return_stack <span style="color: #fd971f;">rbx</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [V__local_memory_even__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   next

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"end"</span>, <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rax</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rax</span>, unit__return_point
   <span style="color: #a6e22e;">jnz</span> .return_stack_even

   pop_return_stack <span style="color: #fd971f;">rbx</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [V__local_memory_odd__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   next

<span style="color: #a6e22e;">.return_stack_even</span>:
   pop_return_stack <span style="color: #fd971f;">rbx</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [V__local_memory_even__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf01085d" class="outline-3">
<h3 id="orgf01085d">tail-call</h3>
<div class="outline-text-3" id="text-orgf01085d">
<ul class="org-ul">
<li><p>tail-call</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"tail-call"</span>, <span style="color: #f92672; font-weight: bold;">tail_call</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, pointer$return_stack
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rax</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rax</span>, unit__return_point
   <span style="color: #a6e22e;">jnz</span> .return_stack_even

   pop_return_stack <span style="color: #fd971f;">rbx</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [V__local_memory_odd__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rax</span>]

<span style="color: #a6e22e;">.return_stack_even</span>:
   pop_return_stack <span style="color: #fd971f;">rbx</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [V__local_memory_even__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rax</span>]

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"tail-call"</span>, <span style="color: #f92672; font-weight: bold;">tail_call</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rax</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rax</span>, unit__return_point
   <span style="color: #a6e22e;">jnz</span> .return_stack_even

   pop_return_stack <span style="color: #fd971f;">rbx</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [V__local_memory_odd__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rax</span>]

<span style="color: #a6e22e;">.return_stack_even</span>:
   pop_return_stack <span style="color: #fd971f;">rbx</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [V__local_memory_even__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rax</span>]

}
</pre>
</div>
</div>
</div>
