cicada-nymph.org
** note explicit tail call in action
   1. the tail position of a function body must be recognized
      explicit tail call is used to achieve this
   2. thus
      tail-recursive-call can be use to do loop
      without pushing too many address into return-stack
   3. for example if we have a function
      which is called "example"
      #+begin_src fasm
      define_function "example", example
         xx fun1
         xx fun2
         xx tail_call, example
      #+end_src
   4. and we have the following jojo in return-stack
      #+begin_src return-stack
      - [@][@][ (example) ]
                (end)
      #+end_src
   5. next
      #+begin_src return-stack
                (example)
      - [@][@][ (end) ] - [@][@][ (fun1) ]
                                  (fun2)
                                  (tail-call)
                                  (example)
      #+end_src
   6. next
      #+begin_src return-stack
                (example)         (fun1)
      - [@][@][ (end) ] - [@][@][ (fun2) ]
                                  (tail-call)
                                  (example)
      #+end_src
   7. next
      #+begin_src return-stack
                                  (fun1)
                (example)         (fun2)
      - [@][@][ (end) ] - [@][@][ (tail-call) ]
                                  (example)
      #+end_src
   8. next
      by the definition of tail_call
      #+begin_src return-stack
                (example)
      - [@][@][ (end) ] - [@][@][ (fun1) ]
                                  (fun2)
                                  (tail-call)
                                  (example)
      #+end_src
   9. you can see return-stack of (8.)
      is the same as (5.)
      it is clear how the example function
      is actually a loop now
* helper function in assembly code
** __exit_with_tos                    :linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   __exit_with_tos:
      ;; << exit-code -- >>
      pop_argument_stack linux64_sys_1_rdi
      mov linux64_sys_n_rax, linux64_syscall_exit
      syscall

   }

   match =linux =32bit, platform machine {

   __exit_with_tos:
      ;; << exit-code -- >>
      pop_argument_stack linux32_sys_1_ebx
      mov linux32_sys_n_eax, linux32_syscall_exit
      syscall

   }
   #+end_src
** __exit_with_zero                   :linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   __exit_with_zero:
      ;; << -- >>
      xor linux64_sys_1_rdi, linux64_sys_1_rdi
      mov linux64_sys_n_rax, linux64_syscall_exit
      syscall

   }

   match =linux =32bit, platform machine {

   __exit_with_zero:
      ;; << -- >>
      xor linux32_sys_1_ebx, linux32_sys_1_ebx
      mov linux32_sys_n_eax, linux32_syscall_exit
      syscall

   }
   #+end_src
** __exit_with_six                    :linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   __exit_with_six:
      ;; << -- >>
      mov linux64_sys_1_rdi, 6
      mov linux64_sys_n_rax, linux64_syscall_exit
      syscall

   }

   match =linux =32bit, platform machine {

   __exit_with_six:
      ;; << -- >>
      mov linux32_sys_1_ebx, 6
      mov linux32_sys_n_eax, linux32_syscall_exit
      syscall

   }
   #+end_src
