cicada-nymph.html

<div id="outline-container-orgbdf3567" class="outline-3">
<h3 id="orgbdf3567"><span class="todo note">note</span> explicit tail call in action</h3>
<div class="outline-text-3" id="text-orgbdf3567">
<ol class="org-ol">
<li>the tail position of a function body must be recognized
explicit tail call is used to achieve this</li>
<li>thus
tail-recursive-call can be use to do loop
without pushing too many address into return-stack</li>
<li><p>
for example if we have a function
which is called "example"
</p>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"example"</span>, example
   <span style="color: #66d9ef; font-weight: bold;">xx</span> fun1
   <span style="color: #66d9ef; font-weight: bold;">xx</span> fun2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, example
</pre>
</div></li>
<li><p>
and we have the following jojo in return-stack
</p>
<div class="org-src-container">

<pre class="src src-return-stack"><span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #fd971f; font-weight: bold;">(example)</span> <span style="color: #dc322f; font-weight: bold;">]</span>
          <span style="color: #00ffff; font-weight: bold;">(end)</span>
</pre>
</div></li>
<li><p>
next
</p>
<div class="org-src-container">

<pre class="src src-return-stack">          <span style="color: #ef5939; font-weight: bold;">(example)</span>
<span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #00ffff; font-weight: bold;">(end)</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #fd971f; font-weight: bold;">(fun1)</span> <span style="color: #dc322f; font-weight: bold;">]</span>
                            <span style="color: #ef5939; font-weight: bold;">(fun2)</span>
                            <span style="color: #ef5939; font-weight: bold;">(tail-call)</span>
                            <span style="color: #ef5939; font-weight: bold;">(example)</span>
</pre>
</div></li>
<li><p>
next
</p>
<div class="org-src-container">

<pre class="src src-return-stack">          <span style="color: #ef5939; font-weight: bold;">(example)</span>         <span style="color: #ef5939; font-weight: bold;">(fun1)</span>
<span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #00ffff; font-weight: bold;">(end)</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #fd971f; font-weight: bold;">(fun2)</span> <span style="color: #dc322f; font-weight: bold;">]</span>
                            <span style="color: #ef5939; font-weight: bold;">(tail-call)</span>
                            <span style="color: #ef5939; font-weight: bold;">(example)</span>
</pre>
</div></li>
<li><p>
next
</p>
<div class="org-src-container">

<pre class="src src-return-stack">                            <span style="color: #ef5939; font-weight: bold;">(fun1)</span>
          <span style="color: #ef5939; font-weight: bold;">(example)</span>         <span style="color: #ef5939; font-weight: bold;">(fun2)</span>
<span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #00ffff; font-weight: bold;">(end)</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #fd971f; font-weight: bold;">(tail-call)</span> <span style="color: #dc322f; font-weight: bold;">]</span>
                            <span style="color: #ef5939; font-weight: bold;">(example)</span>
</pre>
</div></li>
<li><p>
next
by the definition of tail_call
</p>
<div class="org-src-container">

<pre class="src src-return-stack">          <span style="color: #ef5939; font-weight: bold;">(example)</span>
<span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #00ffff; font-weight: bold;">(end)</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #fd971f; font-weight: bold;">(fun1)</span> <span style="color: #dc322f; font-weight: bold;">]</span>
                            <span style="color: #ef5939; font-weight: bold;">(fun2)</span>
                            <span style="color: #ef5939; font-weight: bold;">(tail-call)</span>
                            <span style="color: #ef5939; font-weight: bold;">(example)</span>
</pre>
</div></li>
<li>you can see return-stack of (8.)
is the same as (5.)
it is clear how the example function
is actually a loop now</li></ol>
</div>
</div>
</div>

<div id="outline-container-org7fac706" class="outline-2">
<h2 id="org7fac706">helper function in assembly code</h2>
<div class="outline-text-2" id="text-org7fac706">
</div><div id="outline-container-orga2edc1a" class="outline-3">
<h3 id="orga2edc1a">__exit_with_tos&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-orga2edc1a">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

__exit_with_tos:
   <span style="color: #FF8888;">;; &lt;&lt; exit-code -- &gt;&gt;</span>
   pop_argument_stack linux64_sys_1_rdi
   <span style="color: #a6e22e;">mov</span> linux64_sys_n_rax, linux64_syscall_exit
   <span style="color: #a6e22e;">syscall</span>

}

<span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

__exit_with_tos:
   <span style="color: #FF8888;">;; &lt;&lt; exit-code -- &gt;&gt;</span>
   pop_argument_stack linux32_sys_1_ebx
   <span style="color: #a6e22e;">mov</span> linux32_sys_n_eax, linux32_syscall_exit
   <span style="color: #a6e22e;">syscall</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org494bb2d" class="outline-3">
<h3 id="org494bb2d">__exit_with_zero&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org494bb2d">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

__exit_with_zero:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">xor</span> linux64_sys_1_rdi, linux64_sys_1_rdi
   <span style="color: #a6e22e;">mov</span> linux64_sys_n_rax, linux64_syscall_exit
   <span style="color: #a6e22e;">syscall</span>

}

<span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

__exit_with_zero:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">xor</span> linux32_sys_1_ebx, linux32_sys_1_ebx
   <span style="color: #a6e22e;">mov</span> linux32_sys_n_eax, linux32_syscall_exit
   <span style="color: #a6e22e;">syscall</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b92416" class="outline-3">
<h3 id="org2b92416">__exit_with_six&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org2b92416">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

__exit_with_six:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> linux64_sys_1_rdi, <span style="color: #ae81ff;">6</span>
   <span style="color: #a6e22e;">mov</span> linux64_sys_n_rax, linux64_syscall_exit
   <span style="color: #a6e22e;">syscall</span>

}

<span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

__exit_with_six:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> linux32_sys_1_ebx, <span style="color: #ae81ff;">6</span>
   <span style="color: #a6e22e;">mov</span> linux32_sys_n_eax, linux32_syscall_exit
   <span style="color: #a6e22e;">syscall</span>

}
</pre>
</div>
</div>
</div>
