cicada-nymph.org
** __write_string                     :linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   __write_string:
      ;; << address, length -- >>
      pop_argument_stack linux64_sys_3_rdx     ;; max length to be write
      pop_argument_stack linux64_sys_2_rsi     ;; address
      mov linux64_sys_1_rdi, 1                 ;; stdout
      mov linux64_sys_n_rax, linux64_syscall_write
      syscall
      ret

   }

   match =linux =32bit, platform machine {

   __write_string:
      ;; << address, length -- >>
      pop_argument_stack linux32_sys_3_edx     ;; max length to be write
      pop_argument_stack linux32_sys_2_ecx     ;; address
      mov linux32_sys_1_ebx, 1                 ;; stdout
      mov linux32_sys_n_eax, linux32_syscall_write
      syscall
      ret

   }
   #+end_src
** __reset_argument_stack             :linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   __reset_argument_stack:
      ;; << -- >>
      mov pointer$argument_stack,  address$argument_stack
      ret

   }

   match =linux =32bit, platform machine {

   __reset_argument_stack:
      ;; << -- >>
      mov rax, address$argument_stack
      mov [pointer$argument_stack], rax
      ret

   }
   #+end_src
** __reset_return_stack               :linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   __reset_return_stack:
      ;; << -- >>
      mov pointer$return_stack, address$return_stack
      ret

   }

   match =linux =32bit, platform machine {

   __reset_return_stack:
      ;; << -- >>
      mov rax, address$return_stack
      mov [pointer$return_stack], rax
      ret

   }
   #+end_src
** __reset_syntax_stack               :linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   __reset_syntax_stack:
      ;; << -- >>
      mov rax, address$syntax_stack
      mov [V__syntax_stack__pointer + cell_size], rax
      ret
   #+end_src
** __reset_local_variable
   #+begin_src fasm :tangle cicada-nymph.fasm
   __reset_local_variable:
      ;; << -- >>
      mov rax, address$local_variable
      mov [local_variable$current_free_address], rax
      ret
   #+end_src
** __reset_local_memory
   #+begin_src fasm :tangle cicada-nymph.fasm
   __reset_local_memory:
      ;; << -- >>
      mov rax, address$local_memory_even
      mov [V__local_memory_even__current_free_address + cell_size], rax
      mov rax, address$local_memory_odd
      mov [V__local_memory_odd__current_free_address + cell_size], rax
      ret
   #+end_src
* *the-story-begin*
** ----------------------------------
** 記 匯編代碼中的初始化
   * 注意
     所入返回棧的應該是 jojo 而不是 jo
** begin_to_interpret_threaded_code   :linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux, platform {

   begin_to_interpret_threaded_code:

      cld ;; set DF = 0, then rsi and rdi are incremented

      call __reset_argument_stack
      call __reset_return_stack

      pop_return_stack rax
      pop_return_stack rax
      pop_return_stack rax
      pop_return_stack rax

      mov rax, address$local_memory_odd
      push_return_stack rax
      mov rax, address$local_memory_even
      push_return_stack rax
      mov rax, address$local_variable
      push_return_stack rax
      mov rax, jojo_for__report_return_stack_is_empty_and_exit
      push_return_stack rax

      mov rax, address$local_memory_even
      push_return_stack rax
      mov rax, address$local_memory_odd
      push_return_stack rax
      mov rax, address$local_variable
      push_return_stack rax
      mov rax, first_jojo
      push_return_stack rax

      next

   first_jojo:
      ;; xx little_test
      xx initialization
      xx load_core_file
      xx tail_call, basic_REPL

   }
   #+end_src
** initialization
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "initialization", initialization
      ;; << -- >>
      xx init__syntax_rule_set__jojo_compiler
      xx end
   #+end_src
** ----------------------------------
