cicada-nymph.html

<div id="outline-container-org3fd2b0a" class="outline-3">
<h3 id="org3fd2b0a">__write_string&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org3fd2b0a">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

__write_string:
   <span style="color: #FF8888;">;; &lt;&lt; address, length -- &gt;&gt;</span>
   pop_argument_stack linux64_sys_3_rdx     <span style="color: #FF8888;">;; max length to be write</span>
   pop_argument_stack linux64_sys_2_rsi     <span style="color: #FF8888;">;; address</span>
   <span style="color: #a6e22e;">mov</span> linux64_sys_1_rdi, <span style="color: #ae81ff;">1</span>                 <span style="color: #FF8888;">;; stdout</span>
   <span style="color: #a6e22e;">mov</span> linux64_sys_n_rax, linux64_syscall_write
   <span style="color: #a6e22e;">syscall</span>
   <span style="color: #a6e22e;">ret</span>

}

<span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

__write_string:
   <span style="color: #FF8888;">;; &lt;&lt; address, length -- &gt;&gt;</span>
   pop_argument_stack linux32_sys_3_edx     <span style="color: #FF8888;">;; max length to be write</span>
   pop_argument_stack linux32_sys_2_ecx     <span style="color: #FF8888;">;; address</span>
   <span style="color: #a6e22e;">mov</span> linux32_sys_1_ebx, <span style="color: #ae81ff;">1</span>                 <span style="color: #FF8888;">;; stdout</span>
   <span style="color: #a6e22e;">mov</span> linux32_sys_n_eax, linux32_syscall_write
   <span style="color: #a6e22e;">syscall</span>
   <span style="color: #a6e22e;">ret</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org830074" class="outline-3">
<h3 id="org830074">__reset_argument_stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org830074">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

__reset_argument_stack:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> pointer$argument_stack,  address$argument_stack
   <span style="color: #a6e22e;">ret</span>

}

<span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

__reset_argument_stack:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$argument_stack
   <span style="color: #a6e22e;">mov</span> [pointer$argument_stack], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">ret</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1bcb73" class="outline-3">
<h3 id="orge1bcb73">__reset_return_stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-orge1bcb73">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

__reset_return_stack:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> pointer$return_stack, address$return_stack
   <span style="color: #a6e22e;">ret</span>

}

<span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

__reset_return_stack:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$return_stack
   <span style="color: #a6e22e;">mov</span> [pointer$return_stack], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">ret</span>

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org51ec906" class="outline-3">
<h3 id="org51ec906">__reset_syntax_stack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org51ec906">
<div class="org-src-container">

<pre class="src src-fasm">__reset_syntax_stack:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$syntax_stack
   <span style="color: #a6e22e;">mov</span> [V__syntax_stack__pointer + cell_size], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">ret</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb189e4" class="outline-3">
<h3 id="orgbb189e4">__reset_local_variable</h3>
<div class="outline-text-3" id="text-orgbb189e4">
<div class="org-src-container">

<pre class="src src-fasm">__reset_local_variable:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$local_variable
   <span style="color: #a6e22e;">mov</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">ret</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org42b0707" class="outline-3">
<h3 id="org42b0707">__reset_local_memory</h3>
<div class="outline-text-3" id="text-org42b0707">
<div class="org-src-container">

<pre class="src src-fasm">__reset_local_memory:
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$local_memory_even
   <span style="color: #a6e22e;">mov</span> [V__local_memory_even__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$local_memory_odd
   <span style="color: #a6e22e;">mov</span> [V__local_memory_odd__current_free_address + cell_size], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">ret</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org65e5db0" class="outline-2">
<h2 id="org65e5db0"><b>the-story-begin</b></h2>
<div class="outline-text-2" id="text-org65e5db0">
</div><div id="outline-container-org91ce231" class="outline-3">
<h3 id="org91ce231"><span class="todo _">記</span> 匯編代碼中的初始化</h3>
<div class="outline-text-3" id="text-org91ce231">
<ul class="org-ul">
<li><p>注意</p><p>所入返回棧的應該是 jojo 而不是 jo</p></li></ul>
</div>
</div>

<div id="outline-container-org1b06f40" class="outline-3">
<h3 id="org1b06f40">begin_to_interpret_threaded_code&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org1b06f40">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux, platform {

<span style="color: #a6e22e;">begin_to_interpret_threaded_code</span>:

   <span style="color: #a6e22e;">cld</span> <span style="color: #FF8888;">;; set DF = 0, then rsi and rdi are incremented</span>

   <span style="color: #a6e22e;">call</span> __reset_argument_stack
   <span style="color: #a6e22e;">call</span> __reset_return_stack

   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>
   pop_return_stack <span style="color: #fd971f;">rax</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$local_memory_odd
   push_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$local_memory_even
   push_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$local_variable
   push_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, jojo_for__report_return_stack_is_empty_and_exit
   push_return_stack <span style="color: #fd971f;">rax</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$local_memory_even
   push_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$local_memory_odd
   push_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, address$local_variable
   push_return_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, first_jojo
   push_return_stack <span style="color: #fd971f;">rax</span>

   next

<span style="color: #a6e22e;">first_jojo</span>:
   <span style="color: #FF8888;">;; xx little_test</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> initialization
   <span style="color: #66d9ef; font-weight: bold;">xx</span> load_core_file
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, basic_REPL

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga5136c3" class="outline-3">
<h3 id="orga5136c3">initialization</h3>
<div class="outline-text-3" id="text-orga5136c3">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"initialization"</span>, initialization
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> init__syntax_rule_set__jojo_compiler
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
