cicada-nymph.org
** note top-level-REPL
   * a top-level-REPL always lives at the bottom of return-stack
     #+begin_src return-stack
               (function)
               (function)
     - [@][@][ (tail-call) ]
               (top-level-REPL)
     #+end_src
   * right below the return-stack
     there is a (report-return-stack-is-empty-and-exit)
     so actually
     #+begin_src return-stack
                                                             (function)
                                                             (function)
     - [ (report-return-stack-is-empty-and-exit) ] - [@][@][ (tail-call) ]
                                                             (top-level-REPL)
     #+end_src
   * when you say bye to a top-level-REPL
     (report-return-stack-is-empty-and-exit) will be executed
** report-return-stack-is-empty-and-exit
   #+begin_src fasm :tangle cicada-nymph.fasm
   string$report_return_stack_is_empty_and_exit:
      db "* the return-stack is empty now", 10
      db "  good bye ^-^/", 10
   .end:
   length$report_return_stack_is_empty_and_exit = (.end - string$report_return_stack_is_empty_and_exit)

   define_primitive_function "report-return-stack-is-empty-and-exit", report_return_stack_is_empty_and_exit
      ;; << -- >>
      mov rax, string$report_return_stack_is_empty_and_exit
      mov rcx, length$report_return_stack_is_empty_and_exit
      push_argument_stack rax
      push_argument_stack rcx
      call __write_string
      call __exit_with_zero

   jojo_for__report_return_stack_is_empty_and_exit:
      xx report_return_stack_is_empty_and_exit
   #+end_src
** reset-top-level-REPL
   * local_variable & local_memory
     will get reseted in by this function
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "reset-top-level-REPL", reset_top_level_REPL
      ;; << top_level_REPL [jo] -- >>
      call __reset_return_stack
      call __reset_syntax_stack
      call __reset_local_variable
      call __reset_local_memory
      pop_argument_stack rax
      jmp qword [rax]

   }

   match =32bit, machine {

   define_primitive_function "reset-top-level-REPL", reset_top_level_REPL
      ;; << top_level_REPL [jo] -- >>
      call __reset_return_stack
      call __reset_syntax_stack
      call __reset_local_variable
      call __reset_local_memory
      pop_argument_stack rax
      jmp dword [rax]

   }
   #+end_src
** ----------------------------------
** exit_with_tos a.k.a. bye
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "bye", exit_with_tos
      call __exit_with_tos
   #+end_src
** ----------------------------------
