cicada-nymph.html


<div id="outline-container-org3cfdb28" class="outline-3">
<h3 id="org3cfdb28"><span class="todo note">note</span> top-level-REPL</h3>
<div class="outline-text-3" id="text-org3cfdb28">
<ul class="org-ul">
<li><p><p></p><p>a top-level-REPL always lives at the bottom of return-stack</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">          <span style="color: #ef5939; font-weight: bold;">(function)</span></p><p>          <span style="color: #ef5939; font-weight: bold;">(function)</span></p><p><span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #fd971f; font-weight: bold;">(tail-call)</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p>          <span style="color: #ef5939; font-weight: bold;">(top-level-REPL)</span></p><p></pre></p><p></div></p></li>
<li><p><p></p><p>right below the return-stack</p><p>there is a (report-return-stack-is-empty-and-exit)</p><p>so actually</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-return-stack">                                                        <span style="color: #ef5939; font-weight: bold;">(function)</span></p><p>                                                        <span style="color: #ef5939; font-weight: bold;">(function)</span></p><p><span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span> <span style="color: #fd971f; font-weight: bold;">(report-return-stack-is-empty-and-exit)</span> <span style="color: #dc322f; font-weight: bold;">]</span> <span style="color: #ae81ff; font-weight: bold;">-</span> <span style="color: #dc322f; font-weight: bold;">[</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span><span style="color: #fd971f; font-weight: bold;">@</span><span style="color: #dc322f; font-weight: bold;">][</span> <span style="color: #fd971f; font-weight: bold;">(tail-call)</span> <span style="color: #dc322f; font-weight: bold;">]</span></p><p>                                                        <span style="color: #ef5939; font-weight: bold;">(top-level-REPL)</span></p><p></pre></p><p></div></p></li>
<li><p>when you say bye to a top-level-REPL</p><p>(report-return-stack-is-empty-and-exit) will be executed</p></li></ul>
</div>
</div>

<div id="outline-container-org43952a9" class="outline-3">
<h3 id="org43952a9">report-return-stack-is-empty-and-exit</h3>
<div class="outline-text-3" id="text-org43952a9">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">string$report_return_stack_is_empty_and_exit</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"* the return-stack is empty now"</span>, <span style="color: #ae81ff;">10</span>
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"  good bye ^-^/"</span>, <span style="color: #ae81ff;">10</span>
<span style="color: #a6e22e;">.end</span>:
length$report_return_stack_is_empty_and_exit = (.end - string$report_return_stack_is_empty_and_exit)

define_primitive_function <span style="color: #e6db74;">"report-return-stack-is-empty-and-exit"</span>, report_return_stack_is_empty_and_exit
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, string$report_return_stack_is_empty_and_exit
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, length$report_return_stack_is_empty_and_exit
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   <span style="color: #a6e22e;">call</span> __write_string
   <span style="color: #a6e22e;">call</span> __exit_with_zero

<span style="color: #a6e22e;">jojo_for__report_return_stack_is_empty_and_exit</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> report_return_stack_is_empty_and_exit
</pre>
</div>
</div>
</div>

<div id="outline-container-org78b3e3d" class="outline-3">
<h3 id="org78b3e3d">reset-top-level-REPL</h3>
<div class="outline-text-3" id="text-org78b3e3d">
<ul class="org-ul">
<li><p>local_variable &amp; local_memory</p><p>will get reseted in by this function</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"reset-top-level-REPL"</span>, reset_top_level_REPL
   <span style="color: #FF8888;">;; &lt;&lt; top_level_REPL [jo] -- &gt;&gt;</span>
   <span style="color: #a6e22e;">call</span> __reset_return_stack
   <span style="color: #a6e22e;">call</span> __reset_syntax_stack
   <span style="color: #a6e22e;">call</span> __reset_local_variable
   <span style="color: #a6e22e;">call</span> __reset_local_memory
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rax</span>]

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"reset-top-level-REPL"</span>, reset_top_level_REPL
   <span style="color: #FF8888;">;; &lt;&lt; top_level_REPL [jo] -- &gt;&gt;</span>
   <span style="color: #a6e22e;">call</span> __reset_return_stack
   <span style="color: #a6e22e;">call</span> __reset_syntax_stack
   <span style="color: #a6e22e;">call</span> __reset_local_variable
   <span style="color: #a6e22e;">call</span> __reset_local_memory
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">jmp</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rax</span>]

}
</pre>
</div>
</div>
</div>


<div id="outline-container-org7118f6a" class="outline-3">
<h3 id="org7118f6a">exit_with_tos a.k.a. bye</h3>
<div class="outline-text-3" id="text-org7118f6a">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"bye"</span>, exit_with_tos
   <span style="color: #a6e22e;">call</span> __exit_with_tos
</pre>
</div>
</div>
</div>
