cicada-nymph.org
** little_test
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "", V__little_test_number
      xx 3

   define_function "little_test", little_test

      ;;;; variable
      ;; xx V__little_test_number
      ;; xx exit_with_tos
      ;;;; exit ocde : 3

      ;;;; literal
      ;; xx literal, 4
      ;; xx exit_with_tos
      ;;;; exit ocde : 4

      ;;;; address
      ;; xx address, V__little_test_number, get, add2
      ;; xx address, V__little_test_number, set
      ;; xx V__little_test_number
      ;; xx exit_with_tos
      ;;;; exit ocde : 5

      ;;;; end
      ;; xx literal, 2, negate
      ;; xx literal, 8
      ;; xx addition
      ;; xx exit_with_tos
      ;;;; 6

      ;;;; tail_call
      ;; xx literal, 2
      ;; xx literal, 4
      ;; xx power
      ;; xx exit_with_tos
      ;;;; exit ocde : 16

      ;;;; write_byte
      ;; xx literal, 64, write_byte
      ;; xx literal, 10, write_byte
      ;; xx zero
      ;; xx exit_with_tos
      ;;;; @

      ;;;; read_byte
      ;; xx read_byte, write_byte
      ;; xx exit_with_tos
      ;;;;

      ;;;; branch
      ;; xx read_byte, write_byte
      ;; xx branch, -3
      ;;;; read a string that ended by <return>
      ;;;; write the readed string
      ;;;; or we can say
      ;;;; read line and write line
      ;;;; or we can say
      ;;;; echo line

      ;;;; false?branch
      ;; xx false, false?branch, 9
      ;; xx   literal, 64, write_byte
      ;; xx   literal, 10, write_byte
      ;; xx   zero
      ;; xx   exit_with_tos
      ;; xx true, false?branch, 9
      ;; xx   literal, 65, write_byte
      ;; xx   literal, 10, write_byte
      ;; xx   zero
      ;; xx   exit_with_tos
      ;; xx zero
      ;; xx exit_with_tos
      ;;;; A

      ;;;; read_word & write_string
      ;; xx read_word, write_string
      ;; xx literal, 10, write_byte
      ;; xx read_word, write_string
      ;; xx literal, 10, write_byte
      ;; xx zero
      ;; xx exit_with_tos
      ;;;; read line
      ;;;; write first two words of the line

      ;;;; string->integer
      ;; xx read_word, string_to_integer
      ;; xx exit_with_tos
      ;;;; type 123
      ;;;; exit code 123

      ;;;; xxoverxx
      ;; xx literal, 1
      ;; xx literal, 2
      ;; xx literal, 3
      ;; xx literal, 4
      ;; xx xxoverxx
      ;; xx pretty_write_integer
      ;; xx pretty_write_integer
      ;; xx pretty_write_integer
      ;; xx pretty_write_integer
      ;; xx pretty_write_integer
      ;; xx pretty_write_integer
      ;; xx zero
      ;; xx exit_with_tos
      ;;;; 2 1 4 3 2 1

      ;;;; find_link
      ;; xx read_word, string_to_integer ;; number
      ;; xx read_word, string_to_integer ;; number
      ;; xx read_word, V__link, find_link ;; add
      ;; xx drop ;; true
      ;; xx link_to_jo
      ;; xx apply
      ;; xx write_integer
      ;; xx zero
      ;; xx exit_with_tos
      ;;;; 1 2 add
      ;;;; print "3"

      ;;;; basic-REPL (without the ability to define function)
      ;;;; after this test
      ;;;; we will use basic-REPL to do further tests
      ;; xx basic_REPL
      ;;;; 1 2 add .
   #+end_src
** ----------------------------------
* -----------------------------------
* instruction
** note side-effect
   * an instruction
     is a special primitive function
     which does special side-effect on return-stack
   * note that
     side-effect on return-stack
     should all be done in primitive functions
** note naming
   * the naming convention in assembly code
     of instruction
     is the same as it of jo
** instruction,literal
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "instruction,literal", literal
      ;; << -- fixnum >>
      pop_return_stack rbx
        mov rax, [rbx]
        push_argument_stack rax
      add rbx, cell_size
      push_return_stack rbx
      next
   #+end_src
** instruction,address
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "instruction,address", address
      ;; << -- address >>
      pop_return_stack rbx
        mov rax, [rbx]
        add rax, cell_size
        push_argument_stack rax
      add rbx, cell_size
      push_return_stack rbx
      next
   #+end_src
** instruction,branch
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "instruction,branch", branch
      pop_return_stack rbx
        mov rax, [rbx]
        imul rax, cell_size
        add rbx, rax
      push_return_stack rbx
      next
   #+end_src
