cicada-nymph.html


<div id="outline-container-org9e400e5" class="outline-3">
<h3 id="org9e400e5">little_test</h3>
<div class="outline-text-3" id="text-org9e400e5">
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">""</span>, V__little_test_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">3</span>

define_function <span style="color: #e6db74;">"little_test"</span>, little_test

   <span style="color: #FF8888;">;;;; variable</span>
   <span style="color: #FF8888;">;; xx V__little_test_number</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; exit ocde : 3</span>

   <span style="color: #FF8888;">;;;; literal</span>
   <span style="color: #FF8888;">;; xx literal, 4</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; exit ocde : 4</span>

   <span style="color: #FF8888;">;;;; address</span>
   <span style="color: #FF8888;">;; xx address, V__little_test_number, get, add2</span>
   <span style="color: #FF8888;">;; xx address, V__little_test_number, set</span>
   <span style="color: #FF8888;">;; xx V__little_test_number</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; exit ocde : 5</span>

   <span style="color: #FF8888;">;;;; end</span>
   <span style="color: #FF8888;">;; xx literal, 2, negate</span>
   <span style="color: #FF8888;">;; xx literal, 8</span>
   <span style="color: #FF8888;">;; xx addition</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; 6</span>

   <span style="color: #FF8888;">;;;; tail_call</span>
   <span style="color: #FF8888;">;; xx literal, 2</span>
   <span style="color: #FF8888;">;; xx literal, 4</span>
   <span style="color: #FF8888;">;; xx power</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; exit ocde : 16</span>

   <span style="color: #FF8888;">;;;; write_byte</span>
   <span style="color: #FF8888;">;; xx literal, 64, write_byte</span>
   <span style="color: #FF8888;">;; xx literal, 10, write_byte</span>
   <span style="color: #FF8888;">;; xx zero</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; @</span>

   <span style="color: #FF8888;">;;;; read_byte</span>
   <span style="color: #FF8888;">;; xx read_byte, write_byte</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;;</span>

   <span style="color: #FF8888;">;;;; branch</span>
   <span style="color: #FF8888;">;; xx read_byte, write_byte</span>
   <span style="color: #FF8888;">;; xx branch, -3</span>
   <span style="color: #FF8888;">;;;; read a string that ended by &lt;return&gt;</span>
   <span style="color: #FF8888;">;;;; write the readed string</span>
   <span style="color: #FF8888;">;;;; or we can say</span>
   <span style="color: #FF8888;">;;;; read line and write line</span>
   <span style="color: #FF8888;">;;;; or we can say</span>
   <span style="color: #FF8888;">;;;; echo line</span>

   <span style="color: #FF8888;">;;;; false?branch</span>
   <span style="color: #FF8888;">;; xx false, false?branch, 9</span>
   <span style="color: #FF8888;">;; xx   literal, 64, write_byte</span>
   <span style="color: #FF8888;">;; xx   literal, 10, write_byte</span>
   <span style="color: #FF8888;">;; xx   zero</span>
   <span style="color: #FF8888;">;; xx   exit_with_tos</span>
   <span style="color: #FF8888;">;; xx true, false?branch, 9</span>
   <span style="color: #FF8888;">;; xx   literal, 65, write_byte</span>
   <span style="color: #FF8888;">;; xx   literal, 10, write_byte</span>
   <span style="color: #FF8888;">;; xx   zero</span>
   <span style="color: #FF8888;">;; xx   exit_with_tos</span>
   <span style="color: #FF8888;">;; xx zero</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; A</span>

   <span style="color: #FF8888;">;;;; read_word &amp; write_string</span>
   <span style="color: #FF8888;">;; xx read_word, write_string</span>
   <span style="color: #FF8888;">;; xx literal, 10, write_byte</span>
   <span style="color: #FF8888;">;; xx read_word, write_string</span>
   <span style="color: #FF8888;">;; xx literal, 10, write_byte</span>
   <span style="color: #FF8888;">;; xx zero</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; read line</span>
   <span style="color: #FF8888;">;;;; write first two words of the line</span>

   <span style="color: #FF8888;">;;;; string-&gt;integer</span>
   <span style="color: #FF8888;">;; xx read_word, string_to_integer</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; type 123</span>
   <span style="color: #FF8888;">;;;; exit code 123</span>

   <span style="color: #FF8888;">;;;; xxoverxx</span>
   <span style="color: #FF8888;">;; xx literal, 1</span>
   <span style="color: #FF8888;">;; xx literal, 2</span>
   <span style="color: #FF8888;">;; xx literal, 3</span>
   <span style="color: #FF8888;">;; xx literal, 4</span>
   <span style="color: #FF8888;">;; xx xxoverxx</span>
   <span style="color: #FF8888;">;; xx pretty_write_integer</span>
   <span style="color: #FF8888;">;; xx pretty_write_integer</span>
   <span style="color: #FF8888;">;; xx pretty_write_integer</span>
   <span style="color: #FF8888;">;; xx pretty_write_integer</span>
   <span style="color: #FF8888;">;; xx pretty_write_integer</span>
   <span style="color: #FF8888;">;; xx pretty_write_integer</span>
   <span style="color: #FF8888;">;; xx zero</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; 2 1 4 3 2 1</span>

   <span style="color: #FF8888;">;;;; find_link</span>
   <span style="color: #FF8888;">;; xx read_word, string_to_integer ;; number</span>
   <span style="color: #FF8888;">;; xx read_word, string_to_integer ;; number</span>
   <span style="color: #FF8888;">;; xx read_word, V__link, find_link ;; add</span>
   <span style="color: #FF8888;">;; xx drop ;; true</span>
   <span style="color: #FF8888;">;; xx link_to_jo</span>
   <span style="color: #FF8888;">;; xx apply</span>
   <span style="color: #FF8888;">;; xx write_integer</span>
   <span style="color: #FF8888;">;; xx zero</span>
   <span style="color: #FF8888;">;; xx exit_with_tos</span>
   <span style="color: #FF8888;">;;;; 1 2 add</span>
   <span style="color: #FF8888;">;;;; print "3"</span>

   <span style="color: #FF8888;">;;;; basic-REPL (without the ability to define function)</span>
   <span style="color: #FF8888;">;;;; after this test</span>
   <span style="color: #FF8888;">;;;; we will use basic-REPL to do further tests</span>
   <span style="color: #FF8888;">;; xx basic_REPL</span>
   <span style="color: #FF8888;">;;;; 1 2 add .</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org9979052" class="outline-2">
<h2 id="org9979052">instruction</h2>
<div class="outline-text-2" id="text-org9979052">
</div><div id="outline-container-orgf896f91" class="outline-3">
<h3 id="orgf896f91"><span class="todo note">note</span> side-effect</h3>
<div class="outline-text-3" id="text-orgf896f91">
<ul class="org-ul">
<li><p>an instruction</p><p>is a special primitive function</p><p>which does special side-effect on return-stack</p></li>
<li><p>note that</p><p>side-effect on return-stack</p><p>should all be done in primitive functions</p></li></ul>
</div>
</div>

<div id="outline-container-org8c93430" class="outline-3">
<h3 id="org8c93430"><span class="todo note">note</span> naming</h3>
<div class="outline-text-3" id="text-org8c93430">
<ul class="org-ul">
<li><p>the naming convention in assembly code</p><p>of instruction</p><p>is the same as it of jo</p></li></ul>
</div>
</div>

<div id="outline-container-orga9c1146" class="outline-3">
<h3 id="orga9c1146">instruction,literal</h3>
<div class="outline-text-3" id="text-orga9c1146">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"instruction,literal"</span>, <span style="color: #f92672; font-weight: bold;">literal</span>
   <span style="color: #FF8888;">;; &lt;&lt; -- fixnum &gt;&gt;</span>
   pop_return_stack <span style="color: #fd971f;">rbx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
     push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, cell_size
   push_return_stack <span style="color: #fd971f;">rbx</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-org761f66" class="outline-3">
<h3 id="org761f66">instruction,address</h3>
<div class="outline-text-3" id="text-org761f66">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"instruction,address"</span>, <span style="color: #f92672; font-weight: bold;">address</span>
   <span style="color: #FF8888;">;; &lt;&lt; -- address &gt;&gt;</span>
   pop_return_stack <span style="color: #fd971f;">rbx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
     <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rax</span>, cell_size
     push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, cell_size
   push_return_stack <span style="color: #fd971f;">rbx</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfce615c" class="outline-3">
<h3 id="orgfce615c">instruction,branch</h3>
<div class="outline-text-3" id="text-orgfce615c">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"instruction,branch"</span>, <span style="color: #f92672; font-weight: bold;">branch</span>
   pop_return_stack <span style="color: #fd971f;">rbx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
     <span style="color: #a6e22e;">imul</span> <span style="color: #fd971f;">rax</span>, cell_size
     <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rax</span>
   push_return_stack <span style="color: #fd971f;">rbx</span>
   next
</pre>
</div>
</div>
</div>
