cicada-nymph.html

<div id="outline-container-org75ea086" class="outline-3">
<h3 id="org75ea086">instruction,false?branch</h3>
<div class="outline-text-3" id="text-org75ea086">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"instruction,false?branch"</span>, <span style="color: #f92672; font-weight: bold;">false?branch</span>
   <span style="color: #FF8888;">;; &lt;&lt; true of false -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">jnz</span> help__false?branch__not_to_branch

   pop_return_stack <span style="color: #fd971f;">rbx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
     <span style="color: #a6e22e;">imul</span> <span style="color: #fd971f;">rax</span>, cell_size
     <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rax</span>
   push_return_stack <span style="color: #fd971f;">rbx</span>
   next

<span style="color: #a6e22e;">help__false?branch__not_to_branch</span>:
   pop_return_stack <span style="color: #fd971f;">rbx</span>
     <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, cell_size
   push_return_stack <span style="color: #fd971f;">rbx</span>
   next
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb634106" class="outline-2">
<h2 id="orgb634106">the stack</h2>
<div class="outline-text-2" id="text-orgb634106">
</div><div id="outline-container-orga60f966" class="outline-3">
<h3 id="orga60f966"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-orga60f966">
<ul class="org-ul">
<li><p>the stack is the argument-stack</p></li></ul>
</div>
</div>

<div id="outline-container-org25675f4" class="outline-3">
<h3 id="org25675f4">drop</h3>
<div class="outline-text-3" id="text-org25675f4">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"drop"</span>, drop
   <span style="color: #FF8888;">;; &lt;&lt; a -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"drop2"</span>, drop2
   <span style="color: #FF8888;">;; &lt;&lt; a b -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-org95f768e" class="outline-3">
<h3 id="org95f768e">dup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-org95f768e">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"dup"</span>, <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #FF8888;">;; &lt;&lt; a -- a, a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">1</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"dup2"</span>, dup2
   <span style="color: #FF8888;">;; &lt;&lt; a b -- a b a b &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rbx</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">1</span> * cell_size)]
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">2</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4db053" class="outline-3">
<h3 id="orgf4db053">dup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-orgf4db053">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"dup"</span>, <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #FF8888;">;; &lt;&lt; a -- a a &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"dup2"</span>, dup2
   <span style="color: #FF8888;">;; &lt;&lt; a b -- a b a b &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcec814b" class="outline-3">
<h3 id="orgcec814b">over&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-orgcec814b">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"over"</span>, over
   <span style="color: #FF8888;">;; &lt;&lt; a b -- a b | a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">2</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"x|over|xx"</span>, xoverxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c -- a | b c | a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">3</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|over|x"</span>, xxoverx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c -- a b | c | a b &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">3</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">3</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|over|xx"</span>, xxoverxx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c d -- a b | c d | a b &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">4</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">4</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"x|over|xxx"</span>, xoverxxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c d -- a | b c d | a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">4</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"x|over|xxxx"</span>, xoverxxxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c d -- a | b c d | a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">5</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|over|xxxx"</span>, xxoverxxxx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c d e f -- a b | c d e f | a b &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">6</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span>  <span style="color: #fd971f;">rax</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">6</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

}
</pre>
</div>
</div>
</div>
