cicada-nymph.html

<div id="outline-container-org70c0abf" class="outline-3">
<h3 id="org70c0abf">over&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org70c0abf">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"over"</span>, over
   <span style="color: #FF8888;">;; &lt;&lt; a b -- a b | a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">2</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"x|over|xx"</span>, xoverxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c -- a | b c | a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">3</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|over|x"</span>, xxoverx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c -- a b | c | a b &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">3</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">2</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|over|xx"</span>, xxoverxx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c d -- a b | c d | a b &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">4</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">3</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"x|over|xxx"</span>, xoverxxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c d -- a | b c d | a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">4</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"x|over|xxxx"</span>, xoverxxxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c d -- a | b c d | a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">5</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|over|xxxx"</span>, xxoverxxxx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c d e f -- a b | c d e f | a b &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">6</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">5</span> * cell_size)]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9caf9fa" class="outline-3">
<h3 id="org9caf9fa">tuck</h3>
<div class="outline-text-3" id="text-org9caf9fa">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"tuck"</span>, tuck
   <span style="color: #FF8888;">;; &lt;&lt; a b -- b | a b &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   next

define_primitive_function <span style="color: #e6db74;">"x|tuck|xx"</span>, xtuckxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c -- b c | a | b c &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|tuck|x"</span>, xxtuckx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c -- c | a b | c &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|tuck|xx"</span>, xxtuckxx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c d -- c d | a b | c d &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rdx</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   next

define_primitive_function <span style="color: #e6db74;">"xxx|tuck|x"</span>, xxxtuckx
   <span style="color: #FF8888;">;; &lt;&lt; a b c | d -- d | a b c | d &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rdx</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   next

define_primitive_function <span style="color: #e6db74;">"xxxx|tuck|x"</span>, xxxxtuckx
   <span style="color: #FF8888;">;; &lt;&lt; a b c d | e -- e | a b c d | e &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; e</span>
   pop_argument_stack <span style="color: #fd971f;">rdx</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; e</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   push_argument_stack <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; e</span>
   next
</pre>
</div>
</div>
</div>
