cicada-nymph.org
** swap
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "swap", swap
      ;; << a b -- b a >>
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rbx
      push_argument_stack rax
      next

   define_primitive_function "x|swap|xx", xswapxx
      ;; << a | b c -- b c | a >>
      pop_argument_stack  rcx
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rbx
      push_argument_stack rcx
      push_argument_stack rax
      next

   define_primitive_function "xx|swap|x", xxswapx
      ;; << a b | c -- c | a b >>
      pop_argument_stack  rcx
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rcx
      push_argument_stack rax
      push_argument_stack rbx
      next

   define_primitive_function "x|swap|xxx", xswapxxx
      ;; << a | b c d -- b c d | a >>
      pop_argument_stack  rdx
      pop_argument_stack  rcx
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rbx
      push_argument_stack rcx
      push_argument_stack rdx
      push_argument_stack rax
      next

   define_primitive_function "xxx|swap|x", xxxswapx
      ;; << a b c | d -- d | a b c >>
      pop_argument_stack  rdx
      pop_argument_stack  rcx
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rdx
      push_argument_stack rax
      push_argument_stack rbx
      push_argument_stack rcx
      next

   define_primitive_function "xx|swap|xx", xxswapxx
      ;; << a b | c d -- c d | a b >>
      pop_argument_stack  rdx
      pop_argument_stack  rcx
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rcx
      push_argument_stack rdx
      push_argument_stack rax
      push_argument_stack rbx
      next


   define_primitive_function "x|swap|xxxx", xswapxxxx
      ;; << a | b c d e -- b c d e | a >>
      pop_argument_stack  rsi ;; e
      pop_argument_stack  rdx
      pop_argument_stack  rcx
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rbx
      push_argument_stack rcx
      push_argument_stack rdx
      push_argument_stack rsi ;; e
      push_argument_stack rax
      next

   define_primitive_function "xxxx|swap|x", xxxxswapx
      ;; << a b c d | e --  e | a b c d >>
      pop_argument_stack  rsi ;; e
      pop_argument_stack  rdx
      pop_argument_stack  rcx
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rsi ;; e
      push_argument_stack rax
      push_argument_stack rbx
      push_argument_stack rcx
      push_argument_stack rdx
      next


   define_primitive_function "xx|swap|xxxx", xxswapxxxx
      ;; << a b | c d e f -- c d e f | a b >>
      pop_argument_stack  rsi ;; f
      pop_argument_stack  rdi ;; e
      pop_argument_stack  rdx
      pop_argument_stack  rcx
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rcx
      push_argument_stack rdx
      push_argument_stack rdi ;; e
      push_argument_stack rsi ;; f
      push_argument_stack rax
      push_argument_stack rbx
      next

   define_primitive_function "xxxx|swap|xx", xxxxswapxx
      ;; << a b c d | e f --  e f | a b c d >>
      pop_argument_stack  rsi ;; f
      pop_argument_stack  rdi ;; e
      pop_argument_stack  rdx
      pop_argument_stack  rcx
      pop_argument_stack  rbx
      pop_argument_stack  rax
      push_argument_stack rdi ;; e
      push_argument_stack rsi ;; f
      push_argument_stack rax
      push_argument_stack rbx
      push_argument_stack rcx
      push_argument_stack rdx
      next
   #+end_src
** address
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "*the-stack*", V__the_stack
      xx address$argument_stack
   #+end_src
** pointer
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_variable "*the-stack-pointer-snapshot*", V__the_stack_pointer_snapshot
      xx address$argument_stack

   define_primitive_function "snapshot-the-stack-pointer", snapshot_the_stack_pointer
      ;; << -- >>
      mov [V__the_stack_pointer_snapshot + cell_size], pointer$argument_stack
      next

   }

   match =32bit, machine {

   define_variable "*the-stack-pointer-snapshot*", V__the_stack_pointer_snapshot
      xx address$argument_stack

   define_primitive_function "snapshot-the-stack-pointer", snapshot_the_stack_pointer
      ;; << -- >>
      mov eax, [pointer$argument_stack]
      mov [V__the_stack_pointer_snapshot + cell_size], eax
      next

   }
   #+end_src
** set-argument-stack-pointer
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "set-argument-stack-pointer", set_argument_stack_pointer
      ;; << address -- >>
      pop_argument_stack pointer$argument_stack
      next

   }

   match =32bit, machine {

   define_primitive_function "set-argument-stack-pointer", set_argument_stack_pointer
      ;; << address -- >>
      pop_argument_stack rbx
      mov [pointer$argument_stack], rbx
      next

   }
   #+end_src
* bool
** false & true
   * they are defined as function
     and viewed as constant
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "false", false
      ;; << -- false >>
      xor rax, rax
      push_argument_stack rax
      next

   define_primitive_function "true", true
      ;; << -- true >>
      xor rax, rax
      inc rax
      push_argument_stack rax
      next
   #+end_src
** false? & true?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "false?", false?
      ;; << bool -- bool >>
      xx false, equal?
      xx end

   define_function "true?", true?
      ;; << bool -- bool >>
      xx true, equal?
      xx end
   #+end_src
