cicada-nymph.html

<div id="outline-container-org5656ea0" class="outline-3">
<h3 id="org5656ea0">swap</h3>
<div class="outline-text-3" id="text-org5656ea0">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"swap"</span>, swap
   <span style="color: #FF8888;">;; &lt;&lt; a b -- b a &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"x|swap|xx"</span>, xswapxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c -- b c | a &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|swap|x"</span>, xxswapx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c -- c | a b &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   next

define_primitive_function <span style="color: #e6db74;">"x|swap|xxx"</span>, xswapxxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c d -- b c d | a &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rdx</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"xxx|swap|x"</span>, xxxswapx
   <span style="color: #FF8888;">;; &lt;&lt; a b c | d -- d | a b c &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rdx</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   next

define_primitive_function <span style="color: #e6db74;">"xx|swap|xx"</span>, xxswapxx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c d -- c d | a b &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rdx</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   next


define_primitive_function <span style="color: #e6db74;">"x|swap|xxxx"</span>, xswapxxxx
   <span style="color: #FF8888;">;; &lt;&lt; a | b c d e -- b c d e | a &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rsi</span> <span style="color: #FF8888;">;; e</span>
   pop_argument_stack  <span style="color: #fd971f;">rdx</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   push_argument_stack <span style="color: #fd971f;">rsi</span> <span style="color: #FF8888;">;; e</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"xxxx|swap|x"</span>, xxxxswapx
   <span style="color: #FF8888;">;; &lt;&lt; a b c d | e --  e | a b c d &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rsi</span> <span style="color: #FF8888;">;; e</span>
   pop_argument_stack  <span style="color: #fd971f;">rdx</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rsi</span> <span style="color: #FF8888;">;; e</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   next


define_primitive_function <span style="color: #e6db74;">"xx|swap|xxxx"</span>, xxswapxxxx
   <span style="color: #FF8888;">;; &lt;&lt; a b | c d e f -- c d e f | a b &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rsi</span> <span style="color: #FF8888;">;; f</span>
   pop_argument_stack  <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; e</span>
   pop_argument_stack  <span style="color: #fd971f;">rdx</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   push_argument_stack <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; e</span>
   push_argument_stack <span style="color: #fd971f;">rsi</span> <span style="color: #FF8888;">;; f</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   next

define_primitive_function <span style="color: #e6db74;">"xxxx|swap|xx"</span>, xxxxswapxx
   <span style="color: #FF8888;">;; &lt;&lt; a b c d | e f --  e f | a b c d &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rsi</span> <span style="color: #FF8888;">;; f</span>
   pop_argument_stack  <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; e</span>
   pop_argument_stack  <span style="color: #fd971f;">rdx</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   pop_argument_stack  <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; e</span>
   push_argument_stack <span style="color: #fd971f;">rsi</span> <span style="color: #FF8888;">;; f</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   push_argument_stack <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rcx</span>
   push_argument_stack <span style="color: #fd971f;">rdx</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-org81127fe" class="outline-3">
<h3 id="org81127fe">address</h3>
<div class="outline-text-3" id="text-org81127fe">
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"*the-stack*"</span>, V__the_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$argument_stack
</pre>
</div>
</div>
</div>

<div id="outline-container-org350be05" class="outline-3">
<h3 id="org350be05">pointer</h3>
<div class="outline-text-3" id="text-org350be05">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_variable <span style="color: #e6db74;">"*the-stack-pointer-snapshot*"</span>, V__the_stack_pointer_snapshot
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$argument_stack

define_primitive_function <span style="color: #e6db74;">"snapshot-the-stack-pointer"</span>, snapshot_the_stack_pointer
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> [V__the_stack_pointer_snapshot + cell_size], pointer$argument_stack
   next

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

define_variable <span style="color: #e6db74;">"*the-stack-pointer-snapshot*"</span>, V__the_stack_pointer_snapshot
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$argument_stack

define_primitive_function <span style="color: #e6db74;">"snapshot-the-stack-pointer"</span>, snapshot_the_stack_pointer
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">eax</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> [V__the_stack_pointer_snapshot + cell_size], <span style="color: #fd971f;">eax</span>
   next

}
</pre>
</div>
</div>
</div>
