cicada-nymph.org
** equal? & greater-than? & less-than?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "equal?", equal?
      ;; << a, b -- bool >>
      pop_argument_stack rbx
      pop_argument_stack rax
      cmp   rbx, rax
      sete  al
      movzx rax, al
      push_argument_stack rax
      next

   define_primitive_function "less-than?", less_than?
      pop_argument_stack rbx
      pop_argument_stack rax
      cmp   rax, rbx
      setl  al
      movzx rax, al
      push_argument_stack rax
      next

   define_primitive_function "greater-than?", greater_than?
      pop_argument_stack rbx
      pop_argument_stack rax
      cmp   rax, rbx
      setg  al
      movzx rax, al
      push_argument_stack  rax
      next

   define_primitive_function "less-or-equal?", less_or_equal?
      pop_argument_stack rbx
      pop_argument_stack rax
      cmp   rax, rbx
      setle al
      movzx rax, al
      push_argument_stack rax
      next

   define_primitive_function "greater-or-equal?", greater_or_equal?
      pop_argument_stack rbx
      pop_argument_stack rax
      cmp   rax, rbx
      setge al
      movzx rax, al
      push_argument_stack rax
      next
   #+end_src
** equal2?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "equal2?", equal2?
      ;; << a1, b1, a2, b2 -- bool >>
      xx xswapxx
      xx equal?, false?, false?branch, 4
      xx   drop2, false
      xx   end
      xx equal?
      xx end
   #+end_src
** negative? & positive?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "negative?", negative?
      ;; << integer -- bool >>
      xx zero, less_than?
      xx end

   define_function "positive?", positive?
      ;; << integer -- bool >>
      xx zero, greater_than?
      xx end
   #+end_src
** within?
   0 1 2 3 are within 0 3
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "within?", within?
      ;; << x, a, b -- bool >>
      xx xoverxx
      xx greater_or_equal?, CICADA__not, false?branch, 4
      xx   drop2
      xx   false
      xx   end
      xx greater_or_equal?
      xx end
   #+end_src
** test
   #+begin_src cicada-nymph
   : test,within?
     << -- >>
     0 0 3 within? .
     1 0 3 within? .
     2 0 3 within? .
     3 0 3 within? .
     .l
     4 0 3  within? .
     -1 0 3 within? .
     .l
     end
   ; define-function
   test,within?
   #+end_src
** ----------------------------------
* memory
** note get & set
   * although the following functions are all side-effect
     but I use "set" instead of "set!"
   * (get) and (set) default to a cell_size
** note endianness of n-get & n-set
   * big-endian is used
     in memory
     | value-1 |
     | value-2 |
     | value-3 |
     on stack
     << value-1, value-2, value-3 >>
   * thus
     what setd into the address
     will re-occur when geting through the address
   * thus
     I do not implement n-get-byte & n-set-byte
     for the endianness of machine
     might not be big-endian
