cicada-nymph.html


<div id="outline-container-org1b521f6" class="outline-3">
<h3 id="org1b521f6">equal? &amp; greater-than? &amp; less-than?</h3>
<div class="outline-text-3" id="text-org1b521f6">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"equal?"</span>, equal?
   <span style="color: #FF8888;">;; &lt;&lt; a, b -- bool &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">cmp</span>   <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sete</span>  <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">movzx</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">al</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"less-than?"</span>, less_than?
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">cmp</span>   <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">setl</span>  <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">movzx</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">al</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"greater-than?"</span>, greater_than?
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">cmp</span>   <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">setg</span>  <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">movzx</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">al</span>
   push_argument_stack  <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"less-or-equal?"</span>, less_or_equal?
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">cmp</span>   <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">setle</span> <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">movzx</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">al</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"greater-or-equal?"</span>, greater_or_equal?
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">cmp</span>   <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">setge</span> <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">movzx</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">al</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbda9e3" class="outline-3">
<h3 id="orgfbda9e3">equal2?</h3>
<div class="outline-text-3" id="text-orgfbda9e3">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"equal2?"</span>, equal2?
   <span style="color: #FF8888;">;; &lt;&lt; a1, b1, a2, b2 -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xswapxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> equal?, false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c71623" class="outline-3">
<h3 id="org6c71623">negative? &amp; positive?</h3>
<div class="outline-text-3" id="text-org6c71623">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"negative?"</span>, negative?
   <span style="color: #FF8888;">;; &lt;&lt; integer -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> zero, less_than?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"positive?"</span>, positive?
   <span style="color: #FF8888;">;; &lt;&lt; integer -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> zero, greater_than?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org64fa053" class="outline-3">
<h3 id="org64fa053">within?</h3>
<div class="outline-text-3" id="text-org64fa053">
<p>
0 1 2 3 are within 0 3
</p>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"within?"</span>, within?
   <span style="color: #FF8888;">;; &lt;&lt; x, a, b -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xoverxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> greater_or_equal?, CICADA__not, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> greater_or_equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b0c953" class="outline-3">
<h3 id="org8b0c953"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-org8b0c953">
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">test,within?</span>
  <span style="color: #FF8888;">&lt;&lt; -- &gt;&gt;</span>
  <span style="color: #fd971f; font-weight: bold;">0</span> <span style="color: #fd971f; font-weight: bold;">0</span> <span style="color: #fd971f; font-weight: bold;">3</span> <span style="color: #ffffff; font-weight: bold;">within?</span> .
  <span style="color: #fd971f; font-weight: bold;">1</span> <span style="color: #fd971f; font-weight: bold;">0</span> <span style="color: #fd971f; font-weight: bold;">3</span> <span style="color: #ffffff; font-weight: bold;">within?</span> .
  <span style="color: #fd971f; font-weight: bold;">2</span> <span style="color: #fd971f; font-weight: bold;">0</span> <span style="color: #fd971f; font-weight: bold;">3</span> <span style="color: #ffffff; font-weight: bold;">within?</span> .
  <span style="color: #fd971f; font-weight: bold;">3</span> <span style="color: #fd971f; font-weight: bold;">0</span> <span style="color: #fd971f; font-weight: bold;">3</span> <span style="color: #ffffff; font-weight: bold;">within?</span> .
  .l
  <span style="color: #fd971f; font-weight: bold;">4</span> <span style="color: #fd971f; font-weight: bold;">0</span> <span style="color: #fd971f; font-weight: bold;">3</span>  <span style="color: #ffffff; font-weight: bold;">within?</span> .
  <span style="color: #fd971f; font-weight: bold;">-1</span> <span style="color: #fd971f; font-weight: bold;">0</span> <span style="color: #fd971f; font-weight: bold;">3</span> <span style="color: #ffffff; font-weight: bold;">within?</span> .
  .l
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #ffffff; font-weight: bold;">test,within?</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org7325ce4" class="outline-2">
<h2 id="org7325ce4">memory</h2>
<div class="outline-text-2" id="text-org7325ce4">
</div><div id="outline-container-org3193e62" class="outline-3">
<h3 id="org3193e62"><span class="todo note">note</span> get &amp; set</h3>
<div class="outline-text-3" id="text-org3193e62">
<ul class="org-ul">
<li><p>although the following functions are all side-effect</p><p>but I use "set" instead of "set!"</p></li>
<li><p>(get) and (set) default to a cell_size</p></li></ul>
</div>
</div>

<div id="outline-container-org2ea6378" class="outline-3">
<h3 id="org2ea6378"><span class="todo note">note</span> endianness of n-get &amp; n-set</h3>
<div class="outline-text-3" id="text-org2ea6378">
<ul class="org-ul">
<li><p><p></p><p>big-endian is used</p><p>in memory</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></colgroup></p><p><tbody></p><p><tr></p><p><td class="org-left">value-1</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">value-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">value-3</td></p><p></tr></p><p></tbody></p><p></table></p><p><p></p><p>on stack</p><p>&lt;&lt; value-1, value-2, value-3 &gt;&gt;</p><p></p></p></li>
<li><p>thus</p><p>what setd into the address</p><p>will re-occur when geting through the address</p></li>
<li><p>thus</p><p>I do not implement n-get-byte &amp; n-set-byte</p><p>for the endianness of machine</p><p>might not be big-endian</p></li></ul>
</div>
</div>
