cicada-nymph.html

<div id="outline-container-org3c101e2" class="outline-3">
<h3 id="org3c101e2">get&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-org3c101e2">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"get"</span>, get
   <span style="color: #FF8888;">;; ( address -- value )</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"get-byte"</span>, get_byte
   <span style="color: #FF8888;">;; ( address -- value )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">xor</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">al</span>, <span style="color: #66d9ef; font-weight: bold;">byte</span>[<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"get-two-bytes"</span>, get_two_bytes
   <span style="color: #FF8888;">;; ( address -- value )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">xor</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">ax</span>, <span style="color: #66d9ef; font-weight: bold;">word</span> [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"get-four-bytes"</span>, get_four_bytes
   <span style="color: #FF8888;">;; ( address -- value )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">xor</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">eax</span>, <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"n-get"</span>, n_get
   <span style="color: #FF8888;">;; &lt;&lt; address, n -- value-1, ..., value-n &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rdx</span>
<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rdx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rdx</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd01e4" class="outline-3">
<h3 id="orgcd01e4">set&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-orgcd01e4">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"set"</span>, set
   <span style="color: #FF8888;">;; ( value, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"set-byte"</span>, set_byte
   <span style="color: #FF8888;">;; ( value, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">byte</span>[<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">al</span>
   next

define_primitive_function <span style="color: #e6db74;">"set-two-bytes"</span>, set_two_bytes
   <span style="color: #FF8888;">;; ( value, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">word</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">ax</span>
   next

define_primitive_function <span style="color: #e6db74;">"set-four-bytes"</span>, set_four_bytes
   <span style="color: #FF8888;">;; ( value, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">eax</span>
   next

define_primitive_function <span style="color: #e6db74;">"n-set"</span>, n_set
   <span style="color: #FF8888;">;; &lt;&lt; value-n, ..., value-1, address, n -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rdx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, cell_size
   <span style="color: #a6e22e;">imul</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rcx</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rdx</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #FF8888;">;; for address is based on 0</span>
   <span style="color: #FF8888;">;; but n is based on 1</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rdx</span>, cell_size
<span style="color: #a6e22e;">.loop</span>:
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rdx</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rdx</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

define_primitive_function <span style="color: #e6db74;">"add-set"</span>, add_set
   <span style="color: #FF8888;">;; ( number to add, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"sub-set"</span>, sub_set
   <span style="color: #FF8888;">;; ( number to sub, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6dde778" class="outline-3">
<h3 id="org6dde778">get&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org6dde778">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"get"</span>, get
   <span style="color: #FF8888;">;; ( address -- value )</span>
   pop_argument_stack  <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"get-byte"</span>, get_byte
   <span style="color: #FF8888;">;; ( address -- value )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">xor</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">al</span>, <span style="color: #66d9ef; font-weight: bold;">byte</span>[<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"get-two-bytes"</span>, get_two_bytes
   <span style="color: #FF8888;">;; ( address -- value )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">xor</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">ax</span>, <span style="color: #66d9ef; font-weight: bold;">word</span> [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"get-four-bytes"</span>, get_four_bytes
   <span style="color: #FF8888;">;; ( address -- value )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">xor</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">eax</span>, <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"n-get"</span>, n_get
   <span style="color: #FF8888;">;; &lt;&lt; address, n -- value-1, ..., value-n &gt;&gt;</span>
   pop_argument_stack  <span style="color: #fd971f;">rcx</span>
   pop_argument_stack  <span style="color: #fd971f;">rdx</span>
<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rdx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rdx</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

}
</pre>
</div>
</div>
</div>
