cicada-nymph.org
** set                                :32bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =32bit, machine {

   define_primitive_function "set", set
      ;; ( value, address -- )
      pop_argument_stack rbx
      pop_argument_stack rax
      mov [rbx], rax
      next

   define_primitive_function "set-byte", set_byte
      ;; ( value, address -- )
      pop_argument_stack rbx
      pop_argument_stack rax
      mov byte[rbx], al
      next

   define_primitive_function "set-two-bytes", set_two_bytes
      ;; ( value, address -- )
      pop_argument_stack rbx
      pop_argument_stack rax
      mov word [rbx], ax
      next

   define_primitive_function "set-four-bytes", set_four_bytes
      ;; ( value, address -- )
      pop_argument_stack rbx
      pop_argument_stack rax
      mov dword [rbx], eax
      next

   define_primitive_function "n-set", n_set
      ;; << value-n, ..., value-1, address, n -- >>
      pop_argument_stack rcx
      pop_argument_stack rdx
      mov rax, cell_size
      imul rax, rcx
      add rdx, rax
      ;; for address is based on 0
      ;; but n is based on 1
      sub rdx, cell_size
   .loop:
      pop_argument_stack rax
      mov dword [rdx], rax
      sub rdx, cell_size
      loop .loop
      next

   define_primitive_function "add-set", add_set
      ;; ( number to add, address -- )
      pop_argument_stack rbx
      pop_argument_stack rax
      add dword [rbx], rax
      next

   define_primitive_function "sub-set", sub_set
      ;; ( number to sub, address -- )
      pop_argument_stack rbx
      pop_argument_stack rax
      sub dword [rbx], rax
      next

   }
   #+end_src
** clear
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "clear-memory", clear_memory
      ;; << size, address -- >>
      pop_argument_stack rdx
      pop_argument_stack rcx
      xor rax, rax
   .loop:
      mov byte [rdx], al
      inc rdx
      dec rcx
      loop .loop
      next
   #+end_src
* bit
** note
   * xor a.k.a. diff
** or & and & xor & invert            :64bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "bit-and", bit_and
      ;; << a, b -- a and b >>
      pop_argument_stack rbx
      and [pointer$argument_stack - (1 * cell_size)], rbx
      next

   define_primitive_function "bit-or", bit_or
      ;; << a, b -- a or b >>
      pop_argument_stack rbx
      or  [pointer$argument_stack - (1 * cell_size)], rbx
      next

   define_primitive_function "bit-xor", bit_xor
      ;; << a, b -- a xor b >>
      pop_argument_stack rbx
      xor [pointer$argument_stack - (1 * cell_size)], rbx
      next

   define_primitive_function "bit-invert", bit_invert
      ;; << a -- invert a >>
      not qword [pointer$argument_stack - (1 * cell_size)]
      next

   }
   #+end_src
** or & and & xor & invert            :32bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =32bit, machine {

   define_primitive_function "bit-and", bit_and
      ;; << a, b -- a and b >>
      pop_argument_stack rbx
      mov rax, [pointer$argument_stack]
      and [rax - (1 * cell_size)], rbx
      next

   define_primitive_function "bit-or", bit_or
      ;; << a, b -- a or b >>
      pop_argument_stack rbx
      mov rax, [pointer$argument_stack]
      or  [rax - (1 * cell_size)], rbx
      next

   define_primitive_function "bit-xor", bit_xor
      ;; << a, b -- a xor b >>
      pop_argument_stack rbx
      mov rax, [pointer$argument_stack]
      xor [rax - (1 * cell_size)], rbx
      next

   define_primitive_function "bit-invert", bit_invert
      ;; << a -- invert a >>
      mov rax, [pointer$argument_stack]
      not dword [rax - (1 * cell_size)]
      next

   }
   #+end_src
