cicada-nymph.html

<div id="outline-container-org9a6bad1" class="outline-3">
<h3 id="org9a6bad1">set&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org9a6bad1">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"set"</span>, set
   <span style="color: #FF8888;">;; ( value, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"set-byte"</span>, set_byte
   <span style="color: #FF8888;">;; ( value, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">byte</span>[<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">al</span>
   next

define_primitive_function <span style="color: #e6db74;">"set-two-bytes"</span>, set_two_bytes
   <span style="color: #FF8888;">;; ( value, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">word</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">ax</span>
   next

define_primitive_function <span style="color: #e6db74;">"set-four-bytes"</span>, set_four_bytes
   <span style="color: #FF8888;">;; ( value, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">eax</span>
   next

define_primitive_function <span style="color: #e6db74;">"n-set"</span>, n_set
   <span style="color: #FF8888;">;; &lt;&lt; value-n, ..., value-1, address, n -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rdx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, cell_size
   <span style="color: #a6e22e;">imul</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rcx</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rdx</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #FF8888;">;; for address is based on 0</span>
   <span style="color: #FF8888;">;; but n is based on 1</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rdx</span>, cell_size
<span style="color: #a6e22e;">.loop</span>:
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rdx</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rdx</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

define_primitive_function <span style="color: #e6db74;">"add-set"</span>, add_set
   <span style="color: #FF8888;">;; ( number to add, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"sub-set"</span>, sub_set
   <span style="color: #FF8888;">;; ( number to sub, address -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5984fca" class="outline-3">
<h3 id="org5984fca">clear</h3>
<div class="outline-text-3" id="text-org5984fca">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"clear-memory"</span>, clear_memory
   <span style="color: #FF8888;">;; &lt;&lt; size, address -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rdx</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   <span style="color: #a6e22e;">xor</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">byte</span> [<span style="color: #fd971f;">rdx</span>], <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">inc</span> <span style="color: #fd971f;">rdx</span>
   <span style="color: #a6e22e;">dec</span> <span style="color: #fd971f;">rcx</span>
   <span style="color: #a6e22e;">loop</span> .loop
   next
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org69bb1f1" class="outline-2">
<h2 id="org69bb1f1">bit</h2>
<div class="outline-text-2" id="text-org69bb1f1">
</div><div id="outline-container-org5c163de" class="outline-3">
<h3 id="org5c163de"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-org5c163de">
<ul class="org-ul">
<li><p>xor a.k.a. diff</p></li></ul>
</div>
</div>

<div id="outline-container-org6cbd36c" class="outline-3">
<h3 id="org6cbd36c">or &amp; and &amp; xor &amp; invert&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-org6cbd36c">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"bit-and"</span>, bit_and
   <span style="color: #FF8888;">;; &lt;&lt; a, b -- a and b &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">and</span> [pointer$argument_stack - (<span style="color: #ae81ff;">1</span> * cell_size)], <span style="color: #fd971f;">rbx</span>
   next

define_primitive_function <span style="color: #e6db74;">"bit-or"</span>, bit_or
   <span style="color: #FF8888;">;; &lt;&lt; a, b -- a or b &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">or</span>  [pointer$argument_stack - (<span style="color: #ae81ff;">1</span> * cell_size)], <span style="color: #fd971f;">rbx</span>
   next

define_primitive_function <span style="color: #e6db74;">"bit-xor"</span>, bit_xor
   <span style="color: #FF8888;">;; &lt;&lt; a, b -- a xor b &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">xor</span> [pointer$argument_stack - (<span style="color: #ae81ff;">1</span> * cell_size)], <span style="color: #fd971f;">rbx</span>
   next

define_primitive_function <span style="color: #e6db74;">"bit-invert"</span>, bit_invert
   <span style="color: #FF8888;">;; &lt;&lt; a -- invert a &gt;&gt;</span>
   <span style="color: #a6e22e;">not</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [pointer$argument_stack - (<span style="color: #ae81ff;">1</span> * cell_size)]
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org216c4a9" class="outline-3">
<h3 id="org216c4a9">or &amp; and &amp; xor &amp; invert&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org216c4a9">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"bit-and"</span>, bit_and
   <span style="color: #FF8888;">;; &lt;&lt; a, b -- a and b &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">and</span> [<span style="color: #fd971f;">rax</span> - (<span style="color: #ae81ff;">1</span> * cell_size)], <span style="color: #fd971f;">rbx</span>
   next

define_primitive_function <span style="color: #e6db74;">"bit-or"</span>, bit_or
   <span style="color: #FF8888;">;; &lt;&lt; a, b -- a or b &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">or</span>  [<span style="color: #fd971f;">rax</span> - (<span style="color: #ae81ff;">1</span> * cell_size)], <span style="color: #fd971f;">rbx</span>
   next

define_primitive_function <span style="color: #e6db74;">"bit-xor"</span>, bit_xor
   <span style="color: #FF8888;">;; &lt;&lt; a, b -- a xor b &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">xor</span> [<span style="color: #fd971f;">rax</span> - (<span style="color: #ae81ff;">1</span> * cell_size)], <span style="color: #fd971f;">rbx</span>
   next

define_primitive_function <span style="color: #e6db74;">"bit-invert"</span>, bit_invert
   <span style="color: #FF8888;">;; &lt;&lt; a -- invert a &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">not</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [<span style="color: #fd971f;">rax</span> - (<span style="color: #ae81ff;">1</span> * cell_size)]
   next

}
</pre>
</div>
</div>
</div>
