cicada-nymph.org
** left & right[,sign]
   * "shl"
     shifts the destination operand left
     by the number of bits specified in the second operand
     The destination operand can be general register or memory
     The second operand can be an immediate value or the CL register
     as bits exit from the left, zeros in from the right
     The last bit that exited is stored in CF
     "sal" is a synonym for "shl"
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "bit-left", bit_left
      ;; ( fixnum, step -- fixnum * 2^step )
      pop_argument_stack rcx
      pop_argument_stack rax
      shl rax, cl
      push_argument_stack rax
      next

   define_primitive_function "bit-right", bit_right
      ;; ( fixnum, step -- fixnum / 2^step )
      pop_argument_stack rcx
      pop_argument_stack rax
      shr rax, cl
      push_argument_stack rax
      next

   define_primitive_function "bit-right,sign", bit_right__sign
      ;; ( fixnum, step -- new fixnum )
      pop_argument_stack rcx
      pop_argument_stack rax
      sar rax, cl
      push_argument_stack rax
      next
   #+end_src
** get & set & clear & invert
   1. offset is of LSB
   2. offset in [0, ..., 63]
   3. step   in [1, ..., 64]
   4. >< need error handling on them
   #+begin_src fasm :tangle cicada-nymph.fasm
   ;; BT copies a bit from a given register to the carry flag
   define_primitive_function "get-bit", get_bit
      ;; ( fixnum, offset -- bit )
      pop_argument_stack rbx
      pop_argument_stack rax
      bt rax, rbx
      setc al
      movzx rax, al
      push_argument_stack rax
      next

   define_primitive_function "set-bit", set_bit
      ;; ( fixnum, offset -- fixnum )
      pop_argument_stack rbx
      pop_argument_stack rax
      bts rax, rbx
      push_argument_stack rax
      next

   define_primitive_function "clear-bit", clear_bit
      ;; ( fixnum, offset -- fixnum )
      pop_argument_stack rbx
      pop_argument_stack rax
      btr rax, rbx
      push_argument_stack rax
      next

   define_primitive_function "invert-bit", invert_bit
      ;; ( fixnum, offset -- fixnum )
      pop_argument_stack rbx
      pop_argument_stack rax
      btc rax, rbx
      push_argument_stack rax
      next
   #+end_src
** find-[lowest|highest]-set-bit
   * "bsf" "bsr"
     instructions scan a word or double word for first set bit
     and store the index of this bit into destination operand
     which must be general register
     The bit string being scanned is specified by source operand
     it may be either general register or memory
     The ZF flag is set if the entire string is zero (no set bits are found)
     otherwise it is cleared
   * If no set bit is found
     the value of the destination register is undefined
     "bsf" scans from low order to high order (starting from bit index zero)
     "bsr" scans from high order to low order
   * note that
     if can not find set-bit
     the following functions will return -1
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "find-lowest-set-bit", find_lowest_set_bit
      ;; ( fixnum -- offset )
      pop_argument_stack rax
      bsf rax, rax
      jz @f
      push_argument_stack rax
      next
   @@:
      mov rax, -1
      push_argument_stack rax
      next

   define_primitive_function "find-highest-set-bit", find_highest_set_bit
      ;; ( fixnum -- offset )
      pop_argument_stack rax
      bsr rax, rax
      jz @f
      push_argument_stack rax
      next
   @@:
      mov rax, -1
      push_argument_stack rax
      next
   #+end_src
