cicada-nymph.html

<div id="outline-container-org97d44dd" class="outline-3">
<h3 id="org97d44dd">left &amp; right[,sign]</h3>
<div class="outline-text-3" id="text-org97d44dd">
<ul class="org-ul">
<li><p>"shl"</p><p>shifts the destination operand left</p><p>by the number of bits specified in the second operand</p><p>The destination operand can be general register or memory</p><p>The second operand can be an immediate value or the CL register</p><p>as bits exit from the left, zeros in from the right</p><p>The last bit that exited is stored in CF</p><p>"sal" is a synonym for "shl"</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"bit-left"</span>, bit_left
   <span style="color: #FF8888;">;; ( fixnum, step -- fixnum * 2^step )</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">shl</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">cl</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"bit-right"</span>, bit_right
   <span style="color: #FF8888;">;; ( fixnum, step -- fixnum / 2^step )</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">shr</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">cl</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"bit-right,sign"</span>, bit_right__sign
   <span style="color: #FF8888;">;; ( fixnum, step -- new fixnum )</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sar</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">cl</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd2a178" class="outline-3">
<h3 id="orgcd2a178">get &amp; set &amp; clear &amp; invert</h3>
<div class="outline-text-3" id="text-orgcd2a178">
<ol class="org-ol">
<li>offset is of LSB</li>
<li>offset in [0, &#x2026;, 63]</li>
<li>step   in [1, &#x2026;, 64]</li>
<li>&gt;&lt; need error handling on them</li></ol>
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #FF8888;">;; BT copies a bit from a given register to the carry flag</span>
define_primitive_function <span style="color: #e6db74;">"get-bit"</span>, get_bit
   <span style="color: #FF8888;">;; ( fixnum, offset -- bit )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">bt</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">setc</span> <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">movzx</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">al</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"set-bit"</span>, set_bit
   <span style="color: #FF8888;">;; ( fixnum, offset -- fixnum )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">bts</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"clear-bit"</span>, clear_bit
   <span style="color: #FF8888;">;; ( fixnum, offset -- fixnum )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">btr</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"invert-bit"</span>, invert_bit
   <span style="color: #FF8888;">;; ( fixnum, offset -- fixnum )</span>
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">btc</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rbx</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-org77ef079" class="outline-3">
<h3 id="org77ef079">find-[lowest|highest]-set-bit</h3>
<div class="outline-text-3" id="text-org77ef079">
<ul class="org-ul">
<li><p>"bsf" "bsr"</p><p>instructions scan a word or double word for first set bit</p><p>and store the index of this bit into destination operand</p><p>which must be general register</p><p>The bit string being scanned is specified by source operand</p><p>it may be either general register or memory</p><p>The ZF flag is set if the entire string is zero (no set bits are found)</p><p>otherwise it is cleared</p></li>
<li><p>If no set bit is found</p><p>the value of the destination register is undefined</p><p>"bsf" scans from low order to high order (starting from bit index zero)</p><p>"bsr" scans from high order to low order</p></li>
<li><p>note that</p><p>if can not find set-bit</p><p>the following functions will return -1</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"find-lowest-set-bit"</span>, find_lowest_set_bit
   <span style="color: #FF8888;">;; ( fixnum -- offset )</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">bsf</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">jz</span> @f
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next
<span style="color: #a6e22e;">@@</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, -<span style="color: #ae81ff;">1</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"find-highest-set-bit"</span>, find_highest_set_bit
   <span style="color: #FF8888;">;; ( fixnum -- offset )</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">bsr</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">jz</span> @f
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next
<span style="color: #a6e22e;">@@</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, -<span style="color: #ae81ff;">1</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next
</pre>
</div>
</div>
</div>
