cicada-nymph.org
** test
   * test is written in cicada-nymph
     for these primitive-functions are added lately
   #+begin_src cicada-nymph
   2#10011001 2#01100110 bit-or  .#2
   2#10011001 2#01100110 bit-and .#2
   2#10011001 2#11111111 bit-xor .#2
   2#10011001 2#10011001 bit-xor .#2

   2#10011001 4 bit-left  .#2
   2#10011001 4 bit-right .#2
   2#-10011001 4 bit-right,sign .#2

   2#10011001 0 get-bit .
   2#10011001 1 get-bit .
   2#10011001 2 get-bit .
   2#10011001 3 get-bit .

   2#10011001 0 clear-bit .#2
   2#10011001 1 set-bit   .#2
   2#10011001 2 set-bit   .#2
   2#10011001 3 clear-bit .#2

   2#10011001 0 invert-bit .#2
   2#10011001 1 invert-bit .#2
   2#10011001 2 invert-bit .#2
   2#10011001 3 invert-bit .#2

   2#10011000 find-lowest-set-bit
   2#10011000 find-highest-set-bit

   2#00000000 find-lowest-set-bit
   2#00000000 find-highest-set-bit
   #+end_src
* write-byte
** write-byte                         :64bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   buffer$write_byte:
      db 0

   define_primitive_function "write-byte", write_byte
      ;; << byte -- >>
      pop_argument_stack rax
      ;; write can not just write the byte in al to stdout
      ;; write needs the address of the byte to write
      mov [buffer$write_byte], al
      mov linux64_sys_3_rdx, 1                 ;; max length to be write
      mov linux64_sys_2_rsi, buffer$write_byte ;; address
      mov linux64_sys_1_rdi, 1                 ;; stdout
      mov linux64_sys_n_rax, linux64_syscall_write
      syscall
      next

   }
   #+end_src
** write-byte                         :32bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =32bit, platform machine {

   buffer$write_byte:
      db 0

   define_primitive_function "write-byte", write_byte
      ;; << byte -- >>
      ;; just calls the Linux write system call
      pop_argument_stack rax
      ;; write can not just write the byte in al to stdout
      ;; write needs the address of the byte to write
      mov [buffer$write_byte], al
      mov linux32_sys_3_edx, 1                 ;; max length to be write
      mov linux32_sys_2_ecx, buffer$write_byte ;; address
      mov linux32_sys_1_ebx, 1                 ;; stdout
      mov linux32_sys_n_eax, linux32_syscall_write
      syscall
      next

   }
   #+end_src
* reading-stack
** note
   * for we do not build border-check
     into the interface of pop and push
     we allocation some memory below the stacks
   * (read-byte) only sees the tos of reading-stack
   * reading-stack helps to implement (eval-string)
     push and pop of reading-stack happens in the function (eval-string)
   * the interface action on string
     i.e. two values
** memory allocation
   #+begin_src fasm :tangle cicada-nymph.fasm
   size$reading_stack = 1024 * cell_size

      preserve 64 * cell_size
   address$reading_stack labeling
      preserve size$reading_stack

   define_variable "reading-stack:*pointer*", V__reading_stack__pointer
      xx address$reading_stack
   #+end_src
