cicada-nymph.html

<div id="outline-container-orgac93810" class="outline-3">
<h3 id="orgac93810"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-orgac93810">
<ul class="org-ul">
<li><p>test is written in cicada-nymph</p><p>for these primitive-functions are added lately</p></li></ul>
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">01100110</span> bit-or  .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">01100110</span> bit-and .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">11111111</span> bit-xor .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> bit-xor .#2

<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">4</span> bit-left  .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">4</span> bit-right .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">-10011001</span> <span style="color: #fd971f; font-weight: bold;">4</span> bit-right,sign .#2

<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">0</span> get-bit .
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">1</span> get-bit .
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">2</span> get-bit .
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">3</span> get-bit .

<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">0</span> clear-bit .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">1</span> set-bit   .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">2</span> set-bit   .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">3</span> clear-bit .#2

<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">0</span> invert-bit .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">1</span> invert-bit .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">2</span> invert-bit .#2
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011001</span> <span style="color: #fd971f; font-weight: bold;">3</span> invert-bit .#2

<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011000</span> find-lowest-set-bit
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">10011000</span> find-highest-set-bit

<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">00000000</span> find-lowest-set-bit
<span style="color: #fd971f; font-weight: bold;">2</span><span style="color: #ffff00;">#</span><span style="color: #fd971f; font-weight: bold;">00000000</span> find-highest-set-bit
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc0355d9" class="outline-2">
<h2 id="orgc0355d9">write-byte</h2>
<div class="outline-text-2" id="text-orgc0355d9">
</div><div id="outline-container-org5d7a8f9" class="outline-3">
<h3 id="org5d7a8f9">write-byte&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org5d7a8f9">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

<span style="color: #a6e22e;">buffer$write_byte</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #ae81ff;">0</span>

define_primitive_function <span style="color: #e6db74;">"write-byte"</span>, write_byte
   <span style="color: #FF8888;">;; &lt;&lt; byte -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #FF8888;">;; write can not just write the byte in al to stdout</span>
   <span style="color: #FF8888;">;; write needs the address of the byte to write</span>
   <span style="color: #a6e22e;">mov</span> [buffer$write_byte], <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">mov</span> linux64_sys_3_rdx, <span style="color: #ae81ff;">1</span>                 <span style="color: #FF8888;">;; max length to be write</span>
   <span style="color: #a6e22e;">mov</span> linux64_sys_2_rsi, buffer$write_byte <span style="color: #FF8888;">;; address</span>
   <span style="color: #a6e22e;">mov</span> linux64_sys_1_rdi, <span style="color: #ae81ff;">1</span>                 <span style="color: #FF8888;">;; stdout</span>
   <span style="color: #a6e22e;">mov</span> linux64_sys_n_rax, linux64_syscall_write
   <span style="color: #a6e22e;">syscall</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb063a31" class="outline-3">
<h3 id="orgb063a31">write-byte&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-orgb063a31">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

<span style="color: #a6e22e;">buffer$write_byte</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #ae81ff;">0</span>

define_primitive_function <span style="color: #e6db74;">"write-byte"</span>, write_byte
   <span style="color: #FF8888;">;; &lt;&lt; byte -- &gt;&gt;</span>
   <span style="color: #FF8888;">;; just calls the Linux write system call</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #FF8888;">;; write can not just write the byte in al to stdout</span>
   <span style="color: #FF8888;">;; write needs the address of the byte to write</span>
   <span style="color: #a6e22e;">mov</span> [buffer$write_byte], <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">mov</span> linux32_sys_3_edx, <span style="color: #ae81ff;">1</span>                 <span style="color: #FF8888;">;; max length to be write</span>
   <span style="color: #a6e22e;">mov</span> linux32_sys_2_ecx, buffer$write_byte <span style="color: #FF8888;">;; address</span>
   <span style="color: #a6e22e;">mov</span> linux32_sys_1_ebx, <span style="color: #ae81ff;">1</span>                 <span style="color: #FF8888;">;; stdout</span>
   <span style="color: #a6e22e;">mov</span> linux32_sys_n_eax, linux32_syscall_write
   <span style="color: #a6e22e;">syscall</span>
   next

}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcbd72a1" class="outline-2">
<h2 id="orgcbd72a1">reading-stack</h2>
<div class="outline-text-2" id="text-orgcbd72a1">
</div><div id="outline-container-org4d3f530" class="outline-3">
<h3 id="org4d3f530"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-org4d3f530">
<ul class="org-ul">
<li><p>for we do not build border-check</p><p>into the interface of pop and push</p><p>we allocation some memory below the stacks</p></li>
<li><p>(read-byte) only sees the tos of reading-stack</p></li>
<li><p>reading-stack helps to implement (eval-string)</p><p>push and pop of reading-stack happens in the function (eval-string)</p></li>
<li><p>the interface action on string</p><p>i.e. two values</p></li></ul>
</div>
</div>

<div id="outline-container-orgd655150" class="outline-3">
<h3 id="orgd655150">memory allocation</h3>
<div class="outline-text-3" id="text-orgd655150">
<div class="org-src-container">

<pre class="src src-fasm">size$reading_stack = <span style="color: #ae81ff;">1024</span> * cell_size

   <span style="color: #66d9ef; font-weight: bold;">preserve</span> <span style="color: #ae81ff;">64</span> * cell_size
address$reading_stack <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> size$reading_stack

define_variable <span style="color: #e6db74;">"reading-stack:*pointer*"</span>, V__reading_stack__pointer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$reading_stack
</pre>
</div>
</div>
</div>
