cicada-nymph.org
** push & pop & drop                  :64bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "push-reading-stack", push_reading_stack
      ;; << string[address, length] -- >>
      pop_argument_stack rax
      mov rbx, [V__reading_stack__pointer + cell_size]
      mov [rbx], rax
      add qword [V__reading_stack__pointer + cell_size], cell_size
      pop_argument_stack rax
      mov rbx, [V__reading_stack__pointer + cell_size]
      mov [rbx], rax
      add qword [V__reading_stack__pointer + cell_size], cell_size
      next

   define_primitive_function "pop-reading-stack", pop_reading_stack
      ;; << -- string[address, length] >>
      sub qword [V__reading_stack__pointer + cell_size], cell_size
      mov rbx, [V__reading_stack__pointer + cell_size]
      mov rax, [rbx]
      push_argument_stack rax
      sub qword [V__reading_stack__pointer + cell_size], cell_size
      mov rbx, [V__reading_stack__pointer + cell_size]
      mov rax, [rbx]
      push_argument_stack rax
      next

   define_primitive_function "drop-reading-stack", drop_reading_stack
      ;; << -- >>
      sub qword [V__reading_stack__pointer + cell_size], (cell_size * 2)
      next

   }
   #+end_src
** push & pop & drop                  :32bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =32bit, machine {

   define_primitive_function "push-reading-stack", push_reading_stack
      ;; << string[address, length] -- >>
      pop_argument_stack rax
      mov rsi, [V__reading_stack__pointer + cell_size]
      mov [rsi], rax
      add dword [V__reading_stack__pointer + cell_size], cell_size
      pop_argument_stack rax
      mov rsi, [V__reading_stack__pointer + cell_size]
      mov [rsi], rax
      add dword [V__reading_stack__pointer + cell_size], cell_size
      next

   define_primitive_function "pop-reading-stack", pop_reading_stack
      ;; << -- string[address, length] >>
      sub dword [V__reading_stack__pointer + cell_size], cell_size
      mov rsi, [V__reading_stack__pointer + cell_size]
      mov rax, [rsi]
      push_argument_stack rax
      sub dword [V__reading_stack__pointer + cell_size], cell_size
      mov rsi, [V__reading_stack__pointer + cell_size]
      mov rax, [rsi]
      push_argument_stack rax
      next

   define_primitive_function "drop-reading-stack", drop_reading_stack
      ;; << -- >>
      sub dword [V__reading_stack__pointer + cell_size], (cell_size * 2)
      next

   }
   #+end_src
** tos
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "tos-reading-stack", tos_reading_stack
      ;; << -- string[address, length] >>
      mov rbx, [V__reading_stack__pointer + cell_size]
      sub rbx, cell_size
      mov rax, [rbx]
      push_argument_stack rax
      mov rbx, [V__reading_stack__pointer + cell_size]
      sub rbx, cell_size
      sub rbx, cell_size
      mov rax, [rbx]
      push_argument_stack rax
      next
   #+end_src
** reading-stack-empty?
   * only one string is in reading-stack and it length is zero
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "reading-stack-empty?", reading_stack_empty?
      ;; << -- bool >>
      xx literal, V__reading_stack__pointer + cell_size, get
      xx literal, address$reading_stack
      xx equal?
      xx end
   #+end_src
* read-byte
** note end of file
   * do not exit the program
     when meeting <end-of-file>
     so
     when you hit <C-d>
     some you will not exit the interpreter
** note factoring
   * reading from file of stdin is slow
     thus
     1. when reading from file
        a whole file is readed at a time
        and setd to a buffer
     2. when reading from stdin
        a whole line is readed at a time
     3. note that
        reading line instead of keyboard-code
        will limit the design of the user interface
   * by factoring out the low-level calls
     that read a line from stdin
     we are able to implement eval-string easily
** read-line-from-stdin               :64bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   define_primitive_function "read-line-from-stdin", read_line_from_stdin
      ;; << buffer address, max length -- counter >>
      pop_argument_stack linux64_sys_3_rdx
      pop_argument_stack linux64_sys_2_rsi
      xor linux64_sys_1_rdi, linux64_sys_1_rdi ;; stdin
      mov linux64_sys_n_rax, linux64_syscall_read
      syscall
      ;; the return value
      ;; is a count of the number of bytes transferred
      push_argument_stack rax
      next

   }
   #+end_src
