cicada-nymph.html

<div id="outline-container-org79c80a9" class="outline-3">
<h3 id="org79c80a9">push &amp; pop &amp; drop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-org79c80a9">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"push-reading-stack"</span>, push_reading_stack
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [V__reading_stack__pointer + cell_size], cell_size
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [V__reading_stack__pointer + cell_size], cell_size
   next

define_primitive_function <span style="color: #e6db74;">"pop-reading-stack"</span>, pop_reading_stack
   <span style="color: #FF8888;">;; &lt;&lt; -- string[address, length] &gt;&gt;</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [V__reading_stack__pointer + cell_size], cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [V__reading_stack__pointer + cell_size], cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"drop-reading-stack"</span>, drop_reading_stack
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #66d9ef; font-weight: bold;">qword</span> [V__reading_stack__pointer + cell_size], (cell_size * <span style="color: #ae81ff;">2</span>)
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org27a939c" class="outline-3">
<h3 id="org27a939c">push &amp; pop &amp; drop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org27a939c">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"push-reading-stack"</span>, push_reading_stack
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">rsi</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [V__reading_stack__pointer + cell_size], cell_size
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">rsi</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [V__reading_stack__pointer + cell_size], cell_size
   next

define_primitive_function <span style="color: #e6db74;">"pop-reading-stack"</span>, pop_reading_stack
   <span style="color: #FF8888;">;; &lt;&lt; -- string[address, length] &gt;&gt;</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [V__reading_stack__pointer + cell_size], cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rsi</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [V__reading_stack__pointer + cell_size], cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rsi</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

define_primitive_function <span style="color: #e6db74;">"drop-reading-stack"</span>, drop_reading_stack
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #66d9ef; font-weight: bold;">dword</span> [V__reading_stack__pointer + cell_size], (cell_size * <span style="color: #ae81ff;">2</span>)
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc6273aa" class="outline-3">
<h3 id="orgc6273aa">tos</h3>
<div class="outline-text-3" id="text-orgc6273aa">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"tos-reading-stack"</span>, tos_reading_stack
   <span style="color: #FF8888;">;; &lt;&lt; -- string[address, length] &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rbx</span>, cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [V__reading_stack__pointer + cell_size]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rbx</span>, cell_size
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rbx</span>, cell_size
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-org3df3f05" class="outline-3">
<h3 id="org3df3f05">reading-stack-empty?</h3>
<div class="outline-text-3" id="text-org3df3f05">
<ul class="org-ul">
<li><p>only one string is in reading-stack and it length is zero</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"reading-stack-empty?"</span>, reading_stack_empty?
   <span style="color: #FF8888;">;; &lt;&lt; -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, V__reading_stack__pointer + cell_size, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, address$reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span> equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc07c3f9" class="outline-2">
<h2 id="orgc07c3f9">read-byte</h2>
<div class="outline-text-2" id="text-orgc07c3f9">
</div><div id="outline-container-orgee0832" class="outline-3">
<h3 id="orgee0832"><span class="todo note">note</span> end of file</h3>
<div class="outline-text-3" id="text-orgee0832">
<ul class="org-ul">
<li><p>do not exit the program</p><p>when meeting &lt;end-of-file&gt;</p><p>so</p><p>when you hit &lt;C-d&gt;</p><p>some you will not exit the interpreter</p></li></ul>
</div>
</div>

<div id="outline-container-orge656079" class="outline-3">
<h3 id="orge656079"><span class="todo note">note</span> factoring</h3>
<div class="outline-text-3" id="text-orge656079">
<ul class="org-ul">
<li><p>reading from file of stdin is slow</p><p>thus</p><p><ol class="org-ol"></p><p><li>when reading from file</p><p>a whole file is readed at a time</p><p>and setd to a buffer</li></p><p><li>when reading from stdin</p><p>a whole line is readed at a time</li></p><p><li>note that</p><p>reading line instead of keyboard-code</p><p>will limit the design of the user interface</li></ol></p></li>
<li><p>by factoring out the low-level calls</p><p>that read a line from stdin</p><p>we are able to implement eval-string easily</p></li></ul>
</div>
</div>

<div id="outline-container-orgc77e82f" class="outline-3">
<h3 id="orgc77e82f">read-line-from-stdin&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-orgc77e82f">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

define_primitive_function <span style="color: #e6db74;">"read-line-from-stdin"</span>, read_line_from_stdin
   <span style="color: #FF8888;">;; &lt;&lt; buffer address, max length -- counter &gt;&gt;</span>
   pop_argument_stack linux64_sys_3_rdx
   pop_argument_stack linux64_sys_2_rsi
   <span style="color: #a6e22e;">xor</span> linux64_sys_1_rdi, linux64_sys_1_rdi <span style="color: #FF8888;">;; stdin</span>
   <span style="color: #a6e22e;">mov</span> linux64_sys_n_rax, linux64_syscall_read
   <span style="color: #a6e22e;">syscall</span>
   <span style="color: #FF8888;">;; the return value</span>
   <span style="color: #FF8888;">;; is a count of the number of bytes transferred</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

}
</pre>
</div>
</div>
</div>
