cicada-nymph.org
** read-line-from-stdin               :32bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =32bit, platform machine {

   define_primitive_function "read-line-from-stdin", read_line_from_stdin
      ;; << buffer address, max length -- counter >>
      pop_argument_stack linux32_sys_3_edx
      pop_argument_stack linux32_sys_2_ecx
      xor linux32_sys_1_ebx, linux32_sys_1_ebx ;; stdin
      mov linux32_sys_n_eax, linux32_syscall_read
      syscall
      ;; the return value
      ;; is a count of the number of bytes transferred
      push_argument_stack rax
      next

   }
   #+end_src
** test read-line-from-stdin
   #+begin_src fasm
   define_function "", test__read_line_from_stdin
      xx literal, buffer$reading
      xx literal, max_input_length
      xx read_line_from_stdin
      xx pretty_write_integer
      xx literal, buffer$reading
      xx literal, 10
      xx write_string
      xx exit_with_tos
      xx end
   #+end_src
** read-byte
   #+begin_src fasm :tangle cicada-nymph.fasm
   max_input_length = 64 * 1024

   buffer$reading labeling
      preserve max_input_length

   replace$reading labeling
      preserve 1024

   define_function "read-byte", read_byte
      ;; << -- byte >>
      xx pop_reading_stack
      xx dup2, empty_string?, CICADA__not, false?branch, (.bad_tos-$)/cell_size
      xx   sub1, swap
      xx   tuck
      xx   add1, swap
      xx   push_reading_stack
      xx   get_byte
      xx   end
   .bad_tos:
      xx reading_stack_empty?, false?branch, (.not_empty-$)/cell_size
      xx   drop2
      xx   literal, buffer$reading
      xx   literal, max_input_length
      xx   read_line_from_stdin
      xx   dup, positive?, false?branch, (.read_error-$)/cell_size
      xx     literal, buffer$reading
      xx     swap
      xx     push_reading_stack
      xx     tail_call, read_byte
   .read_error:
      ;;   ignore <end-of-file>
      ;;   ignore reading error
      xx   drop
      xx   literal, buffer$reading
      xx   literal, 0
      xx   push_reading_stack
      xx   tail_call, read_byte
   .not_empty:
      xx   literal, error$read_byte
      xx   literal, length$read_byte
      xx   write_string
      xx   literal, replace$reading
      xx   literal, 1024
      xx   read_line_from_stdin
      xx   literal, replace$reading
      xx   swap
      xx   push_reading_stack
      xx   tail_call, read_byte

   error$read_byte:
      db "* (read-byte) meets empty-string in reading-stack", 10
      db "  and this empty-stack is not at the bottom of the reading-stack", 10
      db "  you can type a line to replace this empty string", 10
   .end:
   length$read_byte = (.end - error$read_byte)
   #+end_src
* load-core-file
  #+begin_src fasm :tangle cicada-nymph.fasm
  define_function "load-core-file", load_core_file
     ;; << unknown -- unknown >>
     xx literal, address$core_file
     xx literal, (end$core_file - address$core_file)
     xx push_reading_stack
     xx end
  #+end_src
* byte
** space-byte?
   * as for space-byte
     I only use two
     ASCII 10 (newline)
     ASCII 32 (whitespace)
   * note that
     I use the term "whitespace" to denotes the byte
     I use the term "space" to denotes the set of bytes
   * I will simply view number less-or-equal 32 as space-byte
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "space-byte?", space_byte?
      ;; << byte -- bool >>
      xx literal, 0
      xx literal, 32
      xx within?
      xx end
   #+end_src
