cicada-nymph.html

<div id="outline-container-org7b8311" class="outline-3">
<h3 id="org7b8311">read-line-from-stdin&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org7b8311">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

define_primitive_function <span style="color: #e6db74;">"read-line-from-stdin"</span>, read_line_from_stdin
   <span style="color: #FF8888;">;; &lt;&lt; buffer address, max length -- counter &gt;&gt;</span>
   pop_argument_stack linux32_sys_3_edx
   pop_argument_stack linux32_sys_2_ecx
   <span style="color: #a6e22e;">xor</span> linux32_sys_1_ebx, linux32_sys_1_ebx <span style="color: #FF8888;">;; stdin</span>
   <span style="color: #a6e22e;">mov</span> linux32_sys_n_eax, linux32_syscall_read
   <span style="color: #a6e22e;">syscall</span>
   <span style="color: #FF8888;">;; the return value</span>
   <span style="color: #FF8888;">;; is a count of the number of bytes transferred</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org732a663" class="outline-3">
<h3 id="org732a663"><span class="done test">test</span> read-line-from-stdin</h3>
<div class="outline-text-3" id="text-org732a663">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">""</span>, test__read_line_from_stdin
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, max_input_length
   <span style="color: #66d9ef; font-weight: bold;">xx</span> read_line_from_stdin
   <span style="color: #66d9ef; font-weight: bold;">xx</span> pretty_write_integer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">10</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> exit_with_tos
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea3ae1b" class="outline-3">
<h3 id="orgea3ae1b">read-byte</h3>
<div class="outline-text-3" id="text-orgea3ae1b">
<div class="org-src-container">

<pre class="src src-fasm">max_input_length = <span style="color: #ae81ff;">64</span> * <span style="color: #ae81ff;">1024</span>

buffer$reading <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> max_input_length

replace$reading <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> <span style="color: #ae81ff;">1024</span>

define_function <span style="color: #e6db74;">"read-byte"</span>, read_byte
   <span style="color: #FF8888;">;; &lt;&lt; -- byte &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> pop_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, empty_string?, CICADA__not, <span style="color: #f92672; font-weight: bold;">false?branch</span>, (.bad_tos-$)/cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   sub1, swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   tuck
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   add1, swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   push_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   get_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
<span style="color: #a6e22e;">.bad_tos</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> reading_stack_empty?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, (.not_empty-$)/cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, max_input_length
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   read_line_from_stdin
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">dup</span>, positive?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, (.read_error-$)/cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     push_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     <span style="color: #f92672; font-weight: bold;">tail_call</span>, read_byte
<span style="color: #a6e22e;">.read_error</span>:
   <span style="color: #FF8888;">;;   ignore &lt;end-of-file&gt;</span>
   <span style="color: #FF8888;">;;   ignore reading error</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   push_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">tail_call</span>, read_byte
<span style="color: #a6e22e;">.not_empty</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, error$read_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, length$read_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, replace$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">1024</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   read_line_from_stdin
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, replace$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   push_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">tail_call</span>, read_byte

<span style="color: #a6e22e;">error$read_byte</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"* (read-byte) meets empty-string in reading-stack"</span>, <span style="color: #ae81ff;">10</span>
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"  and this empty-stack is not at the bottom of the reading-stack"</span>, <span style="color: #ae81ff;">10</span>
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"  you can type a line to replace this empty string"</span>, <span style="color: #ae81ff;">10</span>
<span style="color: #a6e22e;">.end</span>:
length$read_byte = (.end - error$read_byte)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf9c337e" class="outline-2">
<h2 id="orgf9c337e">load-core-file</h2>
<div class="outline-text-2" id="text-orgf9c337e">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"load-core-file"</span>, load_core_file
   <span style="color: #FF8888;">;; &lt;&lt; unknown -- unknown &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, address$core_file
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, (end$core_file - address$core_file)
   <span style="color: #66d9ef; font-weight: bold;">xx</span> push_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1cf5a1" class="outline-2">
<h2 id="orgc1cf5a1">byte</h2>
<div class="outline-text-2" id="text-orgc1cf5a1">
</div><div id="outline-container-org762ce7c" class="outline-3">
<h3 id="org762ce7c">space-byte?</h3>
<div class="outline-text-3" id="text-org762ce7c">
<ul class="org-ul">
<li><p>as for space-byte</p><p>I only use two</p><p>ASCII 10 (newline)</p><p>ASCII 32 (whitespace)</p></li>
<li><p>note that</p><p>I use the term "whitespace" to denotes the byte</p><p>I use the term "space" to denotes the set of bytes</p></li>
<li><p>I will simply view number less-or-equal 32 as space-byte</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"space-byte?"</span>, space_byte?
   <span style="color: #FF8888;">;; &lt;&lt; byte -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">32</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> within?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
