cicada-nymph.org
** bar-ket-byte?
   * () [] {}
     but not <>
   * double-quote is viewed as special bar-ket-byte
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "bar-ket-byte?", bar_ket_byte?
      ;; << byte -- bool >>
      xx dup, literal, '(', equal?, false?branch, 4
      xx   drop, true
      xx   end
      xx dup, literal, ')', equal?, false?branch, 4
      xx   drop, true
      xx   end
      xx dup, literal, '[', equal?, false?branch, 4
      xx   drop, true
      xx   end
      xx dup, literal, ']', equal?, false?branch, 4
      xx   drop, true
      xx   end
      xx dup, literal, '{', equal?, false?branch, 4
      xx   drop, true
      xx   end
      xx dup, literal, '}', equal?, false?branch, 4
      xx   drop, true
      xx   end
      xx dup, literal, '"', equal?, false?branch, 4
      xx   drop, true
      xx   end
      xx drop, false
      xx end
   #+end_src
** digit-byte?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "digit-byte?", digit_byte?
      ;; << byte -- bool >>
      xx literal, '0'
      xx literal, '9'
      xx within?
      xx end
   #+end_src
** digit-byte->number & number->digit-byte
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "digit-byte->number", digit_byte_to_number
      ;; << byte -- number >>
      xx literal, '0'
      xx subtraction
      xx end

   define_function "number->digit-byte", number_to_digit_byte
      ;; << number -- byte >>
      xx literal, '0'
      xx addition
      xx end
   #+end_src
* buffer
** note
   * a buffer is a large vector
     and some functions do not care about how large it is
** compare-buffer
   #+begin_src fasm :tangle cicada-nymph.fasm
   ;; return false when length == 0
   define_primitive_function "compare-buffer", compare_buffer
      ;; << address, address, length -- bool >>
      pop_argument_stack rcx
      pop_argument_stack rdi
      pop_argument_stack rsi
      repe cmpsb
      sete al
      movzx rax, al
      push_argument_stack rax
      next
   #+end_src
** cursor->next-matching-byte
   * note that
     it is the NEXT matching-byte
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "cursor->next-matching-byte", cursor_to_next_matching_byte
      ;; << cursor, byte -- cursor new address >>
      xx over, add1, get_byte
      xx over, equal?, false?branch, 4
      xx   drop, add1
      xx   end
      xx swap
      xx add1, swap
      xx tail_call, cursor_to_next_matching_byte
   #+end_src
* string
** ----------------------------------
** note io about string
** write-string
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "write-string", write_string
      ;; << string[address, length] -- >>
      xx dup, zero?, false?branch, 3
      xx   drop2
      xx   end
      xx sub1, swap
      xx dup, get_byte, write_byte
      xx add1, swap
      xx tail_call, write_string

   define_function ".s", ALIAS__write_string
      ;; << integer -- >>
      xx write_string
      xx end
   #+end_src
** pretty_write_string
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "pretty-write-string", pretty_write_string
      ;; << integer -- >>
      xx write_string
      xx literal, 10
      xx write_byte
      xx end
   #+end_src
** ----------------------------------
