cicada-nymph.html

<div id="outline-container-orga43063f" class="outline-3">
<h3 id="orga43063f">bar-ket-byte?</h3>
<div class="outline-text-3" id="text-orga43063f">
<ul class="org-ul">
<li><p>() [] {}</p><p>but not &lt;&gt;</p></li>
<li><p>double-quote is viewed as special bar-ket-byte</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"bar-ket-byte?"</span>, bar_ket_byte?
   <span style="color: #FF8888;">;; &lt;&lt; byte -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'('</span>, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">')'</span>, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'['</span>, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">']'</span>, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'{'</span>, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'}'</span>, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'"'</span>, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb485ae1" class="outline-3">
<h3 id="orgb485ae1">digit-byte?</h3>
<div class="outline-text-3" id="text-orgb485ae1">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"digit-byte?"</span>, digit_byte?
   <span style="color: #FF8888;">;; &lt;&lt; byte -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'0'</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'9'</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> within?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org281a9cf" class="outline-3">
<h3 id="org281a9cf">digit-byte-&gt;number &amp; number-&gt;digit-byte</h3>
<div class="outline-text-3" id="text-org281a9cf">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"digit-byte-&gt;number"</span>, digit_byte_to_number
   <span style="color: #FF8888;">;; &lt;&lt; byte -- number &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'0'</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"number-&gt;digit-byte"</span>, number_to_digit_byte
   <span style="color: #FF8888;">;; &lt;&lt; number -- byte &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'0'</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7e84198" class="outline-2">
<h2 id="org7e84198">buffer</h2>
<div class="outline-text-2" id="text-org7e84198">
</div><div id="outline-container-orgf962804" class="outline-3">
<h3 id="orgf962804"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-orgf962804">
<ul class="org-ul">
<li><p>a buffer is a large vector</p><p>and some functions do not care about how large it is</p></li></ul>
</div>
</div>

<div id="outline-container-orga9b45d8" class="outline-3">
<h3 id="orga9b45d8">compare-buffer</h3>
<div class="outline-text-3" id="text-orga9b45d8">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #FF8888;">;; return false when length == 0</span>
define_primitive_function <span style="color: #e6db74;">"compare-buffer"</span>, compare_buffer
   <span style="color: #FF8888;">;; &lt;&lt; address, address, length -- bool &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span>
   pop_argument_stack <span style="color: #fd971f;">rdi</span>
   pop_argument_stack <span style="color: #fd971f;">rsi</span>
   <span style="color: #a6e22e;">repe</span> <span style="color: #a6e22e;">cmpsb</span>
   <span style="color: #a6e22e;">sete</span> <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">movzx</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">al</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-org988a4fe" class="outline-3">
<h3 id="org988a4fe">cursor-&gt;next-matching-byte</h3>
<div class="outline-text-3" id="text-org988a4fe">
<ul class="org-ul">
<li><p>note that</p><p>it is the NEXT matching-byte</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"cursor-&gt;next-matching-byte"</span>, cursor_to_next_matching_byte
   <span style="color: #FF8888;">;; &lt;&lt; cursor, byte -- cursor new address &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> over, add1, get_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> over, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, add1
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add1, swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, cursor_to_next_matching_byte
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5a87b1e" class="outline-2">
<h2 id="org5a87b1e">string</h2>
<div class="outline-text-2" id="text-org5a87b1e">
</div><div id="outline-container-orgf212cde" class="outline-3">
<h3 id="orgf212cde"><span class="todo note">note</span> io about string</h3>
</div>

<div id="outline-container-org77c5d74" class="outline-3">
<h3 id="org77c5d74">write-string</h3>
<div class="outline-text-3" id="text-org77c5d74">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"write-string"</span>, write_string
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> sub1, swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, get_byte, write_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add1, swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, write_string

define_function <span style="color: #e6db74;">".s"</span>, ALIAS__write_string
   <span style="color: #FF8888;">;; &lt;&lt; integer -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfab5f36" class="outline-3">
<h3 id="orgfab5f36">pretty_write_string</h3>
<div class="outline-text-3" id="text-orgfab5f36">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"pretty-write-string"</span>, pretty_write_string
   <span style="color: #FF8888;">;; &lt;&lt; integer -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">10</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
