cicada-nymph.org
** string:empty?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:empty?", empty_string?
     ;; << string[address, length] -- bool >>
     xx swap, drop
     xx zero?
     xx end
   #+end_src
** string:equal?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:equal?", string_equal?
      ;; << string[address, length], string[address, length] -- bool >>
      xx xoverxx, equal?, false?branch, 4
      xx   swap
      xx   compare_buffer
      xx   end
      xx drop, drop2
      xx false
      xx end
   #+end_src
** string:byte
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:byte", string__byte
      ;; << string[address, length] -- byte >>
      xx drop, get_byte
      xx end
   #+end_src
** string:byte-tail
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:byte-tail", string__byte_tail
      ;; << string[address, length] -- [address + 1, length - 1] >>
      xx sub1, swap
      xx add1
      xx swap
      xx end
   #+end_src
** string:byte-back
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:byte-back", string__byte_back
      ;; << string[address, length] -- [address - 1, length + 1] >>
      xx add1, swap
      xx sub1
      xx swap
      xx end
   #+end_src
** ----------------------------------
** string->buffer!
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "string->buffer!", string_to_buffer!
      ;; ( string[address, length], buffer[address] -- )
      pop_argument_stack rdi ;; destination
      pop_argument_stack rcx ;; counter
      pop_argument_stack rsi ;; source
      rep movsb
      next
   #+end_src
** string-reverse!                    :64bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   buffer$string_reverse! labeling
      preserve 1024


   define_primitive_function "string-reverse!", string_reverse!
      ;; << string[address, length] -- string[address, length] >>
      mov rdi, buffer$string_reverse!
      mov rcx, [pointer$argument_stack - (1 * cell_size)]
      mov rsi, [pointer$argument_stack - (2 * cell_size)]
      rep movsb

      mov rcx, [pointer$argument_stack - (1 * cell_size)]
      dec rdi ;; cursor back into string in buffer$string_reverse!
      mov rsi, [pointer$argument_stack - (2 * cell_size)]
   .loop:
      mov al, byte [rdi]
      mov byte [rsi], al
      dec rdi
      inc rsi
      loop .loop

      next

   }
   #+end_src
** string-reverse!                    :32bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =32bit, machine {

   buffer$string_reverse! labeling
      preserve 1024


   define_primitive_function "string-reverse!", string_reverse!
      ;; << string[address, length] -- string[address, length] >>
      mov rbx, [pointer$argument_stack]
      mov rdi, buffer$string_reverse!
      mov rcx, [rbx - (1 * cell_size)]
      mov rsi, [rbx - (2 * cell_size)]
      rep movsb

      mov rcx, [rbx - (1 * cell_size)]
      dec rdi ;; cursor back into string in buffer$string_reverse!
      mov rsi, [rbx - (2 * cell_size)]
   .loop:
      mov al, byte [rdi]
      mov byte [rsi], al
      dec rdi
      inc rsi
      loop .loop

      next

   }
   #+end_src
** one-byte-string?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "one-byte-string?", one_byte_string?
      ;; << string[address, length], byte -- bool >>
      xx xxswapx
      xx dup, one?, false?, false?branch, 5
      xx   drop2, drop
      xx   false
      xx   end
      xx string__byte, equal?, false?branch, 3
      xx   true
      xx   end
      xx false
      xx end
   #+end_src
