cicada-nymph.html


<div id="outline-container-org801cbe4" class="outline-3">
<h3 id="org801cbe4">string:empty?</h3>
<div class="outline-text-3" id="text-org801cbe4">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:empty?"</span>, empty_string?
  <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- bool &gt;&gt;</span>
  <span style="color: #66d9ef; font-weight: bold;">xx</span> swap, drop
  <span style="color: #66d9ef; font-weight: bold;">xx</span> zero?
  <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a47304" class="outline-3">
<h3 id="org2a47304">string:equal?</h3>
<div class="outline-text-3" id="text-org2a47304">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:equal?"</span>, string_equal?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], string[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xoverxx, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   compare_buffer
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop, drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> false
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f47d33" class="outline-3">
<h3 id="org5f47d33">string:byte</h3>
<div class="outline-text-3" id="text-org5f47d33">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:byte"</span>, string__byte
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- byte &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop, get_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4049599" class="outline-3">
<h3 id="org4049599">string:byte-tail</h3>
<div class="outline-text-3" id="text-org4049599">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:byte-tail"</span>, string__byte_tail
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- [address + 1, length - 1] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> sub1, swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add1
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d68499" class="outline-3">
<h3 id="org7d68499">string:byte-back</h3>
<div class="outline-text-3" id="text-org7d68499">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:byte-back"</span>, string__byte_back
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- [address - 1, length + 1] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add1, swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span> sub1
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org47630ca" class="outline-3">
<h3 id="org47630ca">string-&gt;buffer!</h3>
<div class="outline-text-3" id="text-org47630ca">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"string-&gt;buffer!"</span>, string_to_buffer!
   <span style="color: #FF8888;">;; ( string[address, length], buffer[address] -- )</span>
   pop_argument_stack <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; destination</span>
   pop_argument_stack <span style="color: #fd971f;">rcx</span> <span style="color: #FF8888;">;; counter</span>
   pop_argument_stack <span style="color: #fd971f;">rsi</span> <span style="color: #FF8888;">;; source</span>
   <span style="color: #a6e22e;">rep</span> <span style="color: #a6e22e;">movsb</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1d10ef" class="outline-3">
<h3 id="orgc1d10ef">string-reverse!&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-orgc1d10ef">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

buffer$string_reverse! <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> <span style="color: #ae81ff;">1024</span>


define_primitive_function <span style="color: #e6db74;">"string-reverse!"</span>, string_reverse!
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- string[address, length] &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdi</span>, buffer$string_reverse!
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">1</span> * cell_size)]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">2</span> * cell_size)]
   <span style="color: #a6e22e;">rep</span> <span style="color: #a6e22e;">movsb</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">1</span> * cell_size)]
   <span style="color: #a6e22e;">dec</span> <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; cursor back into string in buffer$string_reverse!</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, [pointer$argument_stack - (<span style="color: #ae81ff;">2</span> * cell_size)]
<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">al</span>, <span style="color: #66d9ef; font-weight: bold;">byte</span> [<span style="color: #fd971f;">rdi</span>]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">byte</span> [<span style="color: #fd971f;">rsi</span>], <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">dec</span> <span style="color: #fd971f;">rdi</span>
   <span style="color: #a6e22e;">inc</span> <span style="color: #fd971f;">rsi</span>
   <span style="color: #a6e22e;">loop</span> .loop

   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4044070" class="outline-3">
<h3 id="org4044070">string-reverse!&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org4044070">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

buffer$string_reverse! <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> <span style="color: #ae81ff;">1024</span>


define_primitive_function <span style="color: #e6db74;">"string-reverse!"</span>, string_reverse!
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- string[address, length] &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$argument_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdi</span>, buffer$string_reverse!
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">1</span> * cell_size)]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">2</span> * cell_size)]
   <span style="color: #a6e22e;">rep</span> <span style="color: #a6e22e;">movsb</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">1</span> * cell_size)]
   <span style="color: #a6e22e;">dec</span> <span style="color: #fd971f;">rdi</span> <span style="color: #FF8888;">;; cursor back into string in buffer$string_reverse!</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rsi</span>, [<span style="color: #fd971f;">rbx</span> - (<span style="color: #ae81ff;">2</span> * cell_size)]
<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">al</span>, <span style="color: #66d9ef; font-weight: bold;">byte</span> [<span style="color: #fd971f;">rdi</span>]
   <span style="color: #a6e22e;">mov</span> <span style="color: #66d9ef; font-weight: bold;">byte</span> [<span style="color: #fd971f;">rsi</span>], <span style="color: #fd971f;">al</span>
   <span style="color: #a6e22e;">dec</span> <span style="color: #fd971f;">rdi</span>
   <span style="color: #a6e22e;">inc</span> <span style="color: #fd971f;">rsi</span>
   <span style="color: #a6e22e;">loop</span> .loop

   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3f1316" class="outline-3">
<h3 id="orgd3f1316">one-byte-string?</h3>
<div class="outline-text-3" id="text-orgd3f1316">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"one-byte-string?"</span>, one_byte_string?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], byte -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxswapx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, one?, false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">5</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, drop
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> false
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
