cicada-nymph.org
** zero-string?
   * "0" or "-0"
     0 is special when compiling literal number
     for we are using 0 as "end"
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "zero-string?", zero_string?
      ;; << string[address, length] -- bool >>
      xx dup2, literal, '0', one_byte_string?, false?branch, 4
      xx   drop2, true
      xx   end
      xx dup2
      xx string__byte, literal, '-', equal?, false?, false?branch, 4
      xx   drop2, false
      xx   end
      xx string__byte_tail, literal, '0', one_byte_string?
      xx end
   #+end_src
** digit-string?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "digit-string?", digit_string?
      ;; << string[address, length] -- bool >>
      xx dup, zero?, false?branch, 4
      xx   drop2, true
      xx   end
      xx over, get_byte, digit_byte?, false?branch, 4
      xx   string__byte_tail
      xx   tail_call, digit_string?
      xx drop2, false
      xx end
   #+end_src
** integer-string?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "integer-string?", integer_string?
      ;; << string[address, length] -- bool >>
      xx dup, zero?, false?branch, 4
      xx   drop2, false
      xx   end
      xx dup2, literal, '-', one_byte_string?, false?branch, 4
      xx   drop2, false
      xx   end
      xx dup2, string__byte, literal, '-', equal?, false?branch, 4
      xx   string__byte_tail
      xx   digit_string?
      xx   end
      xx digit_string?
      xx end
   #+end_src
** digit-string->number
   #+begin_src fasm :tangle cicada-nymph.fasm
   sum$digit_string_to_number:
      xx 0

   counter$digit_string_to_number:
      xx 0

   define_function "digit-string->number", digit_string_to_number
      ;; << string[address, length] -- integer >>
      xx zero, literal, sum$digit_string_to_number, set
      xx zero, literal, counter$digit_string_to_number, set

      xx dup2, string_reverse!
      xx   help__digit_string_to_number
      xx string_reverse!, drop2

      xx literal, sum$digit_string_to_number
      xx get
      xx end

   define_function "help,digit-string->number", help__digit_string_to_number
      ;; << reversed-string[address, length] -- >>
      xx dup, zero?, false?branch, 3
      xx   drop2
      xx   end

      xx dup2, string__byte, digit_byte_to_number
      xx   literal, 10
      xx   literal, counter$digit_string_to_number, get
      xx     one
      xx     literal, counter$digit_string_to_number
      xx     add_set
      xx   power
      xx multiple

      xx literal, sum$digit_string_to_number
      xx add_set

      xx string__byte_tail
      xx tail_call, help__digit_string_to_number
   #+end_src
** string->integer
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string->integer", string_to_integer
      ;; << string[address, length] -- integer >>
      xx dup2, string__byte, literal, '-', equal?, false?, false?branch, 3
      xx   digit_string_to_number
      xx   end
      xx string__byte_tail
      xx digit_string_to_number
      xx negate
      xx end
   #+end_src
** ----------------------------------
