cicada-nymph.html

<div id="outline-container-orgf3bc476" class="outline-3">
<h3 id="orgf3bc476">zero-string?</h3>
<div class="outline-text-3" id="text-orgf3bc476">
<ul class="org-ul">
<li><p>"0" or "-0"</p><p>0 is special when compiling literal number</p><p>for we are using 0 as "end"</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"zero-string?"</span>, zero_string?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'0'</span>, one_byte_string?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'-'</span>, equal?, false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte_tail, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'0'</span>, one_byte_string?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc94e208" class="outline-3">
<h3 id="orgc94e208">digit-string?</h3>
<div class="outline-text-3" id="text-orgc94e208">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"digit-string?"</span>, digit_string?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> over, get_byte, digit_byte?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   string__byte_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">tail_call</span>, digit_string?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e895f3" class="outline-3">
<h3 id="org8e895f3">integer-string?</h3>
<div class="outline-text-3" id="text-org8e895f3">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"integer-string?"</span>, integer_string?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'-'</span>, one_byte_string?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, string__byte, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'-'</span>, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   string__byte_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   digit_string?
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> digit_string?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org24fe7cc" class="outline-3">
<h3 id="org24fe7cc">digit-string-&gt;number</h3>
<div class="outline-text-3" id="text-org24fe7cc">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">sum$digit_string_to_number</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">0</span>

<span style="color: #a6e22e;">counter$digit_string_to_number</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">0</span>

define_function <span style="color: #e6db74;">"digit-string-&gt;number"</span>, digit_string_to_number
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- integer &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> zero, <span style="color: #f92672; font-weight: bold;">literal</span>, sum$digit_string_to_number, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> zero, <span style="color: #f92672; font-weight: bold;">literal</span>, counter$digit_string_to_number, set

   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, string_reverse!
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   help__digit_string_to_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_reverse!, drop2

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, sum$digit_string_to_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"help,digit-string-&gt;number"</span>, help__digit_string_to_number
   <span style="color: #FF8888;">;; &lt;&lt; reversed-string[address, length] -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, string__byte, digit_byte_to_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">10</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, counter$digit_string_to_number, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     one
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     <span style="color: #f92672; font-weight: bold;">literal</span>, counter$digit_string_to_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     add_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   power
   <span style="color: #66d9ef; font-weight: bold;">xx</span> multiple

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, sum$digit_string_to_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add_set

   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, help__digit_string_to_number
</pre>
</div>
</div>
</div>

<div id="outline-container-orge161bc3" class="outline-3">
<h3 id="orge161bc3">string-&gt;integer</h3>
<div class="outline-text-3" id="text-orge161bc3">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string-&gt;integer"</span>, string_to_integer
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- integer &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, string__byte, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'-'</span>, equal?, false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   digit_string_to_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span> digit_string_to_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span> negate
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
