cicada-nymph.org
** string:find-byte
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:find-byte", string__find_byte
     ;; << string[address, length], byte
     ;;    -- address, true
     ;;    -- false >>
     xx over, zero?, false?branch, 5
     xx   drop, drop2
     xx   false
     xx   end
     xx xoverxx, get_byte
     xx over, equal?, false?branch, 4
     xx   drop2
     xx   true
     xx   end
     xx xxswapx
     xx string__byte_tail
     xx xswapxx
     xx tail_call, string__find_byte
   #+end_src
** test
   #+begin_src cicada-nymph
   : XIE Yuheng ;
   32 string:find-byte . << 1 >>
   get-byte . << 32 >>
   #+end_src
** string-end,byte
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string-end,byte", string_end__byte
      ;; << string[address, length] -- byte >>
      xx addition, sub1, get_byte
      xx end
   #+end_src
** ----------------------------------
** note
   * one should use string:space? to make sure
     that the string is not space-string
     before calling the following functions
** string:space?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:space?", space_string?
      ;; << string[address, length] -- bool >>
      xx dup, zero?, false?branch, 4
      xx   drop2, true
      xx   end
      xx dup2, string__byte, space_byte?, false?branch, 4
      xx   string__byte_tail
      xx   tail_call, space_string?
      xx drop2, false
      xx end
   #+end_src
** string:word-begin
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:word-begin", string__word_begin
      ;; << string[address, length] -- string[address, length] >>
      xx dup, zero?, false?branch, 2
      ;;   no error handling
      ;;   the same empty-string is returned
      xx   end
      xx dup2
      xx string__byte, space_byte?, false?, false?branch, 2
      xx   end
      xx string__byte_tail
      xx tail_call, string__word_begin
   #+end_src
** string:word-end
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:word-end,loop", string__word_end__loop
      ;; << string[address, length] -- string[address, length] >>
      xx dup, zero?, false?branch, 2
      ;;   no error handling
      ;;   the current empty-string is returned
      xx   end
      xx dup2
      xx string__byte, space_byte?, false?branch, 2
      xx   end
      xx dup2
      xx string__byte, bar_ket_byte?, false?branch, 2
      xx   end
      xx string__byte_tail
      xx tail_call, string__word_end__loop

   define_function "string:word-end", string__word_end
      ;; << string[address, length] -- string[address, length] >>
      xx dup, zero?, false?branch, 2
      ;;   no error handling
      ;;   the same empty-string is returned
      xx   end
      xx dup2
      xx string__byte, bar_ket_byte?, false?branch, 3
      xx   string__byte_tail
      xx   end
      xx string__word_end__loop
      xx end
   #+end_src
** string:word
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:word", string__word
      ;; << string[address, length] -- word[address, length] >>
      xx string__word_begin
      xx dup2, string__word_end
      xx swap, drop
      xx subtraction
      xx end
   #+end_src
** string:word-tail
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "string:word-tail", string__word_tail
      ;; << string[address, length] -- string[address, length] >>
      xx string__word_begin
      xx string__word_end
      xx end
   #+end_src
** ----------------------------------
* write number
