cicada-nymph.html


<div id="outline-container-org7a74f3b" class="outline-3">
<h3 id="org7a74f3b">string:find-byte</h3>
<div class="outline-text-3" id="text-org7a74f3b">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:find-byte"</span>, string__find_byte
  <span style="color: #FF8888;">;; &lt;&lt; string[address, length], byte</span>
  <span style="color: #FF8888;">;;    -- address, true</span>
  <span style="color: #FF8888;">;;    -- false &gt;&gt;</span>
  <span style="color: #66d9ef; font-weight: bold;">xx</span> over, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">5</span>
  <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, drop2
  <span style="color: #66d9ef; font-weight: bold;">xx</span>   false
  <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
  <span style="color: #66d9ef; font-weight: bold;">xx</span> xoverxx, get_byte
  <span style="color: #66d9ef; font-weight: bold;">xx</span> over, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
  <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
  <span style="color: #66d9ef; font-weight: bold;">xx</span>   true
  <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
  <span style="color: #66d9ef; font-weight: bold;">xx</span> xxswapx
  <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte_tail
  <span style="color: #66d9ef; font-weight: bold;">xx</span> xswapxx
  <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, string__find_byte
</pre>
</div>
</div>
</div>

<div id="outline-container-org1dc900c" class="outline-3">
<h3 id="org1dc900c"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-org1dc900c">
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">XIE</span> Yuheng <span style="color: #ffff00; font-weight: bold;">;</span>
<span style="color: #fd971f; font-weight: bold;">32</span> <span style="color: #ffffff; font-weight: bold;">string:</span>find-byte . <span style="color: #FF8888;">&lt;&lt; 1 &gt;&gt;</span>
get-byte . <span style="color: #FF8888;">&lt;&lt; 32 &gt;&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc92b03" class="outline-3">
<h3 id="orgfc92b03">string-end,byte</h3>
<div class="outline-text-3" id="text-orgfc92b03">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string-end,byte"</span>, string_end__byte
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- byte &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> addition, sub1, get_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org6fc80bb" class="outline-3">
<h3 id="org6fc80bb"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-org6fc80bb">
<ul class="org-ul">
<li><p>one should use string:space? to make sure</p><p>that the string is not space-string</p><p>before calling the following functions</p></li></ul>
</div>
</div>

<div id="outline-container-orgfb1ed7a" class="outline-3">
<h3 id="orgfb1ed7a">string:space?</h3>
<div class="outline-text-3" id="text-orgfb1ed7a">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:space?"</span>, space_string?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, string__byte, space_byte?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   string__byte_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">tail_call</span>, space_string?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org37f1f47" class="outline-3">
<h3 id="org37f1f47">string:word-begin</h3>
<div class="outline-text-3" id="text-org37f1f47">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:word-begin"</span>, string__word_begin
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #FF8888;">;;   no error handling</span>
   <span style="color: #FF8888;">;;   the same empty-string is returned</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte, space_byte?, false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, string__word_begin
</pre>
</div>
</div>
</div>

<div id="outline-container-org936a7b7" class="outline-3">
<h3 id="org936a7b7">string:word-end</h3>
<div class="outline-text-3" id="text-org936a7b7">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:word-end,loop"</span>, string__word_end__loop
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #FF8888;">;;   no error handling</span>
   <span style="color: #FF8888;">;;   the current empty-string is returned</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte, space_byte?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte, bar_ket_byte?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, string__word_end__loop

define_function <span style="color: #e6db74;">"string:word-end"</span>, string__word_end
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #FF8888;">;;   no error handling</span>
   <span style="color: #FF8888;">;;   the same empty-string is returned</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte, bar_ket_byte?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   string__byte_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word_end__loop
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb45825b" class="outline-3">
<h3 id="orgb45825b">string:word</h3>
<div class="outline-text-3" id="text-orgb45825b">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:word"</span>, string__word
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- word[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word_begin
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, string__word_end
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap, drop
   <span style="color: #66d9ef; font-weight: bold;">xx</span> subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
