cicada-nymph.org
** write-number
   #+begin_src fasm :tangle cicada-nymph.fasm
   ;; 2 ^ 64 = 18446744073709551616
   ;; which is of length 20
   ;; so
   ;; I use 32 to align to 16

   buffer$write_number labeling
      preserve 32

   counter$write_number:
      xx 0

   define_function "write-number", write_number
      ;; << number -- >>
      xx write_number__fill_buffer
      xx write_string
      xx end

   define_function "write-number,fill-buffer", write_number__fill_buffer
      ;; << number -- string[address, length] >>
      xx zero
      xx literal, counter$write_number, set

      xx write_number__loop

      xx literal, buffer$write_number
      xx literal, counter$write_number, get
      xx string_reverse!
      xx end


   define_function "write-number,loop", write_number__loop
      ;; << rest-number -- >>
      xx literal, 10, divmod

      xx number_to_digit_byte
      xx literal, buffer$write_number
      xx literal, counter$write_number, get
      xx addition
      xx set_byte

      xx one
      xx literal, counter$write_number
      xx add_set

      xx dup, zero?, false?branch, 3
      xx   drop
      xx   end
      xx tail_call, write_number__loop
   #+end_src
** write-integer
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "write-integer", write_integer
      ;; << integer -- >>
      xx dup, negative?, false?, false?branch, 3
      xx   write_number
      xx   end
      xx literal, '-', write_byte
      xx negate
      xx write_number
      xx end
   #+end_src
** pretty_write_integer
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "pretty-write-integer", pretty_write_integer
      ;; << integer -- >>
      xx write_integer
      xx literal, 32
      xx write_byte
      xx end

   define_function ".", ALIAS__pretty_write_integer
      ;; << integer -- >>
      xx pretty_write_integer
      xx end
   #+end_src
* word
** note io about word
   * words are separated by spaces
   * a bar-ket is a word
     even when there are no spaces around it
** note bar-ket
   * (read-word) is not implemented by (read-byte)
     instead it is implemented directly by side-effect on reading-stack
     [just like (read-byte)]
     thus
     we can implement bar-ket as word easily
     and nothing like un-read is needed
     and
     it is (string:word) and (string:word-tail)
     these two functions are maintaining the "bar-ket as word" feature
   * otherwise
     the implementation of (eval-string) will meet problems
** memory allocation
   #+begin_src fasm :tangle cicada-nymph.fasm
   max_word_length = 512

   buffer$read_word labeling
      preserve max_word_length
   #+end_src
