cicada-nymph.html

<div id="outline-container-org53a871f" class="outline-3">
<h3 id="org53a871f">string:word-tail</h3>
<div class="outline-text-3" id="text-org53a871f">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"string:word-tail"</span>, string__word_tail
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word_begin
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word_end
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org530af3b" class="outline-2">
<h2 id="org530af3b">write number</h2>
<div class="outline-text-2" id="text-org530af3b">
</div><div id="outline-container-orgb5226b5" class="outline-3">
<h3 id="orgb5226b5">write-number</h3>
<div class="outline-text-3" id="text-orgb5226b5">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #FF8888;">;; 2 ^ 64 = 18446744073709551616</span>
<span style="color: #FF8888;">;; which is of length 20</span>
<span style="color: #FF8888;">;; so</span>
<span style="color: #FF8888;">;; I use 32 to align to 16</span>

buffer$write_number <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> <span style="color: #ae81ff;">32</span>

<span style="color: #a6e22e;">counter$write_number</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">0</span>

define_function <span style="color: #e6db74;">"write-number"</span>, write_number
   <span style="color: #FF8888;">;; &lt;&lt; number -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_number__fill_buffer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"write-number,fill-buffer"</span>, write_number__fill_buffer
   <span style="color: #FF8888;">;; &lt;&lt; number -- string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> zero
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, counter$write_number, set

   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_number__loop

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$write_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, counter$write_number, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_reverse!
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>


define_function <span style="color: #e6db74;">"write-number,loop"</span>, write_number__loop
   <span style="color: #FF8888;">;; &lt;&lt; rest-number -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">10</span>, divmod

   <span style="color: #66d9ef; font-weight: bold;">xx</span> number_to_digit_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$write_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, counter$write_number, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> set_byte

   <span style="color: #66d9ef; font-weight: bold;">xx</span> one
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, counter$write_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add_set

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, write_number__loop
</pre>
</div>
</div>
</div>

<div id="outline-container-org9dea4d7" class="outline-3">
<h3 id="org9dea4d7">write-integer</h3>
<div class="outline-text-3" id="text-org9dea4d7">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"write-integer"</span>, write_integer
   <span style="color: #FF8888;">;; &lt;&lt; integer -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, negative?, false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   write_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'-'</span>, write_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> negate
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_number
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7fc156b" class="outline-3">
<h3 id="org7fc156b">pretty_write_integer</h3>
<div class="outline-text-3" id="text-org7fc156b">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"pretty-write-integer"</span>, pretty_write_integer
   <span style="color: #FF8888;">;; &lt;&lt; integer -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_integer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">32</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"."</span>, ALIAS__pretty_write_integer
   <span style="color: #FF8888;">;; &lt;&lt; integer -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> pretty_write_integer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2305b22" class="outline-2">
<h2 id="org2305b22">word</h2>
<div class="outline-text-2" id="text-org2305b22">
</div><div id="outline-container-org3d4965e" class="outline-3">
<h3 id="org3d4965e"><span class="todo note">note</span> io about word</h3>
<div class="outline-text-3" id="text-org3d4965e">
<ul class="org-ul">
<li><p>words are separated by spaces</p></li>
<li><p>a bar-ket is a word</p><p>even when there are no spaces around it</p></li></ul>
</div>
</div>

<div id="outline-container-org3a23795" class="outline-3">
<h3 id="org3a23795"><span class="todo note">note</span> bar-ket</h3>
<div class="outline-text-3" id="text-org3a23795">
<ul class="org-ul">
<li><p>(read-word) is not implemented by (read-byte)</p><p>instead it is implemented directly by side-effect on reading-stack</p><p>[just like (read-byte)]</p><p>thus</p><p>we can implement bar-ket as word easily</p><p>and nothing like un-read is needed</p><p>and</p><p>it is (string:word) and (string:word-tail)</p><p>these two functions are maintaining the "bar-ket as word" feature</p></li>
<li><p>otherwise</p><p>the implementation of (eval-string) will meet problems</p></li></ul>
</div>
</div>

<div id="outline-container-org6b276da" class="outline-3">
<h3 id="org6b276da">memory allocation</h3>
<div class="outline-text-3" id="text-org6b276da">
<div class="org-src-container">

<pre class="src src-fasm">max_word_length = <span style="color: #ae81ff;">512</span>

buffer$read_word <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> max_word_length
</pre>
</div>
</div>
</div>
