cicada-nymph.org
** read-word->buffer
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "read-word->buffer", read_word_to_buffer
      ;; << buffer -- word[address, length] >>
      xx pop_reading_stack
      xx dup2, space_string?, CICADA__not, false?branch, (.bad_tos-$)/cell_size
      xx   dup2, string__word_tail, push_reading_stack
      xx   string__word
      xx   xoverxx, xxoverx
      xx   xswapxx
      xx   string_to_buffer!
      xx   swap, drop
      xx   end
   .bad_tos:
      xx reading_stack_empty?, false?branch, (.not_empty-$)/cell_size
      xx   drop2
      xx   literal, buffer$reading
      xx   literal, max_input_length
      xx   read_line_from_stdin
      xx   dup, positive?, false?branch, (.read_error-$)/cell_size
      xx     literal, buffer$reading
      xx     swap
      xx     push_reading_stack
      xx     tail_call, read_word_to_buffer
   .read_error:
      ;;   ignore <end-of-file>
      ;;   ignore reading error
      xx   drop
      xx   literal, buffer$reading
      xx   literal, 0
      xx   push_reading_stack
      xx   tail_call, read_word_to_buffer
   .not_empty:
      xx   literal, error$read_word_to_buffer
      xx   literal, length$read_word_to_buffer
      xx   write_string
      xx   literal, replace$reading
      xx   literal, 1024
      xx   read_line_from_stdin
      xx   literal, replace$reading
      xx   swap
      xx   push_reading_stack
      xx   tail_call, read_word_to_buffer

   error$read_word_to_buffer:
      db "* (read-word->buffer) meets empty-string in reading-stack", 10
      db "  and this empty-stack is not at the bottom of the reading-stack", 10
      db "  you can type a line to replace this empty string", 10
   .end:
   length$read_word_to_buffer = (.end - error$read_word_to_buffer)
   #+end_src
** read-word
   * read-word will override the word readed before
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "read-word", read_word
      ;; << -- word[address of buffer$read_word, length] >>
      xx literal, buffer$read_word, read_word_to_buffer
      xx end
   #+end_src
* link
** last-link?
   * fatal error on zero
   * the last-link is not zero
     but is a link of which the link field is zero
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "last-link?", last_link?
      ;; << link -- bool >>
      xx get, zero?
      xx end
   #+end_src
** link->next-link
   * fatal error on zero
   * the test of zero? is for less core dump
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "link->next-link", link_to_next_link
     ;; << link -- next-link >>
     xx get
     xx end
   #+end_src
** link->name-string
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "link->name-string", link_to_name_string
      ;; << link -- string[address, length] >>
      xx literal, offset__link$string_address, addition
      xx literal, 2
      xx n_get
      xx end
   #+end_src
** link->jo
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "link->jo", link_to_jo
      ;; << link -- jo >>
      xx literal, offset__link$jo, addition, get
      xx end
   #+end_src
** link,set-jo
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "link,set-jo", link__set_jo
      ;; << jo, link -- >>
      xx literal, offset__link$jo, addition
      xx set
      xx end
   #+end_src
** *link*
   * a link is the first jo in the link
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "*link*", V__link
      xx the_last_link_in_assembly_code
   #+end_src
** note about find
   * a function whoes name is prefixed by "find"
     maybe fail to find
     and maybe returns a signal
     to inform the function who calls it
** 記 遍歷鏈表的方式
   * 循環進行的方式是
     1. 保證循環開始時 所得到的 jo 不是最後一個
     2. 處理這個 jo
     3. 看看這個 jo 是否是最後一個
        * 如果是
          退出
        * 如果不是
          取下一個 jo 以循環
