cicada-nymph.html

<div id="outline-container-org31bc39d" class="outline-3">
<h3 id="org31bc39d">read-word-&gt;buffer</h3>
<div class="outline-text-3" id="text-org31bc39d">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"read-word-&gt;buffer"</span>, read_word_to_buffer
   <span style="color: #FF8888;">;; &lt;&lt; buffer -- word[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> pop_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, space_string?, CICADA__not, <span style="color: #f92672; font-weight: bold;">false?branch</span>, (.bad_tos-$)/cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   dup2, string__word_tail, push_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   string__word
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xoverxx, xxoverx
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xswapxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   string_to_buffer!
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   swap, drop
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
<span style="color: #a6e22e;">.bad_tos</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> reading_stack_empty?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, (.not_empty-$)/cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, max_input_length
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   read_line_from_stdin
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">dup</span>, positive?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, (.read_error-$)/cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     push_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     <span style="color: #f92672; font-weight: bold;">tail_call</span>, read_word_to_buffer
<span style="color: #a6e22e;">.read_error</span>:
   <span style="color: #FF8888;">;;   ignore &lt;end-of-file&gt;</span>
   <span style="color: #FF8888;">;;   ignore reading error</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   push_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">tail_call</span>, read_word_to_buffer
<span style="color: #a6e22e;">.not_empty</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, error$read_word_to_buffer
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, length$read_word_to_buffer
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, replace$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">1024</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   read_line_from_stdin
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, replace$reading
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   push_reading_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">tail_call</span>, read_word_to_buffer

<span style="color: #a6e22e;">error$read_word_to_buffer</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"* (read-word-&gt;buffer) meets empty-string in reading-stack"</span>, <span style="color: #ae81ff;">10</span>
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"  and this empty-stack is not at the bottom of the reading-stack"</span>, <span style="color: #ae81ff;">10</span>
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"  you can type a line to replace this empty string"</span>, <span style="color: #ae81ff;">10</span>
<span style="color: #a6e22e;">.end</span>:
length$read_word_to_buffer = (.end - error$read_word_to_buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a6ee9b" class="outline-3">
<h3 id="org4a6ee9b">read-word</h3>
<div class="outline-text-3" id="text-org4a6ee9b">
<ul class="org-ul">
<li><p>read-word will override the word readed before</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"read-word"</span>, read_word
   <span style="color: #FF8888;">;; &lt;&lt; -- word[address of buffer$read_word, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$read_word, read_word_to_buffer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org235633e" class="outline-2">
<h2 id="org235633e">link</h2>
<div class="outline-text-2" id="text-org235633e">
</div><div id="outline-container-org466f0a1" class="outline-3">
<h3 id="org466f0a1">last-link?</h3>
<div class="outline-text-3" id="text-org466f0a1">
<ul class="org-ul">
<li><p>fatal error on zero</p></li>
<li><p>the last-link is not zero</p><p>but is a link of which the link field is zero</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"last-link?"</span>, last_link?
   <span style="color: #FF8888;">;; &lt;&lt; link -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get, zero?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2cdf0f1" class="outline-3">
<h3 id="org2cdf0f1">link-&gt;next-link</h3>
<div class="outline-text-3" id="text-org2cdf0f1">
<ul class="org-ul">
<li><p>fatal error on zero</p></li>
<li><p>the test of zero? is for less core dump</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"link-&gt;next-link"</span>, link_to_next_link
  <span style="color: #FF8888;">;; &lt;&lt; link -- next-link &gt;&gt;</span>
  <span style="color: #66d9ef; font-weight: bold;">xx</span> get
  <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org485f6c" class="outline-3">
<h3 id="org485f6c">link-&gt;name-string</h3>
<div class="outline-text-3" id="text-org485f6c">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"link-&gt;name-string"</span>, link_to_name_string
   <span style="color: #FF8888;">;; &lt;&lt; link -- string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, offset__link$string_address, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> n_get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad42f93" class="outline-3">
<h3 id="orgad42f93">link-&gt;jo</h3>
<div class="outline-text-3" id="text-orgad42f93">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"link-&gt;jo"</span>, link_to_jo
   <span style="color: #FF8888;">;; &lt;&lt; link -- jo &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, offset__link$jo, addition, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4354d3" class="outline-3">
<h3 id="org4354d3">link,set-jo</h3>
<div class="outline-text-3" id="text-org4354d3">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"link,set-jo"</span>, link__set_jo
   <span style="color: #FF8888;">;; &lt;&lt; jo, link -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, offset__link$jo, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf8e244" class="outline-3">
<h3 id="orgdf8e244"><b>link</b></h3>
<div class="outline-text-3" id="text-orgdf8e244">
<ul class="org-ul">
<li><p>a link is the first jo in the link</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"*link*"</span>, V__link
   <span style="color: #66d9ef; font-weight: bold;">xx</span> the_last_link_in_assembly_code
</pre>
</div>
</div>
</div>

<div id="outline-container-orge365ca8" class="outline-3">
<h3 id="orge365ca8"><span class="todo note">note</span> about find</h3>
<div class="outline-text-3" id="text-orge365ca8">
<ul class="org-ul">
<li><p>a function whoes name is prefixed by "find"</p><p>maybe fail to find</p><p>and maybe returns a signal</p><p>to inform the function who calls it</p></li></ul>
</div>
</div>

<div id="outline-container-org99a163c" class="outline-3">
<h3 id="org99a163c"><span class="todo _">記</span> 遍歷鏈表的方式</h3>
<div class="outline-text-3" id="text-org99a163c">
<ul class="org-ul">
<li><p>循環進行的方式是</p><p><ol class="org-ol"></p><p><li>保證循環開始時 所得到的 jo 不是最後一個</li></p><p><li>處理這個 jo</li></p><p><li>看看這個 jo 是否是最後一個</p><p><ul class="org-ul"></p><p><li><p>如果是</p><p>退出</p></li></p><p><li><p>如果不是</p><p>取下一個 jo 以循環</p></li></ul></li></ol></p></li></ul>
</div>
</div>
