cicada-nymph.org
** find-link
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "find-link", find_link
      ;; << word[address, length], link
      ;;    -- link, true
      ;;    -- false >>
      xx xxtuckx
      xx link_to_name_string, xxoverxx

      ;; xx xxoverxx
      ;; xx xxoverxx
      ;; xx write_string, literal, 32, write_byte
      ;; xx write_string, literal, 10, write_byte

      xx string_equal?, false?branch, 4
      xx   drop2, true
      xx   end
      xx xswapxx
      xx dup, last_link?, false?branch, 5
      xx   drop, drop2
      xx   false
      xx   end
      xx link_to_next_link
      xx tail_call, find_link
   #+end_src
* basic-REPL
** word-interpreter
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "word-interpreter", word_interpreter
      ;; << word[address, length] -- unknown >>
      xx dup2, integer_string?, false?branch, 3
      xx   string_to_integer
      xx   end
      ;; maybe more

      xx dup2 ;; for to report undefined word
      xx V__link
      xx find_link, false?branch, 6
      xx   xxswapx, drop2
      xx   link_to_jo, apply
      xx   end

      xx write_undefined_word_report__for_word_interpreter
      xx write_string
      xx literal, 10
      xx write_byte
      xx end


   define_function "write-undefined-word-report,for-word-interpreter", write_undefined_word_report__for_word_interpreter
      ;; << -- >>
      xx literal, string$undefined_word_report__for_word_interpreter
      xx literal, length$undefined_word_report__for_word_interpreter
      xx write_string
      xx end

   string$undefined_word_report__for_word_interpreter:
      db "* (word-interpreter) meets undefined word : "
   .end:
   length$undefined_word_report__for_word_interpreter = (.end - string$undefined_word_report__for_word_interpreter)
   #+end_src
** basic-REPL
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "basic-REPL", basic_REPL
      ;; << unknown -- unknown >>
      xx read_word
      xx word_interpreter
      xx tail_call, basic_REPL
   #+end_src
* -----------------------------------
* colon semicolon
** note
   * from the aesthetics point of view
     I do NOT think which of the following is better then the other
     but I choose the second one
   * first
     #+begin_src
     define-function factorial
       << n -- n! >>
       dup one? if
         end
       then
       dup sub1 factorial mul
       end
     end
     #+end_src
   * second
     #+begin_src cicada-nymph
     : factorial
       << n -- n! >>
       dup one? if
         end
       then
       dup sub1 factorial mul
       end
     ; define-function
     #+end_src
** [colon|semicolon]-string?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "colon-string?", colon_string?
      ;; << string[address, length] -- bool >>
      xx literal, ':'
      xx one_byte_string?
      xx end

   define_function "semicolon-string?", semicolon_string?
      ;; << string[address, length] -- bool >>
      xx literal, ';'
      xx one_byte_string?
      xx end
   #+end_src
** comment-[begin|end]-string?
   #+begin_src fasm :tangle cicada-nymph.fasm
   string$comment_begin:
      db "<<"

   define_function "comment-begin-string?", comment_begin_string?
      ;; << string[address, length] -- bool >>
      xx literal, string$comment_begin
      xx literal, 2
      xx string_equal?
      xx end


   string$comment_end:
      db ">>"

   define_function "comment-end-string?", comment_end_string?
      ;; << -- >>
      xx literal, string$comment_end
      xx literal, 2
      xx string_equal?
      xx end
   #+end_src
