cicada-nymph.html

<div id="outline-container-orga76c9d" class="outline-3">
<h3 id="orga76c9d">find-link</h3>
<div class="outline-text-3" id="text-orga76c9d">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"find-link"</span>, find_link
   <span style="color: #FF8888;">;; &lt;&lt; word[address, length], link</span>
   <span style="color: #FF8888;">;;    -- link, true</span>
   <span style="color: #FF8888;">;;    -- false &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxtuckx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> link_to_name_string, xxoverxx

   <span style="color: #FF8888;">;; xx xxoverxx</span>
   <span style="color: #FF8888;">;; xx xxoverxx</span>
   <span style="color: #FF8888;">;; xx write_string, literal, 32, write_byte</span>
   <span style="color: #FF8888;">;; xx write_string, literal, 10, write_byte</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xswapxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, last_link?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">5</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> link_to_next_link
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, find_link
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9ed96e4" class="outline-2">
<h2 id="org9ed96e4">basic-REPL</h2>
<div class="outline-text-2" id="text-org9ed96e4">
</div><div id="outline-container-org78d5cd7" class="outline-3">
<h3 id="org78d5cd7">word-interpreter</h3>
<div class="outline-text-3" id="text-org78d5cd7">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"word-interpreter"</span>, word_interpreter
   <span style="color: #FF8888;">;; &lt;&lt; word[address, length] -- unknown &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, integer_string?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   string_to_integer
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #FF8888;">;; maybe more</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2 <span style="color: #FF8888;">;; for to report undefined word</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__link
   <span style="color: #66d9ef; font-weight: bold;">xx</span> find_link, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">6</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xxswapx, drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   link_to_jo, apply
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_undefined_word_report__for_word_interpreter
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">10</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>


define_function <span style="color: #e6db74;">"write-undefined-word-report,for-word-interpreter"</span>, write_undefined_word_report__for_word_interpreter
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$undefined_word_report__for_word_interpreter
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, length$undefined_word_report__for_word_interpreter
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

<span style="color: #a6e22e;">string$undefined_word_report__for_word_interpreter</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"* (word-interpreter) meets undefined word : "</span>
<span style="color: #a6e22e;">.end</span>:
length$undefined_word_report__for_word_interpreter = (.end - string$undefined_word_report__for_word_interpreter)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe4f120" class="outline-3">
<h3 id="orgfe4f120">basic-REPL</h3>
<div class="outline-text-3" id="text-orgfe4f120">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"basic-REPL"</span>, basic_REPL
   <span style="color: #FF8888;">;; &lt;&lt; unknown -- unknown &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> read_word
   <span style="color: #66d9ef; font-weight: bold;">xx</span> word_interpreter
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, basic_REPL
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org2e7af8b" class="outline-2">
<h2 id="org2e7af8b">colon semicolon</h2>
<div class="outline-text-2" id="text-org2e7af8b">
</div><div id="outline-container-org9a75f2c" class="outline-3">
<h3 id="org9a75f2c"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-org9a75f2c">
<ul class="org-ul">
<li><p>from the aesthetics point of view</p><p>I do NOT think which of the following is better then the other</p><p>but I choose the second one</p></li>
<li><p><p></p><p>first</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-nymph">define-function factorial</p><p>  <span style="color: #FF8888;">&lt;&lt; n -- n! &gt;&gt;</span></p><p>  dup <span style="color: #ffffff; font-weight: bold;">one?</span> <span style="color: #f92672; font-weight: bold;">if</span></p><p>    <span style="color: #00ffff; font-weight: bold;">end</span></p><p>  <span style="color: #f92672; font-weight: bold;">then</span></p><p>  dup sub1 factorial mul</p><p>  <span style="color: #00ffff; font-weight: bold;">end</span></p><p><span style="color: #00ffff; font-weight: bold;">end</span></p><p></pre></p><p></div></p></li>
<li><p><p></p><p>second</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">factorial</span></p><p>  <span style="color: #FF8888;">&lt;&lt; n -- n! &gt;&gt;</span></p><p>  dup <span style="color: #ffffff; font-weight: bold;">one?</span> <span style="color: #f92672; font-weight: bold;">if</span></p><p>    <span style="color: #00ffff; font-weight: bold;">end</span></p><p>  <span style="color: #f92672; font-weight: bold;">then</span></p><p>  dup sub1 factorial mul</p><p>  <span style="color: #00ffff; font-weight: bold;">end</span></p><p><span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>

<div id="outline-container-orge3f9a9d" class="outline-3">
<h3 id="orge3f9a9d">[colon|semicolon]-string?</h3>
<div class="outline-text-3" id="text-orge3f9a9d">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"colon-string?"</span>, colon_string?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">':'</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> one_byte_string?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"semicolon-string?"</span>, semicolon_string?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">';'</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> one_byte_string?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb866435" class="outline-3">
<h3 id="orgb866435">comment-[begin|end]-string?</h3>
<div class="outline-text-3" id="text-orgb866435">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">string$comment_begin</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"&lt;&lt;"</span>

define_function <span style="color: #e6db74;">"comment-begin-string?"</span>, comment_begin_string?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$comment_begin
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>


<span style="color: #a6e22e;">string$comment_end</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"&gt;&gt;"</span>

define_function <span style="color: #e6db74;">"comment-end-string?"</span>, comment_end_string?
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$comment_end
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
