cicada-nymph.org
** colon & semicolon
   * nested : ; is NOT allow
     and no error check for it
   #+begin_src fasm :tangle cicada-nymph.fasm
   buffer$colon labeling
      preserve 1024 * 1024

   cursor$colon:
      xx 0

   length$colon:
      xx 0

   define_function ":", colon
      ;; << -- string[address of buffer$colon, length] >>
      xx literal, buffer$colon
      xx literal, cursor$colon, set
      xx colon__loop
      ;; address
      xx literal, buffer$colon
      ;; length
      xx literal, cursor$colon, get
      xx literal, buffer$colon
      xx subtraction
      xx dup, literal, length$colon, set
      xx end

   define_function "colon,loop", colon__loop
      ;; << -- >>
      xx read_byte
      xx colon__set_byte
      xx colon__meet_end?, false?branch, 7
      xx   literal, 3 ;; for the string " ; "
      xx   literal, cursor$colon
      xx   sub_set
      xx   end
      xx tail_call, colon__loop

   define_function "colon,set-byte", colon__set_byte
      ;; << byte -- >>
      xx literal, cursor$colon, get
      xx set_byte
      xx one
      xx literal, cursor$colon
      xx add_set
      xx end

   define_function "colon,meet-end?", colon__meet_end?
      ;; << -- bool >>
      xx literal, cursor$colon, get
      xx literal, 3, subtraction
      xx get_byte, space_byte?
      xx false?, false?branch, 3
      xx   false
      xx   end
      xx literal, cursor$colon, get
      xx literal, 2, subtraction
      xx get_byte, literal, ';', equal?
      xx false?, false?branch, 3
      xx   false
      xx   end
      xx literal, cursor$colon, get
      xx literal, 1, subtraction
      xx get_byte, space_byte?
      xx false?, false?branch, 3
      xx   false
      xx   end
      xx true
      xx end
   #+end_src
** ignore-comment
   * this function is for basic-REPL
     but it is reused by colon
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "<<", ignore_comment
      ;; << -- >>
      xx read_word
      xx dup2, comment_begin_string?, false?branch, 5
      xx   drop2
      xx     ignore_comment ;; for the new nested-comment
      xx   tail_call, ignore_comment ;; for the rest-comment
      xx dup2, comment_end_string?, false?branch, 3
      xx   drop2
      xx   end
      xx drop2
      xx tail_call, ignore_comment
   #+end_src
** test
   #+begin_src cicada-nymph
   1 << 989 >> 64 add .
   << 65 >>

   : kkk << 989 << 989 >> >> ; .s
   << kkk >>
   #+end_src
* jojo-area
** note
   * you can see how the naming convention is used
     for functions that create structured data into memory
** memory allocation
   #+begin_src fasm :tangle cicada-nymph.fasm
   size$jojo_area = 1024 * 1024 * cell_size

   define_variable "*jojo-area*", V__jojo_area
     xx address$jojo_area

   define_variable "*jojo-area,size*", V__jojo_area__size
     xx size$jojo_area


   address$jojo_area labeling
      preserve size$jojo_area

   define_variable "*jojo-area,current-free-address*", V__jojo_area__current_free_address
      xx address$jojo_area
   #+end_src
** jojo-area,stay
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jojo-area,stay", jojo_area__stay
      ;; << number -- >>
      xx V__jojo_area__current_free_address
      xx set
      xx literal, cell_size
      xx address, V__jojo_area__current_free_address
      xx add_set
      xx end
   #+end_src
