cicada-nymph.html

<div id="outline-container-orgbbdb82e" class="outline-3">
<h3 id="orgbbdb82e">colon &amp; semicolon</h3>
<div class="outline-text-3" id="text-orgbbdb82e">
<ul class="org-ul">
<li><p>nested : ; is NOT allow</p><p>and no error check for it</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">buffer$colon <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> <span style="color: #ae81ff;">1024</span> * <span style="color: #ae81ff;">1024</span>

<span style="color: #a6e22e;">cursor$colon</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">0</span>

<span style="color: #a6e22e;">length$colon</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">0</span>

define_function <span style="color: #e6db74;">":"</span>, colon
   <span style="color: #FF8888;">;; &lt;&lt; -- string[address of buffer$colon, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$colon
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$colon, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> colon__loop
   <span style="color: #FF8888;">;; address</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$colon
   <span style="color: #FF8888;">;; length</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$colon, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, buffer$colon
   <span style="color: #66d9ef; font-weight: bold;">xx</span> subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, <span style="color: #f92672; font-weight: bold;">literal</span>, length$colon, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"colon,loop"</span>, colon__loop
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> read_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> colon__set_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> colon__meet_end?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">7</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">3</span> <span style="color: #FF8888;">;; for the string " ; "</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$colon
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   sub_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, colon__loop

define_function <span style="color: #e6db74;">"colon,set-byte"</span>, colon__set_byte
   <span style="color: #FF8888;">;; &lt;&lt; byte -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$colon, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> set_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> one
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$colon
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"colon,meet-end?"</span>, colon__meet_end?
   <span style="color: #FF8888;">;; &lt;&lt; -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$colon, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">3</span>, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get_byte, space_byte?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$colon, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">2</span>, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get_byte, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">';'</span>, equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$colon, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">1</span>, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get_byte, space_byte?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> true
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd66f701" class="outline-3">
<h3 id="orgd66f701">ignore-comment</h3>
<div class="outline-text-3" id="text-orgd66f701">
<ul class="org-ul">
<li><p>this function is for basic-REPL</p><p>but it is reused by colon</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"&lt;&lt;"</span>, ignore_comment
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> read_word
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, comment_begin_string?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">5</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     ignore_comment <span style="color: #FF8888;">;; for the new nested-comment</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">tail_call</span>, ignore_comment <span style="color: #FF8888;">;; for the rest-comment</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, comment_end_string?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, ignore_comment
</pre>
</div>
</div>
</div>

<div id="outline-container-org4c0c4f4" class="outline-3">
<h3 id="org4c0c4f4"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-org4c0c4f4">
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #fd971f; font-weight: bold;">1</span> <span style="color: #FF8888;">&lt;&lt; 989 &gt;&gt;</span> <span style="color: #fd971f; font-weight: bold;">64</span> add .
<span style="color: #FF8888;">&lt;&lt; 65 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">kkk</span> <span style="color: #FF8888;">&lt;&lt; 989 &lt;&lt; 989 &gt;&gt;</span> &gt;&gt; <span style="color: #ffff00; font-weight: bold;">;</span> .s
<span style="color: #FF8888;">&lt;&lt; kkk &gt;&gt;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6f7d4a2" class="outline-2">
<h2 id="org6f7d4a2">jojo-area</h2>
<div class="outline-text-2" id="text-org6f7d4a2">
</div><div id="outline-container-orgd662b74" class="outline-3">
<h3 id="orgd662b74"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-orgd662b74">
<ul class="org-ul">
<li><p>you can see how the naming convention is used</p><p>for functions that create structured data into memory</p></li></ul>
</div>
</div>

<div id="outline-container-org90ce64" class="outline-3">
<h3 id="org90ce64">memory allocation</h3>
<div class="outline-text-3" id="text-org90ce64">
<div class="org-src-container">

<pre class="src src-fasm">size$jojo_area = <span style="color: #ae81ff;">1024</span> * <span style="color: #ae81ff;">1024</span> * cell_size

define_variable <span style="color: #e6db74;">"*jojo-area*"</span>, V__jojo_area
  <span style="color: #66d9ef; font-weight: bold;">xx</span> address$jojo_area

define_variable <span style="color: #e6db74;">"*jojo-area,size*"</span>, V__jojo_area__size
  <span style="color: #66d9ef; font-weight: bold;">xx</span> size$jojo_area


address$jojo_area <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> size$jojo_area

define_variable <span style="color: #e6db74;">"*jojo-area,current-free-address*"</span>, V__jojo_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$jojo_area
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc32cd41" class="outline-3">
<h3 id="orgc32cd41">jojo-area,stay</h3>
<div class="outline-text-3" id="text-orgc32cd41">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jojo-area,stay"</span>, jojo_area__stay
   <span style="color: #FF8888;">;; &lt;&lt; number -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__jojo_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">address</span>, V__jojo_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
