cicada-nymph.org
* make-link
  * link as data-structure
    |------+----------------|
    | link | next-link      |
    |------+----------------|
    |      | jo             |
    |      | string-address |
    |      | string-length  |
    |------+----------------|
  #+begin_src fasm :tangle cicada-nymph.fasm
  define_function "make-link", make_link
     ;; << string[address, length], next-link, jo -- link >>
     xx V__jojo_area__current_free_address
     xx xxxxswapx
     xx swap
     xx   jojo_area__stay
     xx   jojo_area__stay
     xx swap
     xx   jojo_area__stay
     xx   jojo_area__stay
     xx end
  #+end_src
* make-jo-head
  * jo as data-structure
    |----+----------------|
    |    | length         |
    |----+----------------|
    | jo | explainer      |
    |----+----------------|
    |    | body           |
    |----+----------------|
  #+begin_src fasm :tangle cicada-nymph.fasm
  define_function "make-jo-head", make_jo_head
     ;; << explainer, length -- jo >>
     xx   jojo_area__stay
     xx V__jojo_area__current_free_address
     xx swap
     xx   jojo_area__stay
     xx end
  #+end_src
* syntax-stack
** 記
   * *syntax-stack* 轉換語境
   * *syntax-rule-set:...* 添加語法
** memory allocate
   #+begin_src fasm :tangle cicada-nymph.fasm
      preserve cell_size * 64
   address$syntax_stack labeling
      preserve cell_size * 1024

   define_variable "syntax-stack:*address*", V__syntax_stack__address
      xx address$syntax_stack

   define_variable "syntax-stack:*pointer*", V__syntax_stack__pointer
      xx address$syntax_stack
   #+end_src
** push-syntax-stack
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "push-syntax-stack", push_syntax_stack
      ;; << syntax-set[address] -- >>
      xx V__syntax_stack__pointer
      xx set
      xx V__cell_size
      xx address, V__syntax_stack__pointer
      xx add_set
      xx end
   #+end_src
** pop-syntax-stack
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "pop-syntax-stack", pop_syntax_stack
      ;; << -- syntax-set[address] >>
      xx V__cell_size
      xx address, V__syntax_stack__pointer
      xx sub_set
      xx V__syntax_stack__pointer, get
      xx end
   #+end_src
** tos-syntax-stack
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "tos-syntax-stack", tos_syntax_stack
      ;; << -- syntax-set[address] >>
      xx V__syntax_stack__pointer
      xx V__cell_size
      xx subtraction
      xx get
      xx end
   #+end_src
** drop-syntax-stack
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "drop-syntax-stack", drop_syntax_stack
      ;; << -- >>
      xx V__cell_size
      xx address, V__syntax_stack__pointer
      xx sub_set
      xx end
   #+end_src
** syntax-stack-empty?
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "syntax-stack-empty?", syntax_stack_empty?
      ;; << -- bool >>
      xx V__syntax_stack__pointer
      xx literal, address$syntax_stack
      xx equal?
      xx end
   #+end_src
** find-syntax
   * only search the first syntax-rule-set in syntax-stack
     thus a switch of syntax will get you a clean syntax
    #+begin_src fasm :tangle cicada-nymph.fasm
    define_function "find-syntax", find_syntax
       ;; << word[address, length]
       ;;    -- function, true
       ;;    -- false >>
       xx syntax_stack_empty?, false?branch, 4
       xx   drop2
       xx   false
       xx   end
       xx tos_syntax_stack
       xx syntax_rule_set__find
       xx end
   #+end_src
* syntax-rule-set
** 記 使用
   * syntax-rule-set:jojo-compiler 是
     語法謂詞 還有 語法函數 這種對子
     所形成的有序集合
     這樣就可以形成簡單的語境概念了
   * 每個語境都有責任
     在進入和退出時
     維護好 syntax-rule-set:jojo-compiler
   * 以 syntax 爲前綴的 function 的類型常常是
     1. 以 jojo-compiler 爲後綴時
        << jo, string[address, length], word[address, length]
        -- jo, string[address, length] >>
     2. 在 REPL 中使用時又可以是
        << word[address, length] -- integer >>
     所以在使用時
     一定要注意維護棧中的值的良好性
