cicada-nymph.html

<div id="outline-container-org947123" class="outline-2">
<h2 id="org947123">make-link</h2>
<div class="outline-text-2" id="text-org947123">
<ul class="org-ul">
<li><p><p></p><p>link as data-structure</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">link</th></p><p><th scope="col" class="org-left">next-link</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">jo</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">string-address</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">string-length</td></p><p></tr></p><p></tbody></p><p></table></p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"make-link"</span>, make_link
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], next-link, jo -- link &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__jojo_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxxxswapx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e68ae6" class="outline-2">
<h2 id="org3e68ae6">make-jo-head</h2>
<div class="outline-text-2" id="text-org3e68ae6">
<ul class="org-ul">
<li><p><p></p><p>jo as data-structure</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><thead></p><p><tr></p><p><th scope="col" class="org-left">&#xa0;</th></p><p><th scope="col" class="org-left">length</th></p><p></tr></p><p></thead></p><p><tbody></p><p><tr></p><p><td class="org-left">jo</td></p><p><td class="org-left">explainer</td></p><p></tr></p><p></tbody></p><p><tbody></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">body</td></p><p></tr></p><p></tbody></p><p></table></p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"make-jo-head"</span>, make_jo_head
   <span style="color: #FF8888;">;; &lt;&lt; explainer, length -- jo &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__jojo_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe79f82" class="outline-2">
<h2 id="orgbe79f82">syntax-stack</h2>
<div class="outline-text-2" id="text-orgbe79f82">
</div><div id="outline-container-orgdcf84cb" class="outline-3">
<h3 id="orgdcf84cb"><span class="todo _">記</span> </h3>
<div class="outline-text-3" id="text-orgdcf84cb">
<ul class="org-ul">
<li><p><b>syntax-stack</b> 轉換語境</p></li>
<li><p><b>syntax-rule-set:&#x2026;</b> 添加語法</p></li></ul>
</div>
</div>

<div id="outline-container-org80bd8fb" class="outline-3">
<h3 id="org80bd8fb">memory allocate</h3>
<div class="outline-text-3" id="text-org80bd8fb">
<div class="org-src-container">

<pre class="src src-fasm">   <span style="color: #66d9ef; font-weight: bold;">preserve</span> cell_size * <span style="color: #ae81ff;">64</span>
address$syntax_stack <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> cell_size * <span style="color: #ae81ff;">1024</span>

define_variable <span style="color: #e6db74;">"syntax-stack:*address*"</span>, V__syntax_stack__address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$syntax_stack

define_variable <span style="color: #e6db74;">"syntax-stack:*pointer*"</span>, V__syntax_stack__pointer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$syntax_stack
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0262f5" class="outline-3">
<h3 id="orgf0262f5">push-syntax-stack</h3>
<div class="outline-text-3" id="text-orgf0262f5">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"push-syntax-stack"</span>, push_syntax_stack
   <span style="color: #FF8888;">;; &lt;&lt; syntax-set[address] -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__syntax_stack__pointer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">address</span>, V__syntax_stack__pointer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b33a79" class="outline-3">
<h3 id="org6b33a79">pop-syntax-stack</h3>
<div class="outline-text-3" id="text-org6b33a79">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"pop-syntax-stack"</span>, pop_syntax_stack
   <span style="color: #FF8888;">;; &lt;&lt; -- syntax-set[address] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">address</span>, V__syntax_stack__pointer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> sub_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__syntax_stack__pointer, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbe7dd0" class="outline-3">
<h3 id="orgfbe7dd0">tos-syntax-stack</h3>
<div class="outline-text-3" id="text-orgfbe7dd0">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"tos-syntax-stack"</span>, tos_syntax_stack
   <span style="color: #FF8888;">;; &lt;&lt; -- syntax-set[address] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__syntax_stack__pointer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span> subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfd3d16" class="outline-3">
<h3 id="orgbfd3d16">drop-syntax-stack</h3>
<div class="outline-text-3" id="text-orgbfd3d16">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"drop-syntax-stack"</span>, drop_syntax_stack
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">address</span>, V__syntax_stack__pointer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> sub_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad8f2e7" class="outline-3">
<h3 id="orgad8f2e7">syntax-stack-empty?</h3>
<div class="outline-text-3" id="text-orgad8f2e7">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"syntax-stack-empty?"</span>, syntax_stack_empty?
   <span style="color: #FF8888;">;; &lt;&lt; -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__syntax_stack__pointer
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, address$syntax_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span> equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org20d6ed2" class="outline-3">
<h3 id="org20d6ed2">find-syntax</h3>
<div class="outline-text-3" id="text-org20d6ed2">
<ul class="org-ul">
<li><p><p></p><p>only search the first syntax-rule-set in syntax-stack</p><p>thus a switch of syntax will get you a clean syntax</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-fasm">define_function <span style="color: #e6db74;">"find-syntax"</span>, find_syntax</p><p>   <span style="color: #FF8888;">;; &lt;&lt; word[address, length]</span></p><p>   <span style="color: #FF8888;">;;    -- function, true</span></p><p>   <span style="color: #FF8888;">;;    -- false &gt;&gt;</span></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_stack_empty?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2</p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span>   false</p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> tos_syntax_stack</p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule_set__find</p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org5c361a6" class="outline-2">
<h2 id="org5c361a6">syntax-rule-set</h2>
<div class="outline-text-2" id="text-org5c361a6">
</div><div id="outline-container-org3396e3d" class="outline-3">
<h3 id="org3396e3d"><span class="todo _">記</span> 使用</h3>
<div class="outline-text-3" id="text-org3396e3d">
<ul class="org-ul">
<li><p>syntax-rule-set:jojo-compiler 是</p><p>語法謂詞 還有 語法函數 這種對子</p><p>所形成的有序集合</p><p>這樣就可以形成簡單的語境概念了</p></li>
<li><p>每個語境都有責任</p><p>在進入和退出時</p><p>維護好 syntax-rule-set:jojo-compiler</p></li>
<li><p><p></p><p>以 syntax 爲前綴的 function 的類型常常是</p><p></p></p><p><ol class="org-ol"></p><p><li>以 jojo-compiler 爲後綴時</p><p>&lt;&lt; jo, string[address, length], word[address, length]</p><p>&#x2013; jo, string[address, length] &gt;&gt;</li></p><p><li>在 REPL 中使用時又可以是</p><p>&lt;&lt; word[address, length] &#x2013; integer &gt;&gt;</li></ol></p><p><p></p><p>所以在使用時</p><p>一定要注意維護棧中的值的良好性</p><p></p></p></li></ul>
</div>
</div>
