cicada-nymph.org
** note border
   * border is current-free-address of syntax-rule-set
** 記 interface
   * structure
     | syntax-rule | predicate |
     |      | function  |
   * on stack
     << syntax-rule[predicate, function] >>
   * set is an ordered set
     its interface is as the following
     1. (add-syntax-rule)
        add a syntax-rule into syntax-rule-set
     2. (sub-syntax-rule)
        try to sub a syntax-rule from syntax-rule-set
        once a time
        if can not find the syntax-rule in the syntax-rule-set
        do nothing
     3. (find-syntax-rule)
        find a function from a word
     4. (list-syntax-rule)
** syntax-rule:*unit*
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "syntax-rule:*unit*", V__syntax_rule__unit
      xx (cell_size * 2)
   #+end_src
** syntax-rule:get-predicate
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "syntax-rule:get-predicate", syntax_rule__get_predicate
      ;; << syntax-rule[address] -- predicate >>
      xx get
      xx end
   #+end_src
** syntax-rule:get-function
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "syntax-rule:get-function", syntax_rule__get_function
      ;; << syntax-rule[address] -- function >>
      xx V__cell_size, addition
      xx get
      xx end
   #+end_src
** syntax-rule:get
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "syntax-rule:get", syntax_rule__get
      ;; << syntax-rule[address] -- syntax-rule[predicate, function] >>
      xx V__syntax_rule__unit, V__cell_size, division
      xx n_get
      xx end
   #+end_src
** syntax-rule-set:get-border
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "syntax-rule-set:get-border", syntax_rule_set__get_border
      ;; << syntax-rule-set -- border >>
      xx V__cell_size, subtraction
      xx get
      xx end
   #+end_src
** syntax-rule-set:set-border
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "syntax-rule-set:set-border", syntax_rule_set__set_border
      ;; << border, syntax-rule-set -- >>
      xx V__cell_size, subtraction
      xx set
      xx end
   #+end_src
** syntax-rule:add
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "syntax-rule:add", syntax_rule__add
      ;; << syntax-rule-set: syntax-rule[predicate, function] -- >>
      xx xoverxx
      xx syntax_rule_set__get_border
      xx literal, 2
      xx n_set
      xx dup
      xx syntax_rule_set__get_border
      xx V__cell_size, addition
      xx V__cell_size, addition
      xx swap
      xx syntax_rule_set__set_border
      xx end
   #+end_src
** syntax-rule-set:find
   #+begin_src fasm :tangle cicada-nymph.fasm
   cursor$syntax_rule_set__find:
      xx 0

   define_function "syntax-rule-set:find", syntax_rule_set__find
      ;; << word[address, length], syntax-rule-set
      ;;    -- function, true
      ;;    -- false >>
      xx dup, syntax_rule_set__get_border
      xx literal, cursor$syntax_rule_set__find, set
      xx syntax_rule_set__find__loop
      xx end

   define_function "syntax-rule-set:find,loop", syntax_rule_set__find__loop
      ;; << word[address, length], syntax-rule-set
      ;;    -- function, true
      ;;    -- false >>
      xx literal, cursor$syntax_rule_set__find, get
      xx over, equal?, false?branch, 5
      xx   drop, drop2
      xx   false
      xx   end
      xx xxoverx
      xx literal, cursor$syntax_rule_set__find, get
      xx V__syntax_rule__unit, subtraction
      xx syntax_rule__get_predicate
      xx apply, false?branch, (.not_found-$)/cell_size
      xx   drop, drop2
      xx   literal, cursor$syntax_rule_set__find, get
      xx   V__syntax_rule__unit, subtraction
      xx   syntax_rule__get_function
      xx   true
      xx   end
   .not_found:
      xx literal, cursor$syntax_rule_set__find, get
      xx V__cell_size, subtraction
      xx V__cell_size, subtraction
      xx literal, cursor$syntax_rule_set__find, set
      xx tail_call, syntax_rule_set__find__loop
   #+end_src
* jojo-compiler:*syntax-rule-set*
** ----------------------------------
