cicada-nymph.html

<div id="outline-container-orga360c3c" class="outline-3">
<h3 id="orga360c3c"><span class="todo note">note</span> border</h3>
<div class="outline-text-3" id="text-orga360c3c">
<ul class="org-ul">
<li><p>border is current-free-address of syntax-rule-set</p></li></ul>
</div>
</div>

<div id="outline-container-orgfd196c5" class="outline-3">
<h3 id="orgfd196c5"><span class="todo _">記</span> interface</h3>
<div class="outline-text-3" id="text-orgfd196c5">
<ul class="org-ul">
<li><p><p></p><p>structure</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></p><p><col  class="org-left" /></p><p></colgroup></p><p><tbody></p><p><tr></p><p><td class="org-left">syntax-rule</td></p><p><td class="org-left">predicate</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">&#xa0;</td></p><p><td class="org-left">function</td></p><p></tr></p><p></tbody></p><p></table></p></li>
<li><p>on stack</p><p>&lt;&lt; syntax-rule[predicate, function] &gt;&gt;</p></li>
<li><p>set is an ordered set</p><p>its interface is as the following</p><p><ol class="org-ol"></p><p><li>(add-syntax-rule)</p><p>add a syntax-rule into syntax-rule-set</li></p><p><li>(sub-syntax-rule)</p><p>try to sub a syntax-rule from syntax-rule-set</p><p>once a time</p><p>if can not find the syntax-rule in the syntax-rule-set</p><p>do nothing</li></p><p><li>(find-syntax-rule)</p><p>find a function from a word</li></p><p><li>(list-syntax-rule)</li></ol></p></li></ul>
</div>
</div>

<div id="outline-container-org8b4e4c8" class="outline-3">
<h3 id="org8b4e4c8">syntax-rule:*unit*</h3>
<div class="outline-text-3" id="text-org8b4e4c8">
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"syntax-rule:*unit*"</span>, V__syntax_rule__unit
   <span style="color: #66d9ef; font-weight: bold;">xx</span> (cell_size * <span style="color: #ae81ff;">2</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e88744" class="outline-3">
<h3 id="org3e88744">syntax-rule:get-predicate</h3>
<div class="outline-text-3" id="text-org3e88744">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"syntax-rule:get-predicate"</span>, syntax_rule__get_predicate
   <span style="color: #FF8888;">;; &lt;&lt; syntax-rule[address] -- predicate &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec7cb95" class="outline-3">
<h3 id="orgec7cb95">syntax-rule:get-function</h3>
<div class="outline-text-3" id="text-orgec7cb95">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"syntax-rule:get-function"</span>, syntax_rule__get_function
   <span style="color: #FF8888;">;; &lt;&lt; syntax-rule[address] -- function &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org83a85ec" class="outline-3">
<h3 id="org83a85ec">syntax-rule:get</h3>
<div class="outline-text-3" id="text-org83a85ec">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"syntax-rule:get"</span>, syntax_rule__get
   <span style="color: #FF8888;">;; &lt;&lt; syntax-rule[address] -- syntax-rule[predicate, function] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__syntax_rule__unit, V__cell_size, division
   <span style="color: #66d9ef; font-weight: bold;">xx</span> n_get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb090c98" class="outline-3">
<h3 id="orgb090c98">syntax-rule-set:get-border</h3>
<div class="outline-text-3" id="text-orgb090c98">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"syntax-rule-set:get-border"</span>, syntax_rule_set__get_border
   <span style="color: #FF8888;">;; &lt;&lt; syntax-rule-set -- border &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab651c0" class="outline-3">
<h3 id="orgab651c0">syntax-rule-set:set-border</h3>
<div class="outline-text-3" id="text-orgab651c0">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"syntax-rule-set:set-border"</span>, syntax_rule_set__set_border
   <span style="color: #FF8888;">;; &lt;&lt; border, syntax-rule-set -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org749d337" class="outline-3">
<h3 id="org749d337">syntax-rule:add</h3>
<div class="outline-text-3" id="text-org749d337">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"syntax-rule:add"</span>, syntax_rule__add
   <span style="color: #FF8888;">;; &lt;&lt; syntax-rule-set: syntax-rule[predicate, function] -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xoverxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule_set__get_border
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> n_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule_set__get_border
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule_set__set_border
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org701bbef" class="outline-3">
<h3 id="org701bbef">syntax-rule-set:find</h3>
<div class="outline-text-3" id="text-org701bbef">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">cursor$syntax_rule_set__find</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">0</span>

define_function <span style="color: #e6db74;">"syntax-rule-set:find"</span>, syntax_rule_set__find
   <span style="color: #FF8888;">;; &lt;&lt; word[address, length], syntax-rule-set</span>
   <span style="color: #FF8888;">;;    -- function, true</span>
   <span style="color: #FF8888;">;;    -- false &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, syntax_rule_set__get_border
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$syntax_rule_set__find, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule_set__find__loop
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"syntax-rule-set:find,loop"</span>, syntax_rule_set__find__loop
   <span style="color: #FF8888;">;; &lt;&lt; word[address, length], syntax-rule-set</span>
   <span style="color: #FF8888;">;;    -- function, true</span>
   <span style="color: #FF8888;">;;    -- false &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$syntax_rule_set__find, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> over, equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">5</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxoverx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$syntax_rule_set__find, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__syntax_rule__unit, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule__get_predicate
   <span style="color: #66d9ef; font-weight: bold;">xx</span> apply, <span style="color: #f92672; font-weight: bold;">false?branch</span>, (.not_found-$)/cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$syntax_rule_set__find, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   V__syntax_rule__unit, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   syntax_rule__get_function
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
<span style="color: #a6e22e;">.not_found</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$syntax_rule_set__find, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$syntax_rule_set__find, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, syntax_rule_set__find__loop
</pre>
</div>
</div>
</div>
</div>
