cicada-nymph.org
** note
   * a syntax is a function to be called at compile time
     with a string to be compiled as one argument
     and do side-effect to store data into memory
     and return a shorter string
     [this can be viewed as moving a cursor forward]
** ----------------------------------
** jojo-compiler-syntax:integer-string
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jojo-compiler-syntax:integer-string", jojo_compiler_syntax__integer_string
      ;; << string[address, length], word[address, length] --
      ;;    string[address, length] >>
      xx literal, literal
      xx   jojo_area__stay
      xx string_to_integer
      xx   jojo_area__stay
      xx end
   #+end_src
** ----------------------------------
** literal-word:address?
   #+begin_src fasm :tangle cicada-nymph.fasm
   string$word_is_address?:
      db "address"
   .end:
   length$word_is_address? = (.end - string$word_is_address?)

   define_function "literal-word:address?", word_is_address?
      ;; << word[address, length] -- bool >>
      xx literal, string$word_is_address?
      xx literal, length$word_is_address?
      xx string_equal?
      xx end
   #+end_src
** jojo-compiler-syntax:address
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jojo-compiler-syntax:address", jojo_compiler_syntax__address
      ;; << string[address, length], literal-word:address --
      ;;    string[address, length] >>
      xx drop2
      xx literal, address
      xx   jojo_area__stay
      xx end
   #+end_src
** ----------------------------------
** literal-word:jo?
   #+begin_src fasm :tangle cicada-nymph.fasm
   string$word_is_jo?:
      db "jo"
   .end:
   length$word_is_jo? = (.end - string$word_is_jo?)

   define_function "literal-word:jo?", word_is_jo?
      ;; << word[address, length] -- bool >>
      xx literal, string$word_is_jo?
      xx literal, length$word_is_jo?
      xx string_equal?
      xx end
   #+end_src
** jojo-compiler-syntax:jo
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jojo-compiler-syntax:jo", jojo_compiler_syntax__jo
      ;; << string[address, length], literal-word:jo --
      ;;    string[address, length] >>
      xx drop2
      xx literal, literal
      xx   jojo_area__stay
      xx end
   #+end_src
** ----------------------------------
** literal-word:double-quote?
   #+begin_src fasm :tangle cicada-nymph.fasm
   string$word_is_double_quote?:
      db '"'
   .end:
   length$word_is_double_quote? = (.end - string$word_is_double_quote?)

   define_function "literal-word:double-quote?", word_is_double_quote?
      ;; << word[double-quote, length] -- bool >>
      xx literal, string$word_is_double_quote?
      xx literal, length$word_is_double_quote?
      xx string_equal?
      xx end
   #+end_src
