cicada-nymph.html

<div id="outline-container-orgd17150a" class="outline-2">
<h2 id="orgd17150a">jojo-compiler:*syntax-rule-set*</h2>
<div class="outline-text-2" id="text-orgd17150a">
</div><div id="outline-container-orgb22a029" class="outline-3">
<h3 id="orgb22a029"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-orgb22a029">
<ul class="org-ul">
<li><p>a syntax is a function to be called at compile time</p><p>with a string to be compiled as one argument</p><p>and do side-effect to store data into memory</p><p>and return a shorter string</p><p>[this can be viewed as moving a cursor forward]</p></li></ul>
</div>
</div>


<div id="outline-container-orgd892642" class="outline-3">
<h3 id="orgd892642">jojo-compiler-syntax:integer-string</h3>
<div class="outline-text-3" id="text-orgd892642">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jojo-compiler-syntax:integer-string"</span>, jojo_compiler_syntax__integer_string
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], word[address, length] --</span>
   <span style="color: #FF8888;">;;    string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #f92672; font-weight: bold;">literal</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_to_integer
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org31f40ce" class="outline-3">
<h3 id="org31f40ce">literal-word:address?</h3>
<div class="outline-text-3" id="text-org31f40ce">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">string$word_is_address?</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"address"</span>
<span style="color: #a6e22e;">.end</span>:
length$word_is_address? = (.end - string$word_is_address?)

define_function <span style="color: #e6db74;">"literal-word:address?"</span>, word_is_address?
   <span style="color: #FF8888;">;; &lt;&lt; word[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$word_is_address?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, length$word_is_address?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf4c94c" class="outline-3">
<h3 id="orgbf4c94c">jojo-compiler-syntax:address</h3>
<div class="outline-text-3" id="text-orgbf4c94c">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jojo-compiler-syntax:address"</span>, jojo_compiler_syntax__address
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], literal-word:address --</span>
   <span style="color: #FF8888;">;;    string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #f92672; font-weight: bold;">address</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org410343e" class="outline-3">
<h3 id="org410343e">literal-word:jo?</h3>
<div class="outline-text-3" id="text-org410343e">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">string$word_is_jo?</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"jo"</span>
<span style="color: #a6e22e;">.end</span>:
length$word_is_jo? = (.end - string$word_is_jo?)

define_function <span style="color: #e6db74;">"literal-word:jo?"</span>, word_is_jo?
   <span style="color: #FF8888;">;; &lt;&lt; word[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$word_is_jo?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, length$word_is_jo?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ccc610" class="outline-3">
<h3 id="org6ccc610">jojo-compiler-syntax:jo</h3>
<div class="outline-text-3" id="text-org6ccc610">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jojo-compiler-syntax:jo"</span>, jojo_compiler_syntax__jo
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], literal-word:jo --</span>
   <span style="color: #FF8888;">;;    string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #f92672; font-weight: bold;">literal</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org92bb4d1" class="outline-3">
<h3 id="org92bb4d1">literal-word:double-quote?</h3>
<div class="outline-text-3" id="text-org92bb4d1">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">string$word_is_double_quote?</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">'"'</span>
<span style="color: #a6e22e;">.end</span>:
length$word_is_double_quote? = (.end - string$word_is_double_quote?)

define_function <span style="color: #e6db74;">"literal-word:double-quote?"</span>, word_is_double_quote?
   <span style="color: #FF8888;">;; &lt;&lt; word[double-quote, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$word_is_double_quote?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, length$word_is_double_quote?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_equal?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
