cicada-nymph.org
** syntax,double-quote,jojo-compiler
   * string-area is used
     to allocate string literal in function body
   * in ASCII encode double-quote is 34
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "syntax,double-quote,jojo-compiler", syntax__double_quote__jojo_compiler
      ;; << string[address, length], literal-word:double-quote --
      ;;    string[address, length] >>
      xx drop2

      xx dup2
      xx literal, '"', string__find_byte
      xx false?branch, (.not_found-$)/cell_size
      xx   xoverxx, subtraction
      ;;   << string[address, length], new-length >>
      xx   xxtuckx
      xx   xoverxx, swap
      xx   make_string
      ;;   << new-length
      ;;      string[address, length]
      ;;      string[address, new-length] >>
      xx   swap
      ;;   address
      xx   literal, literal
      xx     jojo_area__stay
      xx     jojo_area__stay
      ;;   new-length
      xx   literal, literal
      xx     jojo_area__stay
      xx     jojo_area__stay
      ;;   << new-length
      ;;      string[address, length] >>
      xx   xoverxx, subtraction
      xx   xxswapx
      xx   addition
      xx   swap
      xx   string__byte_tail ;; over the ending double-quote
      xx   end

      .not_found:
      xx write_not_integer_string_report__for_double_quote
      xx literal, 10, write_byte
      xx end


   define_function "write-not-integer-string-report,for-double-quote", write_not_integer_string_report__for_double_quote
      ;; << -- >>
      xx literal, string$not_integer_string_report__for_double_quote
      xx literal, length$not_integer_string_report__for_double_quote
      xx write_string
      xx end

   string$not_integer_string_report__for_double_quote:
      db "* (syntax,double-quote,jojo-compiler) can not find the ending double-quote"
   .end:
   length$not_integer_string_report__for_double_quote = (.end - string$not_integer_string_report__for_double_quote)
   #+end_src
** ----------------------------------
** note
   * comment can not cross ";"
** syntax,comment,jojo-compiler
   * nested << >> must be handled
   * note that
     syntax,comment,jojo-compiler is a syntax
     its interface is special
     thus
     when implement it as one recursive function
     the structure of the function is special
     otherwise
     just implement it by two functions
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "syntax,comment,jojo-compiler", syntax__comment__jojo_compiler
      ;; << string[address, length], word --
      ;;    string[address, length] >>
      xx drop2
      xx dup2, space_string?, false?branch, 2
      xx   end
      xx dup2
      xx string__word_tail, xxswapxx
      xx string__word
      xx dup2, comment_end_string?, false?branch, 3
      xx   drop2
      xx   end
      xx dup2, comment_begin_string?, CICADA__not, false?branch, 3
      xx   tail_call, syntax__comment__jojo_compiler
      ;; nested
      xx syntax__comment__jojo_compiler
      xx dup2, space_string?, false?branch, 2
      xx   end
      xx dup2
      xx string__word_tail, xxswapxx
      xx string__word
      xx tail_call, syntax__comment__jojo_compiler
   #+end_src
** ----------------------------------
** memory allocation
   #+begin_src fasm :tangle cicada-nymph.fasm
   size$syntax_rule_set__jojo_compiler = 1024 * cell_size

   cursor$syntax_rule_set__jojo_compiler:
      xx address$syntax_rule_set__jojo_compiler
   address$syntax_rule_set__jojo_compiler:
      times size$syntax_rule_set__jojo_compiler db 0
   #+end_src
** jojo-compiler:*syntax-rule-set*
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "jojo-compiler:*syntax-rule-set*", V__syntax_rule_set__jojo_compiler
      xx address$syntax_rule_set__jojo_compiler
   #+end_src
