cicada-nymph.html

<div id="outline-container-org4c7b403" class="outline-3">
<h3 id="org4c7b403">syntax,double-quote,jojo-compiler</h3>
<div class="outline-text-3" id="text-org4c7b403">
<ul class="org-ul">
<li><p>string-area is used</p><p>to allocate string literal in function body</p></li>
<li><p>in ASCII encode double-quote is 34</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"syntax,double-quote,jojo-compiler"</span>, syntax__double_quote__jojo_compiler
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], literal-word:double-quote --</span>
   <span style="color: #FF8888;">;;    string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2

   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">'"'</span>, string__find_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">false?branch</span>, (.not_found-$)/cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xoverxx, subtraction
   <span style="color: #FF8888;">;;   &lt;&lt; string[address, length], new-length &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xxtuckx
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xoverxx, swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   make_string
   <span style="color: #FF8888;">;;   &lt;&lt; new-length</span>
   <span style="color: #FF8888;">;;      string[address, length]</span>
   <span style="color: #FF8888;">;;      string[address, new-length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   swap
   <span style="color: #FF8888;">;;   address</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #f92672; font-weight: bold;">literal</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     jojo_area__stay
   <span style="color: #FF8888;">;;   new-length</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #f92672; font-weight: bold;">literal</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     jojo_area__stay
   <span style="color: #FF8888;">;;   &lt;&lt; new-length</span>
   <span style="color: #FF8888;">;;      string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xoverxx, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xxswapx
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   swap
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   string__byte_tail <span style="color: #FF8888;">;; over the ending double-quote</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>

   <span style="color: #a6e22e;">.not_found</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_not_integer_string_report__for_double_quote
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">10</span>, write_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>


define_function <span style="color: #e6db74;">"write-not-integer-string-report,for-double-quote"</span>, write_not_integer_string_report__for_double_quote
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$not_integer_string_report__for_double_quote
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, length$not_integer_string_report__for_double_quote
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

<span style="color: #a6e22e;">string$not_integer_string_report__for_double_quote</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"* (syntax,double-quote,jojo-compiler) can not find the ending double-quote"</span>
<span style="color: #a6e22e;">.end</span>:
length$not_integer_string_report__for_double_quote = (.end - string$not_integer_string_report__for_double_quote)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgad1b185" class="outline-3">
<h3 id="orgad1b185"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-orgad1b185">
<ul class="org-ul">
<li><p>comment can not cross ";"</p></li></ul>
</div>
</div>

<div id="outline-container-orgdc6e51e" class="outline-3">
<h3 id="orgdc6e51e">syntax,comment,jojo-compiler</h3>
<div class="outline-text-3" id="text-orgdc6e51e">
<ul class="org-ul">
<li><p>nested &lt;&lt; &gt;&gt; must be handled</p></li>
<li><p>note that</p><p>syntax,comment,jojo-compiler is a syntax</p><p>its interface is special</p><p>thus</p><p>when implement it as one recursive function</p><p>the structure of the function is special</p><p>otherwise</p><p>just implement it by two functions</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"syntax,comment,jojo-compiler"</span>, syntax__comment__jojo_compiler
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], word --</span>
   <span style="color: #FF8888;">;;    string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, space_string?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word_tail, xxswapxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, comment_end_string?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, comment_begin_string?, CICADA__not, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">tail_call</span>, syntax__comment__jojo_compiler
   <span style="color: #FF8888;">;; nested</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax__comment__jojo_compiler
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, space_string?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word_tail, xxswapxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, syntax__comment__jojo_compiler
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc37e0a3" class="outline-3">
<h3 id="orgc37e0a3">memory allocation</h3>
<div class="outline-text-3" id="text-orgc37e0a3">
<div class="org-src-container">

<pre class="src src-fasm">size$syntax_rule_set__jojo_compiler = <span style="color: #ae81ff;">1024</span> * cell_size

<span style="color: #a6e22e;">cursor$syntax_rule_set__jojo_compiler</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$syntax_rule_set__jojo_compiler
<span style="color: #a6e22e;">address$syntax_rule_set__jojo_compiler</span>:
   <span style="color: #f92672; font-weight: bold;">times</span> size$syntax_rule_set__jojo_compiler <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #ae81ff;">0</span>
</pre>
</div>
</div>
</div>
