cicada-nymph.org
** init,syntax-rule-set:jojo-compiler
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "init,syntax-rule-set:jojo-compiler", init__syntax_rule_set__jojo_compiler
      ;; << -- >>
      xx V__syntax_rule_set__jojo_compiler

      xx dup
      xx literal, integer_string?
      xx literal, jojo_compiler_syntax__integer_string
      xx syntax_rule__add

      xx dup
      xx literal, word_is_address?
      xx literal, jojo_compiler_syntax__address
      xx syntax_rule__add

      xx dup
      xx literal, word_is_jo?
      xx literal, jojo_compiler_syntax__jo
      xx syntax_rule__add

      xx dup
      xx literal, word_is_double_quote?
      xx literal, syntax__double_quote__jojo_compiler
      xx syntax_rule__add

      xx dup
      xx literal, local_variable_set_word?
      xx literal, jojo_compiler_syntax__local_variable_set
      xx syntax_rule__add

      xx dup
      xx literal, local_variable_get_word?
      xx literal, jojo_compiler_syntax__local_variable_get
      xx syntax_rule__add

      xx literal, comment_begin_string?
      xx literal, syntax__comment__jojo_compiler
      xx syntax_rule__add

      xx end
   #+end_src
** ----------------------------------
* jojo-compiler
** note
   * the jojo-compiler is a macro dispatcher
     it can be viewed as make-function-body
     it gets next word and use predicates on word to do dispatch
   * note that
     jojo-compiler can be viewed as the "compiler" of the cicada-nymph
     it does NOT (can not) compile file to file
     but creates structured data directly into memory
** jojo-compiler,dispatch-word
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jojo-compiler,dispatch-word", jojo_compiler__dispatch_word
      ;; << jo, string[address, length], word[address, length] --
      ;;    jo, string[address, length] >>
      xx dup2
      xx find_syntax, false?branch, 3
      xx   apply
      xx   end
      xx dup2
      xx V__link
      xx find_link, false?branch, 6
      xx   xxswapx, drop2
      xx   link_to_jo
      xx   jojo_area__stay
      xx   end
      xx write_undefined_word_report__for_jojo_compiler
      xx write_string
      xx literal, 10, write_byte
      xx end

   define_function "write-undefined-word-report,for-jojo-compiler", write_undefined_word_report__for_jojo_compiler
      ;; << -- >>
      xx literal, string$undefined_word_report__for_jojo_compiler
      xx literal, length$undefined_word_report__for_jojo_compiler
      xx write_string
      xx end

   string$undefined_word_report__for_jojo_compiler:
      db "* (jojo-compiler) meets undefined word : "
   .end:
   length$undefined_word_report__for_jojo_compiler = (.end - string$undefined_word_report__for_jojo_compiler)
   #+end_src
** jojo-compiler
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "jojo-compiler", jojo_compiler
      ;; << jo, string[address, length] -- >>
      xx local_variable_table__clear
      xx V__syntax_rule_set__jojo_compiler, push_syntax_stack
      xx jojo_compiler__loop
      xx drop_syntax_stack
      xx end

   define_function "jojo-compiler,loop", jojo_compiler__loop
      ;; << jo, string[address, length] -- >>
      xx dup2, space_string?, false?branch, 4
      xx   drop2, drop
      xx   end
      xx dup2
      xx string__word_tail
      xx xxswapxx
      xx string__word
      ;; << tail[address, length], head[address, length] >>
      xx jojo_compiler__dispatch_word
      xx tail_call, jojo_compiler__loop
   #+end_src
* define-function
** note
   * for the following function
     I add the "CICADA__" as prefix
     to distinguish from their assembly code version
