cicada-nymph.html

<div id="outline-container-org757600b" class="outline-3">
<h3 id="org757600b">jojo-compiler:*syntax-rule-set*</h3>
<div class="outline-text-3" id="text-org757600b">
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"jojo-compiler:*syntax-rule-set*"</span>, V__syntax_rule_set__jojo_compiler
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$syntax_rule_set__jojo_compiler
</pre>
</div>
</div>
</div>

<div id="outline-container-org656395c" class="outline-3">
<h3 id="org656395c">init,syntax-rule-set:jojo-compiler</h3>
<div class="outline-text-3" id="text-org656395c">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"init,syntax-rule-set:jojo-compiler"</span>, init__syntax_rule_set__jojo_compiler
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__syntax_rule_set__jojo_compiler

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, integer_string?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, jojo_compiler_syntax__integer_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule__add

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, word_is_address?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, jojo_compiler_syntax__address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule__add

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, word_is_jo?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, jojo_compiler_syntax__jo
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule__add

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, word_is_double_quote?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, syntax__double_quote__jojo_compiler
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule__add

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, local_variable_set_word?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, jojo_compiler_syntax__local_variable_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule__add

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, local_variable_get_word?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, jojo_compiler_syntax__local_variable_get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule__add

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, comment_begin_string?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, syntax__comment__jojo_compiler
   <span style="color: #66d9ef; font-weight: bold;">xx</span> syntax_rule__add

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org5a64627" class="outline-2">
<h2 id="org5a64627">jojo-compiler</h2>
<div class="outline-text-2" id="text-org5a64627">
</div><div id="outline-container-org1fba1e1" class="outline-3">
<h3 id="org1fba1e1"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-org1fba1e1">
<ul class="org-ul">
<li><p>the jojo-compiler is a macro dispatcher</p><p>it can be viewed as make-function-body</p><p>it gets next word and use predicates on word to do dispatch</p></li>
<li><p>note that</p><p>jojo-compiler can be viewed as the "compiler" of the cicada-nymph</p><p>it does NOT (can not) compile file to file</p><p>but creates structured data directly into memory</p></li></ul>
</div>
</div>

<div id="outline-container-org9aff250" class="outline-3">
<h3 id="org9aff250">jojo-compiler,dispatch-word</h3>
<div class="outline-text-3" id="text-org9aff250">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jojo-compiler,dispatch-word"</span>, jojo_compiler__dispatch_word
   <span style="color: #FF8888;">;; &lt;&lt; jo, string[address, length], word[address, length] --</span>
   <span style="color: #FF8888;">;;    jo, string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> find_syntax, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   apply
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__link
   <span style="color: #66d9ef; font-weight: bold;">xx</span> find_link, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">6</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xxswapx, drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   link_to_jo
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_undefined_word_report__for_jojo_compiler
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">10</span>, write_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"write-undefined-word-report,for-jojo-compiler"</span>, write_undefined_word_report__for_jojo_compiler
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$undefined_word_report__for_jojo_compiler
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, length$undefined_word_report__for_jojo_compiler
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

<span style="color: #a6e22e;">string$undefined_word_report__for_jojo_compiler</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"* (jojo-compiler) meets undefined word : "</span>
<span style="color: #a6e22e;">.end</span>:
length$undefined_word_report__for_jojo_compiler = (.end - string$undefined_word_report__for_jojo_compiler)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4438378" class="outline-3">
<h3 id="org4438378">jojo-compiler</h3>
<div class="outline-text-3" id="text-org4438378">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jojo-compiler"</span>, jojo_compiler
   <span style="color: #FF8888;">;; &lt;&lt; jo, string[address, length] -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> local_variable_table__clear
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__syntax_rule_set__jojo_compiler, push_syntax_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span> jojo_compiler__loop
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop_syntax_stack
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"jojo-compiler,loop"</span>, jojo_compiler__loop
   <span style="color: #FF8888;">;; &lt;&lt; jo, string[address, length] -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, space_string?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, drop
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxswapxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word
   <span style="color: #FF8888;">;; &lt;&lt; tail[address, length], head[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> jojo_compiler__dispatch_word
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, jojo_compiler__loop
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga1e7859" class="outline-2">
<h2 id="orga1e7859">define-function</h2>
<div class="outline-text-2" id="text-orga1e7859">
</div><div id="outline-container-orgca0225a" class="outline-3">
<h3 id="orgca0225a"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-orgca0225a">
<ul class="org-ul">
<li><p>for the following function</p><p>I add the "CICADA__" as prefix</p><p>to distinguish from their assembly code version</p></li></ul>
</div>
</div>
