cicada-nymph.org
** define-function
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "define-function", CICADA__define_function
      ;; << string[address, length] -- >>

      xx dup2, string__word
      ;; << string[address, length]
      ;;    name-string[address, length] >>
      xx make_string
      ;; << string[address, length]
      ;;    name-string[address, length] >>

      xx dup2
      xx V__link
      xx literal, 0
      ;; << string[address, length]
      ;;    name-string[address, length]
      ;;    name-string[address, length], next-link, jo >>
      xx make_link
      ;; << string[address, length]
      ;;    name-string[address, length]
      ;;    link >>

      xx xxtuckx
      xx address, V__link, set
      xx drop2
      xx literal, explain$function
      xx literal, 0
      ;; << string[address, length]
      ;;    link
      ;;    name-string[address, length], explainer, 0 >>
      xx make_jo_head
      ;; << string[address, length]
      ;;    link
      ;;    jo >>

      xx tuck
      xx swap
      ;; << string[address, length]
      ;;    jo
      ;;    jo
      ;;    link >>
      xx link__set_jo
      ;; << string[address, length]
      ;;    jo >>

      xx dup
      xx xxswapxx
      xx string__word_tail
      xx V__jojo_area__current_free_address
      xx xxxswapx
      ;; << jo
      ;;    V__jojo_area__current_free_address
      ;;    jo
      ;;    body[address, length] >>
      xx jojo_compiler
      ;; << jo
      ;;    V__jojo_area__current_free_address >>

      xx V__jojo_area__current_free_address
      xx swap, subtraction
      xx V__cell_size, division
      xx swap, jo__set_length

      xx end
   #+end_src
** test
   #+begin_src cicada-nymph
   : addadd add add end ; define-function
   1 2 3 addadd . << 6 >>

   : addadd ; string:word *link* find-link drop
   link->jo dup jo->length . << 3 >>
   1 2 3 x|swap|xxx apply . << 6 >>

   : add1 1 add end ; define-function
   1 add1 . << 2 >>

   : negate 0 swap sub end ; define-function
   1 negate . << -1 >>
   #+end_src
** test double-quote
   #+begin_src cicada-nymph
   : test,double-quote
     << -- >>
     "test,double-quote"
     write-string
     end
   ; define-function
   test,double-quote
   #+end_src
* define-variable,with-tos
