cicada-nymph.html

<div id="outline-container-orgf332061" class="outline-3">
<h3 id="orgf332061">define-function</h3>
<div class="outline-text-3" id="text-orgf332061">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"define-function"</span>, CICADA__define_function
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, string__word
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> make_string
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length] &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__link
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length], next-link, jo &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> make_link
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length]</span>
   <span style="color: #FF8888;">;;    link &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxtuckx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">address</span>, V__link, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, explain$function
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    link</span>
   <span style="color: #FF8888;">;;    name-string[address, length], explainer, 0 &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> make_jo_head
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    link</span>
   <span style="color: #FF8888;">;;    jo &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> tuck
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    jo</span>
   <span style="color: #FF8888;">;;    jo</span>
   <span style="color: #FF8888;">;;    link &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> link__set_jo
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    jo &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxswapxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__word_tail
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__jojo_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxxswapx
   <span style="color: #FF8888;">;; &lt;&lt; jo</span>
   <span style="color: #FF8888;">;;    V__jojo_area__current_free_address</span>
   <span style="color: #FF8888;">;;    jo</span>
   <span style="color: #FF8888;">;;    body[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> jojo_compiler
   <span style="color: #FF8888;">;; &lt;&lt; jo</span>
   <span style="color: #FF8888;">;;    V__jojo_area__current_free_address &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__jojo_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap, subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, division
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap, jo__set_length

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7faa1b7" class="outline-3">
<h3 id="org7faa1b7"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-org7faa1b7">
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">addadd</span> add add <span style="color: #00ffff; font-weight: bold;">end</span> <span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #fd971f; font-weight: bold;">1</span> <span style="color: #fd971f; font-weight: bold;">2</span> <span style="color: #fd971f; font-weight: bold;">3</span> addadd . <span style="color: #FF8888;">&lt;&lt; 6 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">addadd</span> <span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ffffff; font-weight: bold;">string:</span>word <span style="color: #fd971f; font-weight: bold;">*link*</span> find-link drop
link<span style="color: #b0b1a3;">-&gt;</span>jo dup jo<span style="color: #b0b1a3;">-&gt;</span>length . <span style="color: #FF8888;">&lt;&lt; 3 &gt;&gt;</span>
<span style="color: #fd971f; font-weight: bold;">1</span> <span style="color: #fd971f; font-weight: bold;">2</span> <span style="color: #fd971f; font-weight: bold;">3</span> x<span style="color: #b0b1a3;">|</span>swap<span style="color: #b0b1a3;">|</span>xxx apply . <span style="color: #FF8888;">&lt;&lt; 6 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">add1</span> <span style="color: #fd971f; font-weight: bold;">1</span> add <span style="color: #00ffff; font-weight: bold;">end</span> <span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #fd971f; font-weight: bold;">1</span> add1 . <span style="color: #FF8888;">&lt;&lt; 2 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">negate</span> <span style="color: #fd971f; font-weight: bold;">0</span> swap sub <span style="color: #00ffff; font-weight: bold;">end</span> <span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #fd971f; font-weight: bold;">1</span> negate . <span style="color: #FF8888;">&lt;&lt; -1 &gt;&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org752d8f2" class="outline-3">
<h3 id="org752d8f2"><span class="done test">test</span> double-quote</h3>
<div class="outline-text-3" id="text-org752d8f2">
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">test,double-quote</span>
  <span style="color: #FF8888;">&lt;&lt; -- &gt;&gt;</span>
  <span style="color: #e6db74;">"test,double-quote"</span>
  write-string
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
test,double-quote
</pre>
</div>
</div>
</div>
</div>
