cicada-nymph.org
** define-variable,with-tos
   * not undo is needed for define-variable,with-tos
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "define-variable,with-tos", CICADA__define_variable__with_tos
      ;; << value, string[address, length] -- >>

      xx dup2, string__word
      ;; << string[address, length]
      ;;    name-string[address, length] >>
      xx make_string
      ;; << string[address, length]
      ;;    name-string[address, length] >>

      xx dup2
      xx V__link
      xx literal, 0
      ;; << string[address, length]
      ;;    name-string[address, length]
      ;;    name-string[address, length], next-link, jo >>
      xx make_link
      ;; << string[address, length]
      ;;    name-string[address, length]
      ;;    link >>

      xx xxtuckx
      xx address, V__link, set
      xx drop2
      xx literal, explain$variable
      xx literal, 0
      ;; << string[address, length]
      ;;    link
      ;;    name-string[address, length], explainer, 0 >>
      xx make_jo_head
      ;; << string[address, length]
      ;;    link
      ;;    jo >>

      xx tuck
      xx swap
      ;; << string[address, length]
      ;;    jo
      ;;    jo
      ;;    link >>
      xx link__set_jo
      ;; << string[address, length]
      ;;    jo >>

      xx literal, 1
      xx swap
      ;; << string[address, length]
      ;;    1
      ;;    jo >>
      xx jo__set_length
      ;; << string[address, length] >>

      xx drop2

      xx jojo_area__stay

      xx end
   #+end_src
** test
   #+begin_src cicada-nymph
   233 : *three* ; define-variable,with-tos
   : add-three *three* add end ; define-function
   1 add-three . << 234 >>

   << you get the address of the variable *three*
      by add "address" in front of it >>
   : fix-*three* 3 address *three* set end ; define-function
   fix-*three*
   1 add-three . << 4 >>

   : jo-*three* jo *three* apply . end ; define-function
   jo-*three*
   #+end_src
* *local-variable*
** 記 有名字的局部變量 與 變長的局部數據
   * local-variable
     用來實現 有名字的局部變量
     在編譯時計算 offset
     到這個 local-variable 中的 offset 做爲變量的值
     有 *local-variable-table* 這個數據結構
     幫助計算 offset
   * local-memory
     用來分配 變長的局部數據
     在運行時計算 offset
   * 兩個機制配合使用
** 記 再增加局部變元支持之後 需要重寫的部分
*** 詮釋者 與 收尾詞
    * 在進行時
      每次進入一個函數體的執行
      即 每次將一串珠珠入棧時
      同時在這串珠子底部加上
      local_variable$current_free_address
      即 在 explain$function 中需要做特殊處理
    * 這個值在函數退出時
      [即 在 end 這個函數中]
      用以重置 local_variable$current_free_address
      也就是 釋放在這次函數作用過程中所分配的內存
    * 每次 >:name 的時候
      都更新 local_variable$current_free_address
      以分配內存就行了
    * 也就是說
      return-stack 中的大多數有效值
      都是以兩個值一對的方式存在的
    * 兩個結尾詞是 end 和 tail_call
      對於 tail_call
      即 對於明顯的尾遞歸調用
      需要利用棧中的值重置 local_variable$current_free_address
      但是並不入棧新值
*** 語法擴展方面的支持
    * 這裏需要識別 >:name 還有 :name 等等
      並對它們做特殊處理
      這些東西應該藉助設計良好的語法擴展機制來實現
    * 我將使用一個 語法謂詞 的棧
      可以發現
      這樣的話
      我就能很容易地臨時改變語法了
** 記 總結
*** interface
    * 首先要滿足最基本的
      長度爲 *cell-size* 的倍數的
      局部變量的需求
      其次
      還要能夠在所申請的局部空間裏使用字符串
      這兩種長度的數據結構需要共存
      使用 offset 就行了
    * 底層
      local-data-allocate,jo
      這個只讓 local_variable$current_free_address 前進
      而不後退
    * 注意
      最爲重要的特點是
      所有的對 局部數據堆 的使用
      都必須在編譯時期被靜態地算出來
      所以必須設計語法幫助編譯器作計算
      >:name :name 用以 分配 和 使用
      *cell-size* 倍數大小的內存
    * 語義方面
      >:name 的重複出現有兩種語義
      1. 更新這個局部變元的值
      2. 覆蓋上一個局部變元綁定
      我選擇第一種
      因爲這樣
      我就不必設計額外的語法來更新局部變元的值了
      比較簡潔
*** 語義特點總結
    * 所有有名局部變元的名字與值的對應
      都由編譯器處理
    * 每個函數體就是一個非常線性的東西
      函數體中不能嵌套別的函數體
*** 語用特點總結
    * 所有的函數都是全局的
      包括輔助函數
    * 所以設計輔助函數的時候
      應該格外小心
      儘量使得輔助函數能夠被重用
    * 改代碼並調整對輔助函數的使用
      就被稱作是 "re-factoring"
      即 函數的因子的重新分解
** 記 關於分支結構
   * 對 包含 >:name 的函數體的處理是純線性的
     根本沒有考慮到 函數體中 因 if else then 而產生的分支結構
     但是這並不會引起錯誤
     原因如下
   * 對 >:name 和 :name 的處理是純粹在編譯時期進行的
   * 所保證的特性是
     1. 每一個 name 在 一個函數體中的出現
        都是在編譯時期對 local-variable 的 一個 offset 的分配
     2. 同一個 name 在 一個函數體中的出現
        會得到相同的 offset
