cicada-nymph.html

<div id="outline-container-orgc85753a" class="outline-2">
<h2 id="orgc85753a">define-variable,with-tos</h2>
<div class="outline-text-2" id="text-orgc85753a">
</div><div id="outline-container-org733fbf4" class="outline-3">
<h3 id="org733fbf4">define-variable,with-tos</h3>
<div class="outline-text-3" id="text-org733fbf4">
<ul class="org-ul">
<li><p>not undo is needed for define-variable,with-tos</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"define-variable,with-tos"</span>, CICADA__define_variable__with_tos
   <span style="color: #FF8888;">;; &lt;&lt; value, string[address, length] -- &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, string__word
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> make_string
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length] &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__link
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length], next-link, jo &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> make_link
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    name-string[address, length]</span>
   <span style="color: #FF8888;">;;    link &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxtuckx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">address</span>, V__link, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, explain$variable
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    link</span>
   <span style="color: #FF8888;">;;    name-string[address, length], explainer, 0 &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> make_jo_head
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    link</span>
   <span style="color: #FF8888;">;;    jo &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> tuck
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    jo</span>
   <span style="color: #FF8888;">;;    jo</span>
   <span style="color: #FF8888;">;;    link &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> link__set_jo
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    jo &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">1</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    1</span>
   <span style="color: #FF8888;">;;    jo &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> jo__set_length
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] &gt;&gt;</span>

   <span style="color: #66d9ef; font-weight: bold;">xx</span> drop2

   <span style="color: #66d9ef; font-weight: bold;">xx</span> jojo_area__stay

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org20558be" class="outline-3">
<h3 id="org20558be"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-org20558be">
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #fd971f; font-weight: bold;">233</span> <span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #fd971f; font-weight: bold;">*three*</span> <span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #a1ab3a; font-weight: bold;">define-variable,with-tos</span>
<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">add-three</span> <span style="color: #fd971f; font-weight: bold;">*three*</span> add <span style="color: #00ffff; font-weight: bold;">end</span> <span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #fd971f; font-weight: bold;">1</span> add-three . <span style="color: #FF8888;">&lt;&lt; 234 &gt;&gt;</span>

<span style="color: #FF8888;">&lt;&lt; you get the address of the variable *three*</span>
<span style="color: #FF8888;">   by add "address" in front of it &gt;&gt;</span>
<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">fix-*three*</span> <span style="color: #fd971f; font-weight: bold;">3</span> <span style="color: #f92672; font-weight: bold;">address</span> <span style="color: #fd971f; font-weight: bold;">*three*</span> set <span style="color: #00ffff; font-weight: bold;">end</span> <span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
fix-<span style="color: #b0b1a3;">*</span>three<span style="color: #b0b1a3;">*</span>
<span style="color: #fd971f; font-weight: bold;">1</span> add-three . <span style="color: #FF8888;">&lt;&lt; 4 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">jo-*three*</span> <span style="color: #f92672; font-weight: bold;">jo</span> <span style="color: #fd971f; font-weight: bold;">*three*</span> apply . <span style="color: #00ffff; font-weight: bold;">end</span> <span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
jo-<span style="color: #b0b1a3;">*</span>three<span style="color: #b0b1a3;">*</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaa8a50d" class="outline-2">
<h2 id="orgaa8a50d"><b>local-variable</b></h2>
<div class="outline-text-2" id="text-orgaa8a50d">
</div><div id="outline-container-org7bc80d1" class="outline-3">
<h3 id="org7bc80d1"><span class="todo _">記</span> 有名字的局部變量 與 變長的局部數據</h3>
<div class="outline-text-3" id="text-org7bc80d1">
<ul class="org-ul">
<li><p>local-variable</p><p>用來實現 有名字的局部變量</p><p>在編譯時計算 offset</p><p>到這個 local-variable 中的 offset 做爲變量的值</p><p>有 <b>local-variable-table</b> 這個數據結構</p><p>幫助計算 offset</p></li>
<li><p>local-memory</p><p>用來分配 變長的局部數據</p><p>在運行時計算 offset</p></li>
<li><p>兩個機制配合使用</p></li></ul>
</div>
</div>

<div id="outline-container-orgc122860" class="outline-3">
<h3 id="orgc122860"><span class="todo _">記</span> 再增加局部變元支持之後 需要重寫的部分</h3>
<div class="outline-text-3" id="text-orgc122860">
</div><div id="outline-container-org44ecbef" class="outline-4">
<h4 id="org44ecbef">詮釋者 與 收尾詞</h4>
<div class="outline-text-4" id="text-org44ecbef">
<ul class="org-ul">
<li><p>在進行時</p><p>每次進入一個函數體的執行</p><p>即 每次將一串珠珠入棧時</p><p>同時在這串珠子底部加上</p><p>local_variable$current_free_address</p><p>即 在 explain$function 中需要做特殊處理</p></li>
<li><p>這個值在函數退出時</p><p>[即 在 end 這個函數中]</p><p>用以重置 local_variable$current_free_address</p><p>也就是 釋放在這次函數作用過程中所分配的內存</p></li>
<li><p>每次 &gt;:name 的時候</p><p>都更新 local_variable$current_free_address</p><p>以分配內存就行了</p></li>
<li><p>也就是說</p><p>return-stack 中的大多數有效值</p><p>都是以兩個值一對的方式存在的</p></li>
<li><p>兩個結尾詞是 end 和 tail_call</p><p>對於 tail_call</p><p>即 對於明顯的尾遞歸調用</p><p>需要利用棧中的值重置 local_variable$current_free_address</p><p>但是並不入棧新值</p></li></ul>
</div>
</div>

<div id="outline-container-org8fc1e16" class="outline-4">
<h4 id="org8fc1e16">語法擴展方面的支持</h4>
<div class="outline-text-4" id="text-org8fc1e16">
<ul class="org-ul">
<li><p>這裏需要識別 &gt;:name 還有 :name 等等</p><p>並對它們做特殊處理</p><p>這些東西應該藉助設計良好的語法擴展機制來實現</p></li>
<li><p>我將使用一個 語法謂詞 的棧</p><p>可以發現</p><p>這樣的話</p><p>我就能很容易地臨時改變語法了</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org291d9b4" class="outline-3">
<h3 id="org291d9b4"><span class="todo _">記</span> 總結</h3>
<div class="outline-text-3" id="text-org291d9b4">
</div><div id="outline-container-orga393bd2" class="outline-4">
<h4 id="orga393bd2">interface</h4>
<div class="outline-text-4" id="text-orga393bd2">
<ul class="org-ul">
<li><p>首先要滿足最基本的</p><p>長度爲 <b>cell-size</b> 的倍數的</p><p>局部變量的需求</p><p>其次</p><p>還要能夠在所申請的局部空間裏使用字符串</p><p>這兩種長度的數據結構需要共存</p><p>使用 offset 就行了</p></li>
<li><p>底層</p><p>local-data-allocate,jo</p><p>這個只讓 local_variable$current_free_address 前進</p><p>而不後退</p></li>
<li><p>注意</p><p>最爲重要的特點是</p><p>所有的對 局部數據堆 的使用</p><p>都必須在編譯時期被靜態地算出來</p><p>所以必須設計語法幫助編譯器作計算</p><p>&gt;:name :name 用以 分配 和 使用</p><p><b>cell-size</b> 倍數大小的內存</p></li>
<li><p><p></p><p>語義方面</p><p>&gt;:name 的重複出現有兩種語義</p><p></p></p><p><ol class="org-ol"></p><p><li>更新這個局部變元的值</li></p><p><li>覆蓋上一個局部變元綁定</li></ol></p><p><p></p><p>我選擇第一種</p><p>因爲這樣</p><p>我就不必設計額外的語法來更新局部變元的值了</p><p>比較簡潔</p><p></p></p></li></ul>
</div>
</div>

<div id="outline-container-org2246b7d" class="outline-4">
<h4 id="org2246b7d">語義特點總結</h4>
<div class="outline-text-4" id="text-org2246b7d">
<ul class="org-ul">
<li><p>所有有名局部變元的名字與值的對應</p><p>都由編譯器處理</p></li>
<li><p>每個函數體就是一個非常線性的東西</p><p>函數體中不能嵌套別的函數體</p></li></ul>
</div>
</div>

<div id="outline-container-orgb7e1b4e" class="outline-4">
<h4 id="orgb7e1b4e">語用特點總結</h4>
<div class="outline-text-4" id="text-orgb7e1b4e">
<ul class="org-ul">
<li><p>所有的函數都是全局的</p><p>包括輔助函數</p></li>
<li><p>所以設計輔助函數的時候</p><p>應該格外小心</p><p>儘量使得輔助函數能夠被重用</p></li>
<li><p>改代碼並調整對輔助函數的使用</p><p>就被稱作是 "re-factoring"</p><p>即 函數的因子的重新分解</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org29d6a3f" class="outline-3">
<h3 id="org29d6a3f"><span class="todo _">記</span> 關於分支結構</h3>
<div class="outline-text-3" id="text-org29d6a3f">
<ul class="org-ul">
<li><p>對 包含 &gt;:name 的函數體的處理是純線性的</p><p>根本沒有考慮到 函數體中 因 if else then 而產生的分支結構</p><p>但是這並不會引起錯誤</p><p>原因如下</p></li>
<li><p>對 &gt;:name 和 :name 的處理是純粹在編譯時期進行的</p></li>
<li><p>所保證的特性是</p><p><ol class="org-ol"></p><p><li>每一個 name 在 一個函數體中的出現</p><p>都是在編譯時期對 local-variable 的 一個 offset 的分配</li></p><p><li>同一個 name 在 一個函數體中的出現</p><p>會得到相同的 offset</li></ol></p></li></ul>
</div>
</div>
