cicada-nymph.org
** memory allocation
   #+begin_src fasm :tangle cicada-nymph.fasm
   size$local_variable = 1024 * 1024 * cell_size

   address$local_variable labeling
      preserve size$local_variable

   local_variable$current_free_address:
      xx address$local_variable
   #+end_src
** 記 注意結尾詞會初始化局部變量指針
   * 下面的接口函數必須是 primitive-function
     因爲 否則 遇到 end 和 tail_call 的時候
     local_variable$current_free_address 就又被初始化了
** allocate-local-variable
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_primitive_function "allocate-local-variable", allocate_local_variable
      ;; << number -- >>
      pop_argument_stack rax
      imul rax, cell_size
      add [local_variable$current_free_address], rax
      next
   #+end_src
** note many get & set
   * in memory
     | 1 : value-1 |
     | 1 : value-2 |
     | 1 : value-3 |
   * on stack
     << value-1, value-2, value-3, ... >>
** instruction,local-variable,[n-get|n-set] :64bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "instruction,local-variable,n-get", instruction__local_variable__n_get
      ;; << -- value-1, ..., value-n >>
      pop_return_stack rbx
        mov rdx, [rbx]           ;; offset
        mov rcx, [rbx + cell_size] ;; numebr
      add rbx, (cell_size * 2)
      push_return_stack rbx

      mov rbx, [pointer$return_stack - unit__return_point + offset__return_point$local_variable]
      add rbx, rdx
   .loop:
      mov rax, [rbx]
      push_argument_stack rax
      add rbx, cell_size
      loop .loop
      next

   define_primitive_function "instruction,local-variable,n-set", instruction__local_variable__n_set
      ;; << value-n, ..., value-1 -- >>
      pop_return_stack rbx
        mov rdx, [rbx]           ;; offset
        mov rcx, [rbx + cell_size] ;; numebr
      add rbx, (cell_size * 2)
      push_return_stack rbx

      mov rbx, [pointer$return_stack - unit__return_point + offset__return_point$local_variable]
      add rbx, rdx
        mov rax, cell_size
        imul rax, rcx
        add rbx, rax
        ;; for address is based on 0
        ;; but n is based on 1
        sub rbx, cell_size
   .loop:
      pop_argument_stack rax
      mov [rbx], rax
      sub rbx, cell_size
      loop .loop
      next

   }
   #+end_src
** instruction,local-variable,[n-get|n-set] :32bit:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =32bit, machine {

   define_primitive_function "instruction,local-variable,n-get", instruction__local_variable__n_get
      ;; << -- value-1, ..., value-n >>
      pop_return_stack rbx
        mov rdx, [rbx]           ;; offset
        mov rcx, [rbx + cell_size] ;; numebr
      add rbx, (cell_size * 2)
      push_return_stack rbx

      mov rax, [pointer$return_stack]
      mov rbx, [rax - unit__return_point + offset__return_point$local_variable]
      add rbx, rdx
   .loop:
      mov rax, [rbx]
      push_argument_stack rax
      add rbx, cell_size
      loop .loop
      next

   define_primitive_function "instruction,local-variable,n-set", instruction__local_variable__n_set
      ;; << value-n, ..., value-1 -- >>
      pop_return_stack rbx
        mov rdx, [rbx]           ;; offset
        mov rcx, [rbx + cell_size] ;; numebr
      add rbx, (cell_size * 2)
      push_return_stack rbx
      mov rax, [pointer$return_stack]
      mov rbx, [rax - unit__return_point + offset__return_point$local_variable]

      add rbx, rdx
        mov rax, cell_size
        imul rax, rcx
        add rbx, rax
        ;; for address is based on 0
        ;; but n is based on 1
        sub rbx, cell_size
   .loop:
      pop_argument_stack rax
      mov [rbx], rax
      sub rbx, cell_size
      loop .loop
      next

   }
   #+end_src
