cicada-nymph.html

<div id="outline-container-org8ea7fa" class="outline-3">
<h3 id="org8ea7fa">memory allocation</h3>
<div class="outline-text-3" id="text-org8ea7fa">
<div class="org-src-container">

<pre class="src src-fasm">size$local_variable = <span style="color: #ae81ff;">1024</span> * <span style="color: #ae81ff;">1024</span> * cell_size

address$local_variable <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> size$local_variable

<span style="color: #a6e22e;">local_variable$current_free_address</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$local_variable
</pre>
</div>
</div>
</div>

<div id="outline-container-org56b55a2" class="outline-3">
<h3 id="org56b55a2"><span class="todo _">記</span> 注意結尾詞會初始化局部變量指針</h3>
<div class="outline-text-3" id="text-org56b55a2">
<ul class="org-ul">
<li><p>下面的接口函數必須是 primitive-function</p><p>因爲 否則 遇到 end 和 tail_call 的時候</p><p>local_variable$current_free_address 就又被初始化了</p></li></ul>
</div>
</div>

<div id="outline-container-org700f0fc" class="outline-3">
<h3 id="org700f0fc">allocate-local-variable</h3>
<div class="outline-text-3" id="text-org700f0fc">
<div class="org-src-container">

<pre class="src src-fasm">define_primitive_function <span style="color: #e6db74;">"allocate-local-variable"</span>, allocate_local_variable
   <span style="color: #FF8888;">;; &lt;&lt; number -- &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">imul</span> <span style="color: #fd971f;">rax</span>, cell_size
   <span style="color: #a6e22e;">add</span> [local_variable$current_free_address], <span style="color: #fd971f;">rax</span>
   next
</pre>
</div>
</div>
</div>

<div id="outline-container-org75b80aa" class="outline-3">
<h3 id="org75b80aa"><span class="todo note">note</span> many get &amp; set</h3>
<div class="outline-text-3" id="text-org75b80aa">
<ul class="org-ul">
<li><p><p></p><p>in memory</p><p></p></p><p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides"></p><p></p><p></p><p><colgroup></p><p><col  class="org-left" /></p><p></colgroup></p><p><tbody></p><p><tr></p><p><td class="org-left">1 : value-1</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">1 : value-2</td></p><p></tr></p><p></p><p><tr></p><p><td class="org-left">1 : value-3</td></p><p></tr></p><p></tbody></p><p></table></p></li>
<li><p>on stack</p><p>&lt;&lt; value-1, value-2, value-3, &#x2026; &gt;&gt;</p></li></ul>
</div>
</div>

<div id="outline-container-orgb01ebd" class="outline-3">
<h3 id="orgb01ebd">instruction,local-variable,[n-get|n-set]&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span></span></h3>
<div class="outline-text-3" id="text-orgb01ebd">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"instruction,local-variable,n-get"</span>, instruction__local_variable__n_get
   <span style="color: #FF8888;">;; &lt;&lt; -- value-1, ..., value-n &gt;&gt;</span>
   pop_return_stack <span style="color: #fd971f;">rbx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdx</span>, [<span style="color: #fd971f;">rbx</span>]           <span style="color: #FF8888;">;; offset</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [<span style="color: #fd971f;">rbx</span> + cell_size] <span style="color: #FF8888;">;; numebr</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, (cell_size * <span style="color: #ae81ff;">2</span>)
   push_return_stack <span style="color: #fd971f;">rbx</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$return_stack - unit__return_point + offset__return_point$local_variable]
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rdx</span>
<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

define_primitive_function <span style="color: #e6db74;">"instruction,local-variable,n-set"</span>, instruction__local_variable__n_set
   <span style="color: #FF8888;">;; &lt;&lt; value-n, ..., value-1 -- &gt;&gt;</span>
   pop_return_stack <span style="color: #fd971f;">rbx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdx</span>, [<span style="color: #fd971f;">rbx</span>]           <span style="color: #FF8888;">;; offset</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [<span style="color: #fd971f;">rbx</span> + cell_size] <span style="color: #FF8888;">;; numebr</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, (cell_size * <span style="color: #ae81ff;">2</span>)
   push_return_stack <span style="color: #fd971f;">rbx</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [pointer$return_stack - unit__return_point + offset__return_point$local_variable]
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rdx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, cell_size
     <span style="color: #a6e22e;">imul</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rcx</span>
     <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rax</span>
     <span style="color: #FF8888;">;; for address is based on 0</span>
     <span style="color: #FF8888;">;; but n is based on 1</span>
     <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rbx</span>, cell_size
<span style="color: #a6e22e;">.loop</span>:
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rbx</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a121ee" class="outline-3">
<h3 id="org4a121ee">instruction,local-variable,[n-get|n-set]&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span></span></h3>
<div class="outline-text-3" id="text-org4a121ee">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"instruction,local-variable,n-get"</span>, instruction__local_variable__n_get
   <span style="color: #FF8888;">;; &lt;&lt; -- value-1, ..., value-n &gt;&gt;</span>
   pop_return_stack <span style="color: #fd971f;">rbx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdx</span>, [<span style="color: #fd971f;">rbx</span>]           <span style="color: #FF8888;">;; offset</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [<span style="color: #fd971f;">rbx</span> + cell_size] <span style="color: #FF8888;">;; numebr</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, (cell_size * <span style="color: #ae81ff;">2</span>)
   push_return_stack <span style="color: #fd971f;">rbx</span>

   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [<span style="color: #fd971f;">rax</span> - unit__return_point + offset__return_point$local_variable]
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rdx</span>
<span style="color: #a6e22e;">.loop</span>:
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [<span style="color: #fd971f;">rbx</span>]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

define_primitive_function <span style="color: #e6db74;">"instruction,local-variable,n-set"</span>, instruction__local_variable__n_set
   <span style="color: #FF8888;">;; &lt;&lt; value-n, ..., value-1 -- &gt;&gt;</span>
   pop_return_stack <span style="color: #fd971f;">rbx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rdx</span>, [<span style="color: #fd971f;">rbx</span>]           <span style="color: #FF8888;">;; offset</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rcx</span>, [<span style="color: #fd971f;">rbx</span> + cell_size] <span style="color: #FF8888;">;; numebr</span>
   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, (cell_size * <span style="color: #ae81ff;">2</span>)
   push_return_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rbx</span>, [<span style="color: #fd971f;">rax</span> - unit__return_point + offset__return_point$local_variable]

   <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rdx</span>
     <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, cell_size
     <span style="color: #a6e22e;">imul</span> <span style="color: #fd971f;">rax</span>, <span style="color: #fd971f;">rcx</span>
     <span style="color: #a6e22e;">add</span> <span style="color: #fd971f;">rbx</span>, <span style="color: #fd971f;">rax</span>
     <span style="color: #FF8888;">;; for address is based on 0</span>
     <span style="color: #FF8888;">;; but n is based on 1</span>
     <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rbx</span>, cell_size
<span style="color: #a6e22e;">.loop</span>:
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">mov</span> [<span style="color: #fd971f;">rbx</span>], <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rbx</span>, cell_size
   <span style="color: #a6e22e;">loop</span> .loop
   next

}
</pre>
</div>
</div>
</div>
