cicada-nymph.org
** note example result
   * example
     #+begin_src cicada-nymph
     : example
       << number1, number2, number3, number4
          -- number1, number2 >>
       >::var2
       >::var2
       ::var2
       end
     ; define-function
     #+end_src
   * result
     #+begin_src fasm
     define_function "example", example

        ;; >::var2
        xx literal, 2, allocate_local_variable
        xx instruction__local_variable__n_set, 0, 2

        ;; >::var2
        xx instruction__local_variable__n_set, 0, 2

        ;; ::var2
        xx instruction__local_variable__n_get, 0, 2

        xx end
     #+end_src
** test
   #+begin_src cicada-nymph
   : local-variable,test
     >:var1
     :var1
     end
   ; define-function
   1 local-variable,test .
   << 1 >>

   : local-variable,test
     >:var1
     >:var2
     >:var3
     >:var4
     :var4
     :var3
     :var2
     :var1
     end
   ; define-function
   1 2 3 4 local-variable,test . . . .
   << 4 3 2 1 >>

   : local-variable,test
     >:var2
     >:var2
     >:var1
     :var1
     :var2
     add
     end
   ; define-function
   1 2 4 local-variable,test .
   << 3 >>

   : local-variable,test,2
     << number1, number2 -- number2 + number3 >>
     >::var2
     ::var2
     end
   ; define-function
   1 2 local-variable,test,2 . .
   << 1 2 >>

   : local-variable,test,3
     << number1, number2, number3 -- number2 + number3 >>
     >::var2
     >:var1
     ::var2
     add
     end
   ; define-function
   1 2 4 local-variable,test,3 .
   << 6 >>
   #+end_src
** test nested call
   #+begin_src cicada-nymph
   : k1
     9 >:k
     :k .
     end
   ; define-function
   k1 << 9 >>

   : k2
     10 >:k
     k1
     :k .
     end
   ; define-function
   k2 << 9 10 >>
   #+end_src
** 記 問題
*** nested block
    * 因爲使用全局的 local-variable-table
      所以沒法在 nested block 中使用 local-variable
*** branch
    * example
      #+begin_src cicada-nymph
      : example
        << number1, number2, number3, number4
           -- number1, number2 >>
        >::var2
        >::var2
        ::var2
        end
      ; define-function
      #+end_src
    * result
      #+begin_src fasm
      define_function "example", example

         ;; >::var2
         xx literal, 2, allocate_local_variable
         xx instruction__local_variable__n_set, 0, 2

         ;; >::var2
         xx instruction__local_variable__n_set, 0, 2

         ;; ::var2
         xx instruction__local_variable__n_get, 0, 2

         xx end
      #+end_src
    * 看上面的例子
      可以發現
      #+begin_src cicada-nymph
      : example
        if
          >::var2
        else
          >::var2
        then
        ::var2
        end
      ; define-function
      #+end_src
      不同分支下
      局部變元的編譯效果不等同了
** local-variable-table
