cicada-nymph.html

<div id="outline-container-orgb567284" class="outline-3">
<h3 id="orgb567284"><span class="todo note">note</span> example result</h3>
<div class="outline-text-3" id="text-orgb567284">
<ul class="org-ul">
<li><p><p></p><p>example</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">example</span></p><p>  <span style="color: #FF8888;">&lt;&lt; number1, number2, number3, number4</span></p><p><span style="color: #FF8888;">     -- number1, number2 &gt;&gt;</span></p><p>  <span style="color: #dc322f; font-weight: bold;">&gt;::var2</span></p><p>  <span style="color: #dc322f; font-weight: bold;">&gt;::var2</span></p><p>  <span style="color: #5CDD5C; font-weight: bold;">::var2</span></p><p>  <span style="color: #00ffff; font-weight: bold;">end</span></p><p><span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span></p><p></pre></p><p></div></p></li>
<li><p><p></p><p>result</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-fasm">define_function <span style="color: #e6db74;">"example"</span>, example</p><p></p><p>   <span style="color: #FF8888;">;; &gt;::var2</span></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">2</span>, allocate_local_variable</p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> instruction__local_variable__n_set, <span style="color: #ae81ff;">0</span>, <span style="color: #ae81ff;">2</span></p><p></p><p>   <span style="color: #FF8888;">;; &gt;::var2</span></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> instruction__local_variable__n_set, <span style="color: #ae81ff;">0</span>, <span style="color: #ae81ff;">2</span></p><p></p><p>   <span style="color: #FF8888;">;; ::var2</span></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> instruction__local_variable__n_get, <span style="color: #ae81ff;">0</span>, <span style="color: #ae81ff;">2</span></p><p></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span></p><p></pre></p><p></div></p></li></ul>
</div>
</div>

<div id="outline-container-orgbbd6bfe" class="outline-3">
<h3 id="orgbbd6bfe"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-orgbbd6bfe">
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">local-variable,test</span>
  <span style="color: #FF4C4C; font-weight: bold;">&gt;:var1</span>
  <span style="color: #83EA83; font-weight: bold;">:var1</span>
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #fd971f; font-weight: bold;">1</span> local-variable,test .
<span style="color: #FF8888;">&lt;&lt; 1 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">local-variable,test</span>
  <span style="color: #FF4C4C; font-weight: bold;">&gt;:var1</span>
  <span style="color: #FF4C4C; font-weight: bold;">&gt;:var2</span>
  <span style="color: #FF4C4C; font-weight: bold;">&gt;:var3</span>
  <span style="color: #FF4C4C; font-weight: bold;">&gt;:var4</span>
  <span style="color: #83EA83; font-weight: bold;">:var4</span>
  <span style="color: #83EA83; font-weight: bold;">:var3</span>
  <span style="color: #83EA83; font-weight: bold;">:var2</span>
  <span style="color: #83EA83; font-weight: bold;">:var1</span>
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #fd971f; font-weight: bold;">1</span> <span style="color: #fd971f; font-weight: bold;">2</span> <span style="color: #fd971f; font-weight: bold;">3</span> <span style="color: #fd971f; font-weight: bold;">4</span> local-variable,test . . . .
<span style="color: #FF8888;">&lt;&lt; 4 3 2 1 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">local-variable,test</span>
  <span style="color: #FF4C4C; font-weight: bold;">&gt;:var2</span>
  <span style="color: #FF4C4C; font-weight: bold;">&gt;:var2</span>
  <span style="color: #FF4C4C; font-weight: bold;">&gt;:var1</span>
  <span style="color: #83EA83; font-weight: bold;">:var1</span>
  <span style="color: #83EA83; font-weight: bold;">:var2</span>
  add
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #fd971f; font-weight: bold;">1</span> <span style="color: #fd971f; font-weight: bold;">2</span> <span style="color: #fd971f; font-weight: bold;">4</span> local-variable,test .
<span style="color: #FF8888;">&lt;&lt; 3 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">local-variable,test,2</span>
  <span style="color: #FF8888;">&lt;&lt; number1, number2 -- number2 + number3 &gt;&gt;</span>
  <span style="color: #dc322f; font-weight: bold;">&gt;::var2</span>
  <span style="color: #5CDD5C; font-weight: bold;">::var2</span>
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #fd971f; font-weight: bold;">1</span> <span style="color: #fd971f; font-weight: bold;">2</span> local-variable,test,2 . .
<span style="color: #FF8888;">&lt;&lt; 1 2 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">local-variable,test,3</span>
  <span style="color: #FF8888;">&lt;&lt; number1, number2, number3 -- number2 + number3 &gt;&gt;</span>
  <span style="color: #dc322f; font-weight: bold;">&gt;::var2</span>
  <span style="color: #FF4C4C; font-weight: bold;">&gt;:var1</span>
  <span style="color: #5CDD5C; font-weight: bold;">::var2</span>
  add
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
<span style="color: #fd971f; font-weight: bold;">1</span> <span style="color: #fd971f; font-weight: bold;">2</span> <span style="color: #fd971f; font-weight: bold;">4</span> local-variable,test,3 .
<span style="color: #FF8888;">&lt;&lt; 6 &gt;&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b46ad8" class="outline-3">
<h3 id="org8b46ad8"><span class="done test">test</span> nested call</h3>
<div class="outline-text-3" id="text-org8b46ad8">
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">k1</span>
  <span style="color: #fd971f; font-weight: bold;">9</span> <span style="color: #FF4C4C; font-weight: bold;">&gt;:k</span>
  <span style="color: #83EA83; font-weight: bold;">:k</span> .
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
k1 <span style="color: #FF8888;">&lt;&lt; 9 &gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">k2</span>
  <span style="color: #fd971f; font-weight: bold;">10</span> <span style="color: #FF4C4C; font-weight: bold;">&gt;:k</span>
  k1
  <span style="color: #83EA83; font-weight: bold;">:k</span> .
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
k2 <span style="color: #FF8888;">&lt;&lt; 9 10 &gt;&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb1f9bd9" class="outline-3">
<h3 id="orgb1f9bd9"><span class="todo _">記</span> 問題</h3>
<div class="outline-text-3" id="text-orgb1f9bd9">
</div><div id="outline-container-org243fff0" class="outline-4">
<h4 id="org243fff0">nested block</h4>
<div class="outline-text-4" id="text-org243fff0">
<ul class="org-ul">
<li><p>因爲使用全局的 local-variable-table</p><p>所以沒法在 nested block 中使用 local-variable</p></li></ul>
</div>
</div>

<div id="outline-container-org7a406c5" class="outline-4">
<h4 id="org7a406c5">branch</h4>
<div class="outline-text-4" id="text-org7a406c5">
<ul class="org-ul">
<li><p><p></p><p>example</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">example</span></p><p>  <span style="color: #FF8888;">&lt;&lt; number1, number2, number3, number4</span></p><p><span style="color: #FF8888;">     -- number1, number2 &gt;&gt;</span></p><p>  <span style="color: #dc322f; font-weight: bold;">&gt;::var2</span></p><p>  <span style="color: #dc322f; font-weight: bold;">&gt;::var2</span></p><p>  <span style="color: #5CDD5C; font-weight: bold;">::var2</span></p><p>  <span style="color: #00ffff; font-weight: bold;">end</span></p><p><span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span></p><p></pre></p><p></div></p></li>
<li><p><p></p><p>result</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-fasm">define_function <span style="color: #e6db74;">"example"</span>, example</p><p></p><p>   <span style="color: #FF8888;">;; &gt;::var2</span></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">2</span>, allocate_local_variable</p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> instruction__local_variable__n_set, <span style="color: #ae81ff;">0</span>, <span style="color: #ae81ff;">2</span></p><p></p><p>   <span style="color: #FF8888;">;; &gt;::var2</span></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> instruction__local_variable__n_set, <span style="color: #ae81ff;">0</span>, <span style="color: #ae81ff;">2</span></p><p></p><p>   <span style="color: #FF8888;">;; ::var2</span></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> instruction__local_variable__n_get, <span style="color: #ae81ff;">0</span>, <span style="color: #ae81ff;">2</span></p><p></p><p>   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span></p><p></pre></p><p></div></p></li>
<li><p><p></p><p>看上面的例子</p><p>可以發現</p><p></p></p><p><div class="org-src-container"></p><p></p><p><pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">example</span></p><p>  <span style="color: #f92672; font-weight: bold;">if</span></p><p>    <span style="color: #dc322f; font-weight: bold;">&gt;::var2</span></p><p>  <span style="color: #f92672; font-weight: bold;">else</span></p><p>    <span style="color: #dc322f; font-weight: bold;">&gt;::var2</span></p><p>  <span style="color: #f92672; font-weight: bold;">then</span></p><p>  <span style="color: #5CDD5C; font-weight: bold;">::var2</span></p><p>  <span style="color: #00ffff; font-weight: bold;">end</span></p><p><span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span></p><p></pre></p><p></div></p><p><p></p><p>不同分支下</p><p>局部變元的編譯效果不等同了</p><p></p></p></li></ul>
</div>
</div>
</div>
