cicada-nymph.org
*** 記
    * 只有一個 local-variable-table
      用以在編譯時期解決局部變元的名與值的對應
      這個數據結構被 jojo_compiler_syntax__local_variable_set
      和 jojo_compiler_syntax__local_variable_get 所使用
    * 其中保存
      * offset-in-local-variable
      * length-of-string
      * address-of-string
    * 並且每次在定義一個新的函數體的時候
      這個 local-variable-table 會被初始化
*** 記 接口
    * (clear)
      清空 offset 和 border
    * (insert)
      插入字符串 和 offset-in-local-variable
    * (find)
      通過字符串尋找 offset-in-local-variable
    * 有兩個全局變量幫助實現這些接口
      * (cursor)
        每次 find 的時候使用一個新的 cursor 來做循環
      * (border)
        insert 會擴大 border
        find 以 border 爲邊界
    * 另外 還有一個全局變量
      * (offset)
        用以計算 offset-in-local-variable
*** memory allocation
    #+begin_src fasm :tangle cicada-nymph.fasm
    size$local_variable_table = 100 * 1024

    address$local_variable_table labeling
       preserve size$local_variable_table
    #+end_src
*** local-variable-table,clear
    #+begin_src fasm :tangle cicada-nymph.fasm
    border$local_variable_table:
       xx address$local_variable_table

    offset$local_variable_table:
       xx 0

    define_function "local-variable-table,clear", local_variable_table__clear
       ;; << -- >>
       xx literal, address$local_variable_table
       xx literal, border$local_variable_table, set
       xx literal, 0
       xx literal, offset$local_variable_table, set
       xx end
    #+end_src
*** local-variable-table,insert
    #+begin_src fasm :tangle cicada-nymph.fasm
    define_function "local-variable-table,insert", local_variable_table__insert
       ;; << string[address, length] -- offset >>

       ;; leave offset
       xx literal, offset$local_variable_table, get
       xx   xxtuckx ;; return value
       xx literal, border$local_variable_table, get, set
       xx V__cell_size
       xx literal, border$local_variable_table, add_set

       ;; update offset$local_variable_table
       xx dup2
       xx   count_front_colon
       xx   V__cell_size, multiple
       xx   literal, offset$local_variable_table, add_set

       ;; leave length
       xx dup
       xx literal, border$local_variable_table, get, set
       xx V__cell_size
       xx literal, border$local_variable_table, add_set

       xx tuck ;; for to update border$local_variable_table

       ;; leave string
       xx literal, border$local_variable_table, get
       xx string_to_buffer!

       ;; update border$local_variable_table
       xx literal, border$local_variable_table, add_set

       xx end
    #+end_src
*** local-variable-table,find
    #+begin_src fasm :tangle cicada-nymph.fasm
    cursor$local_variable_table:
       xx address$local_variable_table

    define_function "local-variable-table,find", local_variable_table__find
       ;; << string[address, length]
       ;;    -- offset, true
       ;;    -- false >>
       xx literal, address$local_variable_table
       xx literal, cursor$local_variable_table, set
       xx local_variable_table__find__loop
       xx end

    define_function "local-variable-table,find,loop", local_variable_table__find__loop
       ;; << string[address, length]
       ;;    -- offset, true
       ;;    -- false >>
       xx literal, cursor$local_variable_table, get
       xx literal, border$local_variable_table, get
       xx greater_or_equal?, false?branch, 4
       xx   drop2
       xx   false
       xx   end
       xx dup2
       xx literal, cursor$local_variable_table, get
       xx   V__cell_size, addition
       xx   V__cell_size, addition ;; address of string
       xx literal, cursor$local_variable_table, get
       xx   V__cell_size, addition
       xx   get ;; length of string
       xx string_equal?, false?branch, 8
       xx   drop2
       xx   literal, cursor$local_variable_table, get
       xx     get ;; offset
       xx   true
       xx   end
       xx literal, cursor$local_variable_table, get
       xx   V__cell_size, addition
       xx   get ;; length of string
       xx V__cell_size, addition
       xx V__cell_size, addition
       xx literal, cursor$local_variable_table, add_set
       xx tail_call, local_variable_table__find__loop
    #+end_src
