cicada-nymph.html

<div id="outline-container-orgf0091a0" class="outline-3">
<h3 id="orgf0091a0">local-variable-table</h3>
<div class="outline-text-3" id="text-orgf0091a0">
</div><div id="outline-container-org990a0bc" class="outline-4">
<h4 id="org990a0bc"><span class="todo _">記</span> </h4>
<div class="outline-text-4" id="text-org990a0bc">
<ul class="org-ul">
<li><p>只有一個 local-variable-table</p><p>用以在編譯時期解決局部變元的名與值的對應</p><p>這個數據結構被 jojo_compiler_syntax__local_variable_set</p><p>和 jojo_compiler_syntax__local_variable_get 所使用</p></li>
<li><p>其中保存</p><p><ul class="org-ul"></p><p><li><p>offset-in-local-variable</p></li></p><p><li><p>length-of-string</p></li></p><p><li><p>address-of-string</p></li></ul></p></li>
<li><p>並且每次在定義一個新的函數體的時候</p><p>這個 local-variable-table 會被初始化</p></li></ul>
</div>
</div>

<div id="outline-container-org4ceb115" class="outline-4">
<h4 id="org4ceb115"><span class="todo _">記</span> 接口</h4>
<div class="outline-text-4" id="text-org4ceb115">
<ul class="org-ul">
<li><p>(clear)</p><p>清空 offset 和 border</p></li>
<li><p>(insert)</p><p>插入字符串 和 offset-in-local-variable</p></li>
<li><p>(find)</p><p>通過字符串尋找 offset-in-local-variable</p></li>
<li><p>有兩個全局變量幫助實現這些接口</p><p><ul class="org-ul"></p><p><li><p>(cursor)</p><p>每次 find 的時候使用一個新的 cursor 來做循環</p></li></p><p><li><p>(border)</p><p>insert 會擴大 border</p><p>find 以 border 爲邊界</p></li></ul></p></li>
<li><p>另外 還有一個全局變量</p><p><ul class="org-ul"></p><p><li><p>(offset)</p><p>用以計算 offset-in-local-variable</p></li></ul></p></li></ul>
</div>
</div>

<div id="outline-container-orgb56c063" class="outline-4">
<h4 id="orgb56c063">memory allocation</h4>
<div class="outline-text-4" id="text-orgb56c063">
<div class="org-src-container">

<pre class="src src-fasm">size$local_variable_table = <span style="color: #ae81ff;">100</span> * <span style="color: #ae81ff;">1024</span>

address$local_variable_table <span style="color: #f92672; font-weight: bold;">labeling</span>
   <span style="color: #66d9ef; font-weight: bold;">preserve</span> size$local_variable_table
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8211ec" class="outline-4">
<h4 id="orgf8211ec">local-variable-table,clear</h4>
<div class="outline-text-4" id="text-orgf8211ec">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">border$local_variable_table</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$local_variable_table

<span style="color: #a6e22e;">offset$local_variable_table</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #ae81ff;">0</span>

define_function <span style="color: #e6db74;">"local-variable-table,clear"</span>, local_variable_table__clear
   <span style="color: #FF8888;">;; &lt;&lt; -- &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, address$local_variable_table
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, border$local_variable_table, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, offset$local_variable_table, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga312bad" class="outline-4">
<h4 id="orga312bad">local-variable-table,insert</h4>
<div class="outline-text-4" id="text-orga312bad">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"local-variable-table,insert"</span>, local_variable_table__insert
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- offset &gt;&gt;</span>

   <span style="color: #FF8888;">;; leave offset</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, offset$local_variable_table, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xxtuckx <span style="color: #FF8888;">;; return value</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, border$local_variable_table, get, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, border$local_variable_table, add_set

   <span style="color: #FF8888;">;; update offset$local_variable_table</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   count_front_colon
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   V__cell_size, multiple
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, offset$local_variable_table, add_set

   <span style="color: #FF8888;">;; leave length</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, border$local_variable_table, get, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, border$local_variable_table, add_set

   <span style="color: #66d9ef; font-weight: bold;">xx</span> tuck <span style="color: #FF8888;">;; for to update border$local_variable_table</span>

   <span style="color: #FF8888;">;; leave string</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, border$local_variable_table, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_to_buffer!

   <span style="color: #FF8888;">;; update border$local_variable_table</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, border$local_variable_table, add_set

   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd07431d" class="outline-4">
<h4 id="orgd07431d">local-variable-table,find</h4>
<div class="outline-text-4" id="text-orgd07431d">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">cursor$local_variable_table</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> address$local_variable_table

define_function <span style="color: #e6db74;">"local-variable-table,find"</span>, local_variable_table__find
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    -- offset, true</span>
   <span style="color: #FF8888;">;;    -- false &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, address$local_variable_table
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$local_variable_table, set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> local_variable_table__find__loop
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"local-variable-table,find,loop"</span>, local_variable_table__find__loop
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length]</span>
   <span style="color: #FF8888;">;;    -- offset, true</span>
   <span style="color: #FF8888;">;;    -- false &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$local_variable_table, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, border$local_variable_table, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span> greater_or_equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$local_variable_table, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   V__cell_size, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   V__cell_size, addition <span style="color: #FF8888;">;; address of string</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$local_variable_table, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   V__cell_size, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   get <span style="color: #FF8888;">;; length of string</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">8</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$local_variable_table, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     get <span style="color: #FF8888;">;; offset</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   true
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$local_variable_table, get
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   V__cell_size, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   get <span style="color: #FF8888;">;; length of string</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> V__cell_size, addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, cursor$local_variable_table, add_set
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, local_variable_table__find__loop
</pre>
</div>
</div>
</div>
