cicada-nymph.org
*** count-front-colon
    #+begin_src fasm :tangle cicada-nymph.fasm
    define_function "count-front-colon", count_front_colon
       ;; << string[address, length] -- number >>
       xx literal, 0 ;; counter
       xx count_front_colon__loop
       xx end

    define_function "count-front-colon,loop", count_front_colon__loop
       ;; << string[address, length], counter -- number >>
       xx over, zero?, false?branch, 4
       xx   xxswapx, drop2
       xx   end
       xx xxoverx, string__byte
       xx literal, ':', equal?, false?, false?branch, 4
       xx   xxswapx, drop2
       xx   end
       xx add1, xxswapx
       xx string__byte_tail, xswapxx
       xx tail_call, count_front_colon__loop
    #+end_src
** two syntaxes
*** ----------------------------------
*** local-variable-get-word?
    * :name
      ::name
    * but not
      :name:
      ::name:
    #+begin_src fasm :tangle cicada-nymph.fasm
    define_function "local-variable-get-word?", local_variable_get_word?
       ;; << string[address, length] -- bool >>
       xx dup, zero?, false?branch, 4
       xx   drop2, false
       xx   end
       xx dup2, addition, sub1
       xx get_byte, literal, ':'
       xx equal?, false?branch, 4
       xx   drop2, false
       xx   end
       xx dup2, count_front_colon
       xx dup, literal, 0, greater_than?, false?, false?branch, 5
       xx   drop, drop2, false
       xx   end
       xx subtraction
       xx swap, drop
       xx literal, 0, greater_than?
       xx end
    #+end_src
*** jojo-compiler-syntax:local-variable-get
    #+begin_src fasm :tangle cicada-nymph.fasm
    define_function "jojo-compiler-syntax:local-variable-get", jojo_compiler_syntax__local_variable_get
       ;; << string[address, length], word[address, length] --
       ;;    string[address, length] >>
       xx dup2
       xx local_variable_table__find, false?branch, (.not_found-$)/cell_size
       ;;   instruction__local_variable__n_get, <offese>, n
       xx     literal, instruction__local_variable__n_get
       xx       jojo_area__stay
       ;;     offset
       xx       jojo_area__stay
       ;;     n
       xx     count_front_colon
       xx       jojo_area__stay
       xx   end
    .not_found:
       xx write_local_variable_not_bound_report
       xx write_string
       xx literal, 10, write_byte
       xx end

    define_function "write-local-variable-not-bound-report", write_local_variable_not_bound_report
       xx literal, string$local_variable_not_bound_report
       xx literal, length$local_variable_not_bound_report
       xx write_string
       xx end

    string$local_variable_not_bound_report:
       db "* local-variable not bound : "
    .end:
    length$local_variable_not_bound_report = (.end - string$local_variable_not_bound_report)
    #+end_src
*** ----------------------------------
*** local-variable-set-word?
    * >:name
      >::name
    * but not
      >:name:
      >::name:
    #+begin_src fasm :tangle cicada-nymph.fasm
    define_function "local-variable-set-word?", local_variable_set_word?
       ;; << string[address, length] -- bool >>
       xx dup, zero?, false?branch, 4
       xx   drop2, false
       xx   end
       xx dup2, addition, sub1
       xx get_byte, literal, ':'
       xx equal?, false?branch, 4
       xx   drop2, false
       xx   end
       xx dup2, string__byte
       xx literal, '>', equal?, false?, false?branch, 4
       xx   drop2, false
       xx   end
       xx string__byte_tail
       xx dup2, count_front_colon
       xx dup, literal, 0, greater_than?, false?, false?branch, 5
       xx   drop, drop2, false
       xx   end
       xx subtraction
       xx swap, drop
       xx literal, 0, greater_than?
       xx end
    #+end_src
