cicada-nymph.html

<div id="outline-container-org47a30d8" class="outline-4">
<h4 id="org47a30d8">count-front-colon</h4>
<div class="outline-text-4" id="text-org47a30d8">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"count-front-colon"</span>, count_front_colon
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- number &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span> <span style="color: #FF8888;">;; counter</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> count_front_colon__loop
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"count-front-colon,loop"</span>, count_front_colon__loop
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], counter -- number &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> over, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xxswapx, drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> xxoverx, string__byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">':'</span>, equal?, false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   xxswapx, drop2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> add1, xxswapx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string__byte_tail, xswapxx
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">tail_call</span>, count_front_colon__loop
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga240090" class="outline-3">
<h3 id="orga240090">two syntaxes</h3>
<div class="outline-text-3" id="text-orga240090">
</div><div id="outline-container-org9751635" class="outline-4">
<h4 id="org9751635">local-variable-get-word?</h4>
<div class="outline-text-4" id="text-org9751635">
<ul class="org-ul">
<li><p>:name</p><p>::name</p></li>
<li><p>but not</p><p>:name:</p><p>::name:</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"local-variable-get-word?"</span>, local_variable_get_word?
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- bool &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, zero?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, addition, sub1
   <span style="color: #66d9ef; font-weight: bold;">xx</span> get_byte, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #e6db74;">':'</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> equal?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop2, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2, count_front_colon
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>, <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>, greater_than?, false?, <span style="color: #f92672; font-weight: bold;">false?branch</span>, <span style="color: #ae81ff;">5</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   drop, drop2, false
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> subtraction
   <span style="color: #66d9ef; font-weight: bold;">xx</span> swap, drop
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>, greater_than?
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org93f4856" class="outline-4">
<h4 id="org93f4856">jojo-compiler-syntax:local-variable-get</h4>
<div class="outline-text-4" id="text-org93f4856">
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"jojo-compiler-syntax:local-variable-get"</span>, jojo_compiler_syntax__local_variable_get
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length], word[address, length] --</span>
   <span style="color: #FF8888;">;;    string[address, length] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> dup2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> local_variable_table__find, <span style="color: #f92672; font-weight: bold;">false?branch</span>, (.not_found-$)/cell_size
   <span style="color: #FF8888;">;;   instruction__local_variable__n_get, &lt;offese&gt;, n</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     <span style="color: #f92672; font-weight: bold;">literal</span>, instruction__local_variable__n_get
   <span style="color: #66d9ef; font-weight: bold;">xx</span>       jojo_area__stay
   <span style="color: #FF8888;">;;     offset</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>       jojo_area__stay
   <span style="color: #FF8888;">;;     n</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>     count_front_colon
   <span style="color: #66d9ef; font-weight: bold;">xx</span>       jojo_area__stay
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">end</span>
<span style="color: #a6e22e;">.not_found</span>:
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_local_variable_not_bound_report
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">10</span>, write_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

define_function <span style="color: #e6db74;">"write-local-variable-not-bound-report"</span>, write_local_variable_not_bound_report
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$local_variable_not_bound_report
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, length$local_variable_not_bound_report
   <span style="color: #66d9ef; font-weight: bold;">xx</span> write_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

<span style="color: #a6e22e;">string$local_variable_not_bound_report</span>:
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"* local-variable not bound : "</span>
<span style="color: #a6e22e;">.end</span>:
length$local_variable_not_bound_report = (.end - string$local_variable_not_bound_report)
</pre>
</div>
</div>
</div>
