cicada-nymph.org
** allocate-conjugate-local-memory
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =64bit, machine {

   define_primitive_function "allocate-conjugate-local-memory", allocate_conjugate_local_memory
      ;; << size -- address >>
      mov rax, pointer$return_stack
      sub rax, address$return_stack
      test rax, unit__return_point
      jnz .return_stack_even

      pop_argument_stack rbx
      mov rax, [V__local_memory_even__current_free_address + cell_size]
      push_argument_stack rax
      add [V__local_memory_even__current_free_address + cell_size], rbx
      next

   .return_stack_even:
      pop_argument_stack rbx
      mov rax, [V__local_memory_odd__current_free_address + cell_size]
      push_argument_stack rax
      add [V__local_memory_odd__current_free_address + cell_size], rbx
      next

   }

   match =32bit, machine {

   define_primitive_function "allocate-conjugate-local-memory", allocate_conjugate_local_memory
      ;; << size -- address >>
      mov rax, [pointer$return_stack]
      sub rax, address$return_stack
      test rax, unit__return_point
      jnz .return_stack_even

      pop_argument_stack rbx
      mov rax, [V__local_memory_even__current_free_address + cell_size]
      push_argument_stack rax
      add [V__local_memory_even__current_free_address + cell_size], rbx
      next

   .return_stack_even:
      pop_argument_stack rbx
      mov rax, [V__local_memory_odd__current_free_address + cell_size]
      push_argument_stack rax
      add [V__local_memory_odd__current_free_address + cell_size], rbx
      next

   }
   #+end_src
** test
   #+begin_src cicada-nymph
   : test,allocate-local-memory
     << -- address, address >>
     16 allocate-local-memory
     16 allocate-local-memory
     end
   ; define-function
   test,allocate-local-memory

   <<
   40218513
   40218529
   >>

   : test,allocate-local-memory,2
     << -- address, address >>
     16 allocate-local-memory
     test,allocate-local-memory
     16 allocate-local-memory
     test,allocate-local-memory
     16 allocate-local-memory
     end
   ; define-function
   test,allocate-local-memory,2

   <<
   40218513
     40218529
     40218545
   40218529
     40218545
     40218561
   40218545
   >>
   #+end_src
* syscall
** note
   * there are two ways to treat the syscall
     1. syscall is NOT expose to cicada-nymph
        system functions are wraped in assembly code
        thus
        make cicada-nymph code be more clean
     2. syscall is expose to cicada-nymph
        system functions are wraped in cicada-nymph code
        thus
        more easy to wraped more system functions
        and
        make assembly code be more clean
        [only needs some system functions to load core file]
   * I choose the second way for now
** string->syscall-string
   #+begin_src fasm :tangle cicada-nymph.fasm
   string$string_to_syscall_string:
      times 256 db 0

   define_function "string->syscall-string", string_to_syscall_string
      ;; << string[address, length] -- syscall-string[address] >>
      xx dup
      xx   literal, string$string_to_syscall_string
      xx   addition
      xx   literal, 0
      xx   swap, set_byte
      xx literal, string$string_to_syscall_string
      xx string_to_buffer!
      xx literal, string$string_to_syscall_string
      xx end
   #+end_src
