cicada-nymph.html

<div id="outline-container-org8c29d59" class="outline-3">
<h3 id="org8c29d59">allocate-local-memory</h3>
<div class="outline-text-3" id="text-org8c29d59">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"allocate-local-memory"</span>, allocate_local_memory
   <span style="color: #FF8888;">;; &lt;&lt; size -- address &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, pointer$return_stack
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rax</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rax</span>, unit__return_point
   <span style="color: #a6e22e;">jnz</span> .return_stack_even

   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [V__local_memory_odd__current_free_address + cell_size]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> [V__local_memory_odd__current_free_address + cell_size], <span style="color: #fd971f;">rbx</span>
   next

<span style="color: #a6e22e;">.return_stack_even</span>:
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [V__local_memory_even__current_free_address + cell_size]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> [V__local_memory_even__current_free_address + cell_size], <span style="color: #fd971f;">rbx</span>
   next

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"allocate-local-memory"</span>, allocate_local_memory
   <span style="color: #FF8888;">;; &lt;&lt; size -- address &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rax</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rax</span>, unit__return_point
   <span style="color: #a6e22e;">jnz</span> .return_stack_even

   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [V__local_memory_odd__current_free_address + cell_size]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> [V__local_memory_odd__current_free_address + cell_size], <span style="color: #fd971f;">rbx</span>
   next

<span style="color: #a6e22e;">.return_stack_even</span>:
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [V__local_memory_even__current_free_address + cell_size]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> [V__local_memory_even__current_free_address + cell_size], <span style="color: #fd971f;">rbx</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7bf71e9" class="outline-3">
<h3 id="org7bf71e9">allocate-conjugate-local-memory</h3>
<div class="outline-text-3" id="text-org7bf71e9">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =64bit, machine {

define_primitive_function <span style="color: #e6db74;">"allocate-conjugate-local-memory"</span>, allocate_conjugate_local_memory
   <span style="color: #FF8888;">;; &lt;&lt; size -- address &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, pointer$return_stack
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rax</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rax</span>, unit__return_point
   <span style="color: #a6e22e;">jnz</span> .return_stack_even

   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [V__local_memory_even__current_free_address + cell_size]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> [V__local_memory_even__current_free_address + cell_size], <span style="color: #fd971f;">rbx</span>
   next

<span style="color: #a6e22e;">.return_stack_even</span>:
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [V__local_memory_odd__current_free_address + cell_size]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> [V__local_memory_odd__current_free_address + cell_size], <span style="color: #fd971f;">rbx</span>
   next

}

<span style="color: #a6e22e;">match</span> =32bit, machine {

define_primitive_function <span style="color: #e6db74;">"allocate-conjugate-local-memory"</span>, allocate_conjugate_local_memory
   <span style="color: #FF8888;">;; &lt;&lt; size -- address &gt;&gt;</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [pointer$return_stack]
   <span style="color: #a6e22e;">sub</span> <span style="color: #fd971f;">rax</span>, address$return_stack
   <span style="color: #a6e22e;">test</span> <span style="color: #fd971f;">rax</span>, unit__return_point
   <span style="color: #a6e22e;">jnz</span> .return_stack_even

   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [V__local_memory_even__current_free_address + cell_size]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> [V__local_memory_even__current_free_address + cell_size], <span style="color: #fd971f;">rbx</span>
   next

<span style="color: #a6e22e;">.return_stack_even</span>:
   pop_argument_stack <span style="color: #fd971f;">rbx</span>
   <span style="color: #a6e22e;">mov</span> <span style="color: #fd971f;">rax</span>, [V__local_memory_odd__current_free_address + cell_size]
   push_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">add</span> [V__local_memory_odd__current_free_address + cell_size], <span style="color: #fd971f;">rbx</span>
   next

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf632b10" class="outline-3">
<h3 id="orgf632b10"><span class="done test">test</span> </h3>
<div class="outline-text-3" id="text-orgf632b10">
<div class="org-src-container">

<pre class="src src-cicada-nymph"><span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">test,allocate-local-memory</span>
  <span style="color: #FF8888;">&lt;&lt; -- address, address &gt;&gt;</span>
  <span style="color: #fd971f; font-weight: bold;">16</span> <span style="color: #AE7C3B; font-weight: bold;">allocate-local-memory</span>
  <span style="color: #fd971f; font-weight: bold;">16</span> <span style="color: #AE7C3B; font-weight: bold;">allocate-local-memory</span>
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
test,allocate-local-memory

<span style="color: #FF8888;">&lt;&lt;</span>
<span style="color: #FF8888;">40218513</span>
<span style="color: #FF8888;">40218529</span>
<span style="color: #FF8888;">&gt;&gt;</span>

<span style="color: #ffff00; font-weight: bold;">:</span> <span style="color: #ef5939; font-weight: bold;">test,allocate-local-memory,2</span>
  <span style="color: #FF8888;">&lt;&lt; -- address, address &gt;&gt;</span>
  <span style="color: #fd971f; font-weight: bold;">16</span> <span style="color: #AE7C3B; font-weight: bold;">allocate-local-memory</span>
  test,allocate-local-memory
  <span style="color: #fd971f; font-weight: bold;">16</span> <span style="color: #AE7C3B; font-weight: bold;">allocate-local-memory</span>
  test,allocate-local-memory
  <span style="color: #fd971f; font-weight: bold;">16</span> <span style="color: #AE7C3B; font-weight: bold;">allocate-local-memory</span>
  <span style="color: #00ffff; font-weight: bold;">end</span>
<span style="color: #ffff00; font-weight: bold;">;</span> <span style="color: #ae81ff; font-weight: bold;">define-function</span>
test,allocate-local-memory,2

<span style="color: #FF8888;">&lt;&lt;</span>
<span style="color: #FF8888;">40218513</span>
<span style="color: #FF8888;">  40218529</span>
<span style="color: #FF8888;">  40218545</span>
<span style="color: #FF8888;">40218529</span>
<span style="color: #FF8888;">  40218545</span>
<span style="color: #FF8888;">  40218561</span>
<span style="color: #FF8888;">40218545</span>
<span style="color: #FF8888;">&gt;&gt;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc78f3ba" class="outline-2">
<h2 id="orgc78f3ba">syscall</h2>
<div class="outline-text-2" id="text-orgc78f3ba">
</div><div id="outline-container-orga79c513" class="outline-3">
<h3 id="orga79c513"><span class="todo note">note</span> </h3>
<div class="outline-text-3" id="text-orga79c513">
<ul class="org-ul">
<li><p>there are two ways to treat the syscall</p><p><ol class="org-ol"></p><p><li>syscall is NOT expose to cicada-nymph</p><p>system functions are wraped in assembly code</p><p>thus</p><p>make cicada-nymph code be more clean</li></p><p><li>syscall is expose to cicada-nymph</p><p>system functions are wraped in cicada-nymph code</p><p>thus</p><p>more easy to wraped more system functions</p><p>and</p><p>make assembly code be more clean</p><p>[only needs some system functions to load core file]</li></ol></p></li>
<li><p>I choose the second way for now</p></li></ul>
</div>
</div>
