cicada-nymph.org
** string->syscall-string-2
   #+begin_src fasm :tangle cicada-nymph.fasm
   string$string_to_syscall_string_2:
      times 256 db 0

   define_function "string->syscall-string-2", string_to_syscall_string_2
      ;; << string[address, length] -- syscall-string[address] >>
      xx dup
      xx   literal, string$string_to_syscall_string_2
      xx   addition
      xx   literal, 0
      xx   swap, set_byte
      xx literal, string$string_to_syscall_string_2
      xx string_to_buffer!
      xx literal, string$string_to_syscall_string_2
      xx end
   #+end_src
** syscall                            :64bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =64bit, platform machine {

   define_primitive_function "syscall", CICADA__syscall
      ;; << ..., argument2, argument1,
      ;;    syscall-number,
      ;;    number-of-arguments
      ;;    -- return-value >>
      pop_argument_stack rax
      cmp rax, 0
      je __syscall_with_0
      cmp rax, 1
      je __syscall_with_1
      cmp rax, 2
      je __syscall_with_2
      cmp rax, 3
      je __syscall_with_3
      cmp rax, 4
      je __syscall_with_4
      cmp rax, 5
      je __syscall_with_5
      cmp rax, 6
      je __syscall_with_6
      jmp __syscall_with_too_many

   __syscall_with_0:
      pop_argument_stack linux64_sys_n_rax
      syscall
      push_argument_stack rax
      next

   __syscall_with_1:
      pop_argument_stack linux64_sys_n_rax
      pop_argument_stack linux64_sys_1_rdi
      syscall
      push_argument_stack rax
      next

   __syscall_with_2:
      pop_argument_stack linux64_sys_n_rax
      pop_argument_stack linux64_sys_1_rdi
      pop_argument_stack linux64_sys_2_rsi
      syscall
      push_argument_stack rax
      next

   __syscall_with_3:
      pop_argument_stack linux64_sys_n_rax
      pop_argument_stack linux64_sys_1_rdi
      pop_argument_stack linux64_sys_2_rsi
      pop_argument_stack linux64_sys_3_rdx
      syscall
      push_argument_stack rax
      next

   __syscall_with_4:
      pop_argument_stack linux64_sys_n_rax
      pop_argument_stack linux64_sys_1_rdi
      pop_argument_stack linux64_sys_2_rsi
      pop_argument_stack linux64_sys_3_rdx
      pop_argument_stack linux64_sys_4_r10
      syscall
      push_argument_stack rax
      next

   __syscall_with_5:
      pop_argument_stack linux64_sys_n_rax
      pop_argument_stack linux64_sys_1_rdi
      pop_argument_stack linux64_sys_2_rsi
      pop_argument_stack linux64_sys_3_rdx
      pop_argument_stack linux64_sys_4_r10
      pop_argument_stack linux64_sys_5_r9
      syscall
      push_argument_stack rax
      next

   __syscall_with_6:
      pop_argument_stack linux64_sys_n_rax
      pop_argument_stack linux64_sys_1_rdi
      pop_argument_stack linux64_sys_2_rsi
      pop_argument_stack linux64_sys_3_rdx
      pop_argument_stack linux64_sys_4_r10
      pop_argument_stack linux64_sys_5_r9
      pop_argument_stack linux64_sys_6_r8
      syscall
      push_argument_stack rax
      next

   __syscall_with_too_many:
      call __exit_with_six

   }
   #+end_src
