cicada-nymph.html

<div id="outline-container-org5c326ed" class="outline-3">
<h3 id="org5c326ed">string-&gt;syscall-string</h3>
<div class="outline-text-3" id="text-org5c326ed">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">string$string_to_syscall_string</span>:
   <span style="color: #f92672; font-weight: bold;">times</span> <span style="color: #ae81ff;">256</span> <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #ae81ff;">0</span>

define_function <span style="color: #e6db74;">"string-&gt;syscall-string"</span>, string_to_syscall_string
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- syscall-string[address] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, string$string_to_syscall_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   swap, set_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$string_to_syscall_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_to_buffer!
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$string_to_syscall_string
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cbd323" class="outline-3">
<h3 id="org8cbd323">string-&gt;syscall-string-2</h3>
<div class="outline-text-3" id="text-org8cbd323">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">string$string_to_syscall_string_2</span>:
   <span style="color: #f92672; font-weight: bold;">times</span> <span style="color: #ae81ff;">256</span> <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #ae81ff;">0</span>

define_function <span style="color: #e6db74;">"string-&gt;syscall-string-2"</span>, string_to_syscall_string_2
   <span style="color: #FF8888;">;; &lt;&lt; string[address, length] -- syscall-string[address] &gt;&gt;</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">dup</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, string$string_to_syscall_string_2
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   addition
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   <span style="color: #f92672; font-weight: bold;">literal</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #66d9ef; font-weight: bold;">xx</span>   swap, set_byte
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$string_to_syscall_string_2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> string_to_buffer!
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$string_to_syscall_string_2
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3895db0" class="outline-3">
<h3 id="org3895db0">syscall&#xa0;&#xa0;&#xa0;<span class="tag"><span class="64bit">64bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org3895db0">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =64bit, platform machine {

define_primitive_function <span style="color: #e6db74;">"syscall"</span>, CICADA__syscall
   <span style="color: #FF8888;">;; &lt;&lt; ..., argument2, argument1,</span>
   <span style="color: #FF8888;">;;    syscall-number,</span>
   <span style="color: #FF8888;">;;    number-of-arguments</span>
   <span style="color: #FF8888;">;;    -- return-value &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_0
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">1</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_1
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_2
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_3
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_4
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">5</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_5
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">6</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_6
   <span style="color: #a6e22e;">jmp</span> __syscall_with_too_many

__syscall_with_0:
   pop_argument_stack linux64_sys_n_rax
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_1:
   pop_argument_stack linux64_sys_n_rax
   pop_argument_stack linux64_sys_1_rdi
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_2:
   pop_argument_stack linux64_sys_n_rax
   pop_argument_stack linux64_sys_1_rdi
   pop_argument_stack linux64_sys_2_rsi
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_3:
   pop_argument_stack linux64_sys_n_rax
   pop_argument_stack linux64_sys_1_rdi
   pop_argument_stack linux64_sys_2_rsi
   pop_argument_stack linux64_sys_3_rdx
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_4:
   pop_argument_stack linux64_sys_n_rax
   pop_argument_stack linux64_sys_1_rdi
   pop_argument_stack linux64_sys_2_rsi
   pop_argument_stack linux64_sys_3_rdx
   pop_argument_stack linux64_sys_4_r10
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_5:
   pop_argument_stack linux64_sys_n_rax
   pop_argument_stack linux64_sys_1_rdi
   pop_argument_stack linux64_sys_2_rsi
   pop_argument_stack linux64_sys_3_rdx
   pop_argument_stack linux64_sys_4_r10
   pop_argument_stack linux64_sys_5_r9
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_6:
   pop_argument_stack linux64_sys_n_rax
   pop_argument_stack linux64_sys_1_rdi
   pop_argument_stack linux64_sys_2_rsi
   pop_argument_stack linux64_sys_3_rdx
   pop_argument_stack linux64_sys_4_r10
   pop_argument_stack linux64_sys_5_r9
   pop_argument_stack linux64_sys_6_r8
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_too_many:
   <span style="color: #a6e22e;">call</span> __exit_with_six

}
</pre>
</div>
</div>
</div>
