cicada-nymph.org
** syscall                            :32bit:linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   match =linux =32bit, platform machine {

   define_primitive_function "syscall", CICADA__syscall
      ;; << ..., argument2, argument1,
      ;;    syscall-number,
      ;;    number-of-arguments
      ;;    -- return-value >>
      pop_argument_stack rax
      cmp rax, 0
      je __syscall_with_0
      cmp rax, 1
      je __syscall_with_1
      cmp rax, 2
      je __syscall_with_2
      cmp rax, 3
      je __syscall_with_3
      cmp rax, 4
      je __syscall_with_4
      cmp rax, 5
      je __syscall_with_5
      jmp __syscall_with_too_many

   __syscall_with_0:
      pop_argument_stack linux32_sys_n_eax
      syscall
      push_argument_stack rax
      next

   __syscall_with_1:
      pop_argument_stack linux32_sys_n_eax
      pop_argument_stack linux32_sys_1_ebx
      syscall
      push_argument_stack rax
      next

   __syscall_with_2:
      pop_argument_stack linux32_sys_n_eax
      pop_argument_stack linux32_sys_1_ebx
      pop_argument_stack linux32_sys_2_ecx
      syscall
      push_argument_stack rax
      next

   __syscall_with_3:
      pop_argument_stack linux32_sys_n_eax
      pop_argument_stack linux32_sys_1_ebx
      pop_argument_stack linux32_sys_2_ecx
      pop_argument_stack linux32_sys_3_edx
      syscall
      push_argument_stack rax
      next

   __syscall_with_4:
      pop_argument_stack linux32_sys_n_eax
      pop_argument_stack linux32_sys_1_ebx
      pop_argument_stack linux32_sys_2_ecx
      pop_argument_stack linux32_sys_3_edx
      pop_argument_stack linux32_sys_4_esi
      syscall
      push_argument_stack rax
      next

   __syscall_with_5:
      pop_argument_stack linux32_sys_n_eax
      pop_argument_stack linux32_sys_1_ebx
      pop_argument_stack linux32_sys_2_ecx
      pop_argument_stack linux32_sys_3_edx
      pop_argument_stack linux32_sys_4_esi
      pop_argument_stack linux32_sys_5_edi
      syscall
      push_argument_stack rax
      next

   __syscall_with_too_many:
      call __exit_with_six

   }
   #+end_src
* -----------------------------------
* epilog
** constant
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "*explainer,function*", CICADA__explain$function
      xx explain$function

   define_variable "*explainer,variable*", CICADA__explain$variable
      xx explain$variable
   #+end_src
** platform
   * this word is implemented as a function
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_function "platform", the_platform
      xx literal, string$platform
      xx literal, length$platform
      xx end

   string$platform:

   match =linux, platform {
      db "linux"
   }

   .end:
   length$platform = (.end - string$platform)
   #+end_src
** *un-initialized-memory*
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "*un-initialized-memory*", V__un_initialized_memory
     xx address$un_initialized_memory

   define_variable "*un-initialized-memory,size*", V__un_initialized_memory__size
     xx size$un_initialized_memory

   define_variable "*un-initialized-memory,current-free-address*", V__un_initialized_memory__current_free_address
     xx current_free_address$un_initialized_memory
   #+end_src
** *string-area,current-free-address*
   * the last_name_string_in_assembly
     is just "*string-area,current-free-address*"
   #+begin_src fasm :tangle cicada-nymph.fasm
   define_variable "*string-area,current-free-address*", V__string_area__current_free_address
      xx current_free_address$string_area
   #+end_src
** the_last_link_in_assembly_code
   * this word helps to initialize V__link
   #+begin_src fasm :tangle cicada-nymph.fasm
   the_last_link_in_assembly_code = link
   #+end_src
** un_initialized_memory              :linux:
   #+begin_src fasm :tangle cicada-nymph.fasm
   size$un_initialized_memory = 88 * 1024 * 1024 ;; (byte)

   match =linux, platform {

   segment readable writeable
   address$un_initialized_memory:
      rb size$un_initialized_memory

   }
   #+end_src
* ===================================
