cicada-nymph.html

<div id="outline-container-org799e6a1" class="outline-3">
<h3 id="org799e6a1">syscall&#xa0;&#xa0;&#xa0;<span class="tag"><span class="32bit">32bit</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org799e6a1">
<div class="org-src-container">

<pre class="src src-fasm"><span style="color: #a6e22e;">match</span> =linux =32bit, platform machine {

define_primitive_function <span style="color: #e6db74;">"syscall"</span>, CICADA__syscall
   <span style="color: #FF8888;">;; &lt;&lt; ..., argument2, argument1,</span>
   <span style="color: #FF8888;">;;    syscall-number,</span>
   <span style="color: #FF8888;">;;    number-of-arguments</span>
   <span style="color: #FF8888;">;;    -- return-value &gt;&gt;</span>
   pop_argument_stack <span style="color: #fd971f;">rax</span>
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">0</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_0
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">1</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_1
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">2</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_2
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">3</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_3
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">4</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_4
   <span style="color: #a6e22e;">cmp</span> <span style="color: #fd971f;">rax</span>, <span style="color: #ae81ff;">5</span>
   <span style="color: #a6e22e;">je</span> __syscall_with_5
   <span style="color: #a6e22e;">jmp</span> __syscall_with_too_many

__syscall_with_0:
   pop_argument_stack linux32_sys_n_eax
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_1:
   pop_argument_stack linux32_sys_n_eax
   pop_argument_stack linux32_sys_1_ebx
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_2:
   pop_argument_stack linux32_sys_n_eax
   pop_argument_stack linux32_sys_1_ebx
   pop_argument_stack linux32_sys_2_ecx
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_3:
   pop_argument_stack linux32_sys_n_eax
   pop_argument_stack linux32_sys_1_ebx
   pop_argument_stack linux32_sys_2_ecx
   pop_argument_stack linux32_sys_3_edx
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_4:
   pop_argument_stack linux32_sys_n_eax
   pop_argument_stack linux32_sys_1_ebx
   pop_argument_stack linux32_sys_2_ecx
   pop_argument_stack linux32_sys_3_edx
   pop_argument_stack linux32_sys_4_esi
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_5:
   pop_argument_stack linux32_sys_n_eax
   pop_argument_stack linux32_sys_1_ebx
   pop_argument_stack linux32_sys_2_ecx
   pop_argument_stack linux32_sys_3_edx
   pop_argument_stack linux32_sys_4_esi
   pop_argument_stack linux32_sys_5_edi
   <span style="color: #a6e22e;">syscall</span>
   push_argument_stack <span style="color: #fd971f;">rax</span>
   next

__syscall_with_too_many:
   <span style="color: #a6e22e;">call</span> __exit_with_six

}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org288a128" class="outline-2">
<h2 id="org288a128">epilog</h2>
<div class="outline-text-2" id="text-org288a128">
</div><div id="outline-container-orgeed509d" class="outline-3">
<h3 id="orgeed509d">constant</h3>
<div class="outline-text-3" id="text-orgeed509d">
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"*explainer,function*"</span>, CICADA__explain$function
   <span style="color: #66d9ef; font-weight: bold;">xx</span> explain$function

define_variable <span style="color: #e6db74;">"*explainer,variable*"</span>, CICADA__explain$variable
   <span style="color: #66d9ef; font-weight: bold;">xx</span> explain$variable
</pre>
</div>
</div>
</div>

<div id="outline-container-org4d234b6" class="outline-3">
<h3 id="org4d234b6">platform</h3>
<div class="outline-text-3" id="text-org4d234b6">
<ul class="org-ul">
<li><p>this word is implemented as a function</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_function <span style="color: #e6db74;">"platform"</span>, the_platform
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, string$platform
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">literal</span>, length$platform
   <span style="color: #66d9ef; font-weight: bold;">xx</span> <span style="color: #f92672; font-weight: bold;">end</span>

<span style="color: #a6e22e;">string$platform</span>:

<span style="color: #a6e22e;">match</span> =linux, platform {
   <span style="color: #66d9ef; font-weight: bold;">db</span> <span style="color: #e6db74;">"linux"</span>
}

<span style="color: #a6e22e;">.end</span>:
length$platform = (.end - string$platform)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5849a23" class="outline-3">
<h3 id="org5849a23"><b>un-initialized-memory</b></h3>
<div class="outline-text-3" id="text-org5849a23">
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"*un-initialized-memory*"</span>, V__un_initialized_memory
  <span style="color: #66d9ef; font-weight: bold;">xx</span> address$un_initialized_memory

define_variable <span style="color: #e6db74;">"*un-initialized-memory,size*"</span>, V__un_initialized_memory__size
  <span style="color: #66d9ef; font-weight: bold;">xx</span> size$un_initialized_memory

define_variable <span style="color: #e6db74;">"*un-initialized-memory,current-free-address*"</span>, V__un_initialized_memory__current_free_address
  <span style="color: #66d9ef; font-weight: bold;">xx</span> current_free_address$un_initialized_memory
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf8e3c1" class="outline-3">
<h3 id="orgdf8e3c1"><b>string-area,current-free-address</b></h3>
<div class="outline-text-3" id="text-orgdf8e3c1">
<ul class="org-ul">
<li><p>the last_name_string_in_assembly</p><p>is just "<b>string-area,current-free-address</b>"</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">define_variable <span style="color: #e6db74;">"*string-area,current-free-address*"</span>, V__string_area__current_free_address
   <span style="color: #66d9ef; font-weight: bold;">xx</span> current_free_address$string_area
</pre>
</div>
</div>
</div>

<div id="outline-container-org6fe77cc" class="outline-3">
<h3 id="org6fe77cc">the_last_link_in_assembly_code</h3>
<div class="outline-text-3" id="text-org6fe77cc">
<ul class="org-ul">
<li><p>this word helps to initialize V__link</p></li></ul>
<div class="org-src-container">

<pre class="src src-fasm">the_last_link_in_assembly_code = link
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f62ef" class="outline-3">
<h3 id="org3f62ef">un_initialized_memory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-org3f62ef">
<div class="org-src-container">

<pre class="src src-fasm">size$un_initialized_memory = <span style="color: #ae81ff;">88</span> * <span style="color: #ae81ff;">1024</span> * <span style="color: #ae81ff;">1024</span> <span style="color: #FF8888;">;; (byte)</span>

<span style="color: #a6e22e;">match</span> =linux, platform {

<span style="color: #f92672; font-weight: bold;">segment</span> <span style="color: #f92672; font-weight: bold;">readable</span> <span style="color: #f92672; font-weight: bold;">writeable</span>
<span style="color: #a6e22e;">address$un_initialized_memory</span>:
   <span style="color: #66d9ef; font-weight: bold;">rb</span> size$un_initialized_memory

}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
近死之心 莫使復陽也
</div>
</body>
</html>
